<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CriteriasSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('criterias')->insert([
            // โครงสร้าง
            // ตัวบ่งชี้ที่ 1 คุณสมบัติของผู้บริหารสถาบันการศึกษาพยาบาล
            [
                // id 1
                'name' => 'มีใบอนุญาตเป็นผู้ประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ ชั้นหนึ่ง ที่เป็นปัจจุบัน และเป็นผู้ปฏิบัติงานประจําเต็มเวลาของสถาบันการศึกษานั้น',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 1,
            ],
            [
                // id 2
                'name' => 'วุฒิการศึกษาไม่ต่ํากว่าปริญญาโททางการพยาบาล วิทยาศาสตร์สุขภาพ การบริหาร การศึกษา หรือมีตําแหน่งทางวิชาการไม่ต่ํากว่ารองศาสตราจารย์สาขาพยาบาลศาสตร์',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 1,
            ],
            [
                // id 3
                'name' => 'มีประสบการณ์ด้านการสอนในสถาบันการศึกษาพยาบาลมาแล้วไม่น้อยกว่า 5 ปี',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 1,
            ],
            [
                // id 4
                'name' => 'ดํารงตําแหน่งบริหารในสถาบันการศึกษาพยาบาล ไม่น้อยกว่า 2 ปี',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 1,
            ],
            [
                // id 5
                'name' => 'ผู้บริหารระดับรอง มีคุณสมบัติครบถ้วนตามข้อบังคับสภาการพยาบาลว่าด้วยหลักเกณฑ์การรับรองสถาบันฯ',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 1,
            ],
            // ตัวบ่งชี้ที่ 2 อาจารย์ประจำที่มีคุณวุฒิปริญญาเอก
            [
                'name' => 'ร้อยละของอาจารย์ประจําที่มีคุณวุฒิปริญญาเอกทางการพยาบาลไม่น้อยกว่า ร้อยละ 40',
                'description' => 'ร้อยละของอาจารย์ประจําที่มีคุณวุฒิปริญญาเอกทางการพยาบาลไม่น้อยกว่า ร้อยละ 40',
                'sequence' => 1,
                'indicator_id' => 2,
            ],
            // ตัวบ่งชี้ที่ 3 คุณสมบัติอาจารย์ประจำ
            [
                'name' => 'ร้อยละของอาจารย์ประจําที่มีคุณสมบัติตามเกณฑ์ต่ออาจารย์ประจําทั้งหมด ร้อยละ 85',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 3,
            ],
            // ตัวบ่งชี้ที่ 4 จำนวนและคุณสมบัติของอาจารย์ผู้รับผิดชอบหลักสูตร
            [
                'name' => 'สถาบันการศึกษามีอาจารย์ผู้รับผิดชอบหลักสูตรที่มีคุณสมบัติครบถ้วนตรงตามเกณฑ์มาตรฐานหลักสูตรครบทั้ง 5 สาขาหลัก ตลอดเวลาที่ใช้หลักสูตร',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 4,
            ],
            // ตัวบ่งชี้ที่ 5 สัดส่วนอาจารย์ประจำหลักสูตรต่ออาจารย์ประจำทั้งหมด
            [
                'name' => 'ร้อยละของอาจารย์ประจําหลักสูตรต่ออาจารย์ประจําทั้งหมด ร้อยละ 100',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 5,
            ],
            // ตัวบ่งชี้ที่ 6 สัดส่วนอาจารย์ประจำหลักสูตรต่ออาจารย์ประจำทั้งหมด
            [
                'name' => 'อัตราส่วนจํานวนอาจารย์ประจําต่อนิสิต/นักศึกษาเต็มเวลาเทียบเท่าไม่เกิน 1:6',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 6,
            ],
            // ตัวบ่งชี้ที่ 7 อัตราส่วนจำนวนอาจารย์ประจำหรือพยาบาลวิชาชีพ ที่ทำหน้าหน้าที่สอนภาคปฏิบัติต่อนิสิต/นักศึกษา
            [
                'name' => 'อัตราส่วนจํานวนอาจารย์ประจําหรือพยาบาลวิชาชีพ ที่ทำหน้าหน้าที่สอนภาคปฏิบัติต่อนิสิต/นักศึกษาไม่เกิน 1:6',
                'description' => '1.1) ไม่เกิน 1:4 กรณีพยาบาลวิชาชีพปฏิบัติงานประจําในขณะสอนภาคปฏิบัติ
                         1.2) ไม่เกิน 1:8 กรณีอาจารย์พยาบาลหรือพยาบาลวิชาชีพไม่ปฏิบัติงานประจํา ในขณะสอนภาคปฏิบัติ',
                'sequence' => 1,
                'indicator_id' => 7,
            ],
            [
                'name' => 'จํานวนพยาบาลวิชาชีพ ที่ทําหน้าที่สอนภาคปฏิบัติขณะที่ปฏิบัติงาน หรือไม่ปฏิบัติงานประจําไม่มากกว่าร้อยละ 40 ของความต้องการจํานวนอาจารย์ประจําของแต่ละรายวิชา',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 7,
            ],
            // ตัวบ่งชี้ที่ 8 สภาพแวดล้อมของสถาบันการศึกษา
            [
                'name' => 'ห้องปฏิบัติงานเหมาะสมต่อการปฏิบัติงานของอาจารย์และบุคลากร',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 8,
            ],
            [
                'name' => 'ห้องเรียนมีจำนวนและขนาดเหมาะสมกับจำนวนผู้เรียน มีโสตทัศนูปกรณ์ที่ได้มาตรฐาน เพียงพอและพร้อมใช้สำหรับผู้เรียนและผู้สอน',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 8,
            ],
            [
                'name' => 'ห้องปฏิบัติการวิทยาศาสตร์และวิทยาศาสตร์สุขภาพหรือในกรณีความร่วมมือทางวิชาการโดยใช้ห้องปฏิบัติการวิทยาศาสตร์และวิทยาศาสตร์สุขภาพของสถาบันการศึกษาอื่น ต้องมีอุปกรณ์ที่ได้มาตรฐานเพียงพอ พร้อมใช้ เอื้อต่อการจัดการเรียนการสอน',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 8,
            ],
            [
                'name' => 'มีอุปกรณ์และระบบความปลอดภัย ระบบป้องกันอัคคีภัย ช่วยชีวิตเบื้องต้น เพียงพอและพร้อมช่วยเหลือในสถานการณ์ฉุกเฉิน',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 8,
            ],
            [
                'name' => 'สถานที่และสิ่งแวดล้อม สะอาด สวยงาม ถูกสุขอนามัย ปลอดภัย',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 8,
            ],
            [
                'name' => 'สถานที่สำหรับจัดกิจกรรมเสริมหลักสูตร นันทนาการและการกีฬา',
                'description' => '',
                'sequence' => 6,
                'indicator_id' => 8,
            ],
            [
                'name' => 'มีอุปกรณ์และสิ่งอำนวยความสะดวก และเหมาะสมสำหรับบุคลากรและผู้เรียนที่ต้องการความช่วยเหลือพิเศษ',
                'description' => '',
                'sequence' => 7,
                'indicator_id' => 8,
            ],
            // ตัวบ่งชี้ที่ 9 ทรัพยากรด้านเทคโนโลยีสารสนเทศ

            [
                'name' => 'มีระบบสารสนเทศเพื่อการตัดสินใจ ด้านการบริหาร',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 9,
            ],
            [
                'name' => 'มีระบบสารสนเทศเพื่อการตัดสินใจ ด้านการเรียนการสอน',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 9,
            ],
            [
                'name' => 'มีระบบสารสนเทศเพื่อการตัดสินใจ ด้านการวิจัย',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 9,
            ],
            [
                'name' => 'มีระบบสารสนเทศเพื่อการตัดสินใจ ด้านการบริการวิชาการ',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 9,
            ],
            [
                'name' => 'มีระบบสารสนเทศเพื่อการตัดสินใจ ด้านการทำนุบำรุงศิลปะและวัฒนธรรม',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 9,
            ],
            // ตัวบ่งชี้ที่ 10 ศูนย์การเรียนรู้การปฏิบัติการพยาบาลและห้องปฏิบัติการเสมือนจริง
            [
                'name' => 'มีผู้รับผิดชอบและบุคลากรประจำศูนย์การเรียนรู้การปฏิบัติการพยาบาล',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 10,
            ],
            [
                'name' => 'มีห้องปฏิบัติการพยาบาลและอุปกรณ์การศึกษา เพียงพอ เหมาะสม และพร้อมใช้ ให้นักศึกษาฝึกปฏิบัติหัตถการทางการพยาบาล',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 10,
            ],
            [
                'name' => 'มีหลักฐานแสดงการฝึกความพร้อมของนักศึกษาในการใช้อุปกรณ์/เครื่องมือทางการแพทย์ ที่จำเป็นต่อชีวิตและความปลอดภัยของผู้ป่วย',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 10,
            ],
            [
                'name' => 'มีหุ่นจำลองผู้ป่วยเสมือนจริง(patient simulator) อย่างน้อย ได้แก่ หญิงตั้งครรภ์ หุ่นฝึกทำคลอด หุ่นเด็ก และหุ่นผู้ใหญ่ และผู้ป่วยเสมือนจริง (Standardized Patient)',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 10,
            ],
            [
                'name' => 'มีหลักฐานการใช้สถานการณ์จำลองเสมือนจริงที่สนับสนุนทักษะการฝึกปฏิบัติการพยาบาลที่ครอบคลุม 5 สาขาวิชาหลัก และสอดรับกับผลลัพธ์การเรียนรู้',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 10,
            ],
            // ตัวบ่งชี้ที่ 11 หนังสือ ตำรา วารสาร ฐานข้อมูล
            [
                'name' => 'มีหนังสือหรือตำราหลักทางการพยาบาลที่ไม่เกิน 10 ปี จำนวน 5 ชื่อเรื่องต่อสาขาวิชา ใน 5 สาขาวิชาหลัก ครอบคลุมทั้งภาษาไทยและภาษาต่างประเทศ ที่มีการบริหารจัดการให้ผู้เรียนทุกคนสามารถเข้าถึงได้อย่างเพียงพอ โดยระบุไว้ในรายละเอียดของรายวิชา และต้องมีจำนวนหนังสือ/ตำราหลักไม่น้อยกว่า 5 เล่มต่อชื่อเรื่อง',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 11,
            ],
            [
                'name' => 'มีหนังสือหรือตำราทางการพยาบาลและวิทยาศาสตร์สุขภาพที่ไม่เกิน 10 ปี ไม่น้อยกว่า 50 เล่มต่อนิสิต/นักศึกษา 1 คน หรือให้มีจำนวนไม่น้อยกว่า 20 เล่มต่อนิสิต/นักศึกษา ในกรณีที่มีฐานข้อมูลหนังสืออิเล็กทรอนิกส์ที่มีความต่อเนื่องไม่น้อยกว่า 1 ปี ที่มีผู้เข้าใช้งาน(user)ได้พร้อมกันทั้งสถาบัน',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 11,
            ],
            [
                'name' => 'มีระบบฐานข้อมูลวารสารการพยาบาลภาษาไทยอิเล็กทรอนิกส์ฉบับเต็ม ให้นิสิต/นักศึกษาเข้าถึงระบบการสืบค้นได้อย่างสะดวก โดยระบุรหัสและรายชื่อวารสารอย่างชัดเจน',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 11,
            ],
            [
                'name' => 'มีระบบฐานข้อมูลวารสารการพยาบาลภาษาอังกฤษอิเล็กทรอนิกส์ฉบับเต็มที่ครอบคลุมทั้ง 5 สาขาหลัก ให้นิสิต/นักศึกษาเข้าถึงระบบการสืบค้นได้อย่างสะดวก',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 11,
            ],
            [
                'name' => 'มีระบบการสืบค้นทรัพยากรสารสนเทศของห้องสมุดที่ผู้ใช้เข้าถึงได้ง่าย',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 11,
            ],
            // ตัวบ่งชี้ที่ 12 โครงสร้างการบริหารจัดการงานวิจัยและนวัตกรรม
            [
                'name' => 'มีผู้รับผิดชอบพันธกิจการผลิตงานวิจัยและนวัตกรรม',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 12,
            ],
            [
                'name' => 'มีหน่วยงานและบุคลากรสนับสนุนการผลิตงานวิจัยและนวัตกรรม',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 12,
            ],
            [
                'name' => 'มีงบประมาณสนับสนุนการผลิตงานวิจัยและนวัตกรรม',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 12,
            ],
            // ตัวบ่งชี้ที่ 13 โครงสร้างการบริหารจัดการงานบริการวิชาการ/วิชาชีพ/สังคม
            [
                'name' => 'มีผู้รับผิดชอบพันธกิจการบริการวิชาการ/วิชาชีพ/สังคม',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 13,
            ],
            [
                'name' => 'มีหน่วยงานที่สนับสนุนการบริการวิชาการ/วิชาชีพ/สังคม',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 13,
            ],
            [
                'name' => 'มีงบประมาณสนับสนุนการบริการวิชาการ/วิชาชีพ/สังคม',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 13,
            ],
            // ตัวบ่งชี้ที่ 14 โครงสร้างการบริหารจัดการงานทำนุบำรุงศิลปวัฒนธรรม
            [
                'name' => 'มีผู้รับผิดชอบพันธกิจการทำนุบำรุงศิลปะและวัฒนธรรม',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 14,
            ],
            [
                'name' => 'มีหน่วยงานที่สนับสนุนการทำนุบำรุงศิลปะและวัฒนธรรม',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 14,
            ],
            [
                'name' => 'มีงบประมาณสนับสนุนการทำนุบำรุงศิลปะและวัฒนธรรม',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 14,
            ],
            // ตัวบ่งชี้ที่ 15 โครงสร้างการบริหารจัดการงานพัฒนานิสิต/นักศึกษา/ศิษย์เก่า
            [
                'name' => 'มีผู้รับผิดชอบพันธกิจการพัฒนานิสิต/นักศึกษา/ศิษย์เก่า',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 15,
            ],
            [
                'name' => 'มีหน่วยงานที่สนับสนุนการพัฒนานิสิต/นักศึกษา/ศิษย์เก่า',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 15,
            ],
            [
                'name' => 'มีงบประมาณสนับสนุนการพัฒนานิสิต/นักศึกษา/ศิษย์เก่า',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 15,
            ],
            // กระบวนการ
            // ตัวบ่งชี้ที่ 1 การนำองค์กร
            [
                'name' => 'การกำหนดวิสัยทัศน์ และพันธกิจของสถาบัน มอบหมายผู้รับผิดชอบตามพันธกิจ ',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 16,
            ],
            [
                'name' => 'การถ่ายทอด/สื่อสารวิสัยทัศน์ พันธกิจ ให้กับบุคลากร นิสิต/นักศึกษา',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 16,
            ],
            [
                'name' => 'มีผลการดำเนินงานในการนำองค์กร โดยแสดงผล ',
                'description' => ' 3.1) การรับรู้และเข้าใจของบุคลากร นิสิต/นักศึกษา ต่อวิสัยทัศน์ และพันธกิจ 
                          3.2) ความพึงพอใจต่อช่องทาง/วิธีการการถ่ายทอด/สื่อสาร',
                'sequence' => 3,
                'indicator_id' => 16,
            ],
            [
                'name' => 'ทบทวนวิธีการกำหนดวิสัยทัศน์ วิธีการถ่ายทอด/สื่อสาร และปรับปรุงกระบวนการในข้อ 1 และ 2',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 16,
            ],
            // ตัวบ่งชี้ที่ 2 ยุทธศาสตร์
            [
                'name' => 'การจัดทำกลยุทธ์/ยุทธศาสตร์ แผนปฏิบัติการ และแผนจัดสรรงบประมาณ ที่สอดคล้องกับวิสัยทัศน์',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 17,
            ],
            [
                'name' => 'การถ่ายทอดกลยุทธ์/ยุทธศาสตร์และแผนปฏิบัติการไปยังบุคลากร',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 17,
            ],
            [
                'name' => 'การประเมินแผนกลยุทธ์/ยุทธศาสตร์ และแผนปฏิบัติการ รวมถึงแผนการจัดสรรงบประมาณ',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 17,
            ],
            [
                'name' => 'ทบทวนกระบวนการจัดทำแผนกลยุทธ์/ยุทธศาสตร์ แผนปฏิบัติการ แผนจัดสรรงบประมาณ และ ปรับปรุงกระบวนการในข้อ 1 และข้อ 2',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 17,
            ],
            // ตัวบ่งชี้ที่ 3 การประพฤติตามกฎหมายและจริยธรรม
            [
                'name' => 'ผู้นำประกาศเจตนารมย์ในการประพฤติปฏิบัติตามกฎระเบียบกฎหมายและจริยธรรม และการจัดการ ข้อร้องเรียน อุทธรณ์ ร้องทุกข์',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 18,
            ],
            [
                'name' => 'ผู้นำมีการกำกับดูแลให้บุคลากรมีการประพฤติตามกฎหมายและจริยธรรม',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 18,
            ],
            [
                'name' => 'ประเมินการประพฤติตามกฎระเบียบ กฎหมายและจริยธรรมของผู้นำ การกำกับดูแลให้บุคลากรใน องค์กรมีการประพฤติตามกฎหมายและจริยธรรม ครอบคลุม',
                'description' => ' - ดำเนินงานตามหลักธรรมาภิบาลของการบริหารกิจการบ้านเมืองที่ดีหรือการดำเนินการตามหลัก คุณธรรมและ ความโปร่งใสของการดำเนินงาน 
                 - ประเมินการรับรู้ของบุคลากรในเรื่อง การประพฤติปฏิบัติตามกฎระเบียบกฎหมายและจริยธรรม ของผู้นำ 
                 - การจัดการข้อร้องเรียน อุทธรณ์ ร้องทุกข์ ',
                'sequence' => 3,
                'indicator_id' => 18,
            ],
            [
                'name' => 'ทบทวนกระบวนการกำกับให้องค์กรมีการประพฤติ ปฏิบัติตามกฎระเบียบ กฎหมายและจริยธรรม ของผู้นำและบุคลากร การจัดการข้อร้องเรียน อุทธรณ์ ร้องทุกข์และปรับปรุงกระบวนการในข้อ 1 2 และข้อ 3 ',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 18,
            ],
            // ตัวบ่งชี้ที่ 4 การใช้ข้อมูลเพื่อการตัดสินใจ
            [
                'name' => 'ระบบการจัดเก็บ การประมวลผล การวิเคราะห์ข้อมูล ครอบคลุมทุกพันธกิจที่สถาบันกำหนดไว้',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 19,
            ],
            [
                'name' => 'กำกับติดตามให้มีข้อมูล/สารสนเทศที่เป็นปัจจุบัน ถูกต้อง พร้อมใช้ เข้าถึงได้',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 19,
            ],
            [
                'name' => 'นำข้อมูล/สารสนเทศไปใช้ในการติดตามผลการดำเนินงานตามพันธกิจ/ ใช้ในการตัดสินใจ ปรับกลยุทธ์/ ยุทธศาสตร์/แผนปฏิบัติการประจำปี และระบบปฏิบัติการ',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 19,
            ],
            [
                'name' => 'ทบทวนกระบวนการในข้อ 1 ถึง 3 และนำมาปรับปรุงกระบวนการใช้ข้อมูล/สารสนเทศเพื่อการตัดสินใจ ',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 19,
            ],
            // ตัวบ่งชี้ที่ 5 การบริหารความเสี่ยง
            [
                'name' => 'การจัดทำแผนการบริหารความเสี่ยงที่สอดคล้องกับยุทธศาสตร์ของสถาบัน ',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 20,
            ],
            [
                'name' => 'การจัดทำแผนเตรียมความพร้อมต่อภาวะฉุกเฉินและแผนความต่อเนื่องทางธุรกิจ (Business Continuity Plan: BCP)',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 20,
            ],
            [
                'name' => 'การนำแผนความเสี่ยง ไปใช้ในการควบคุมภายใน/จัดการ และมีการติดตาม ประเมินผลการดำเนินการ ตามแผน',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 20,
            ],
            [
                'name' => 'การซ้อมแผนการเตรียมความพร้อมต่อภาวะฉุกเฉินและแผนความต่อเนื่องทางธุรกิจ',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 20,
            ],
            [
                'name' => 'ทบทวนกระบวนการในข้อ 1 และ 2 และปรับปรุงแผนการบริหารความเสี่ยง แผนการเตรียมความพร้อม ต่อภาวะฉุกเฉิน และแผนความต่อเนื่องทางธุรกิจทุกปี',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 20,
            ],
            // ตัวบ่งชี้ที่ 6 การสร้างความร่วมมือ
            [
                'name' => 'แผนการพัฒนาความร่วมมือด้านการศึกษา วิจัย บริการวิชาการ หรือทำนุบำรุงศิลปวัฒนธรรมร่วมกับสถาบันอื่น',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 21,
            ],
            [
                'name' => 'การดำเนินการตามแผนให้เป็นไปตามความร่วมมือ',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 21,
            ],
            [
                'name' => 'มีการประเมินผลการดำเนินงาน และทบทวนกระบวนการในข้อ 1 และ 2',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 21,
            ],
            [
                'name' => 'ปรับปรุงกระบวนการดำเนินงาน และการพัฒนาความร่วมมือกับเครือข่าย',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 21,
            ],
            // ตัวบ่งชี้ที่ 7 ขีดความสามารถ และอัตรากำลัง
            [
                'name' => 'กำหนดขีดความสามารถ และการวางแผนด้านอัตรากำลังทั้งสายวิชาการและสายสนับสนุนที่สามารถตอบสนองต่อกลยุทธ์/ยุทธศาสตร์ และพันธกิจสำคัญที่สถาบันกำหนด',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 22,
            ],
            [
                'name' => 'สรรหา และจัดสรรบุคลากรทั้งสายวิชาการและสายสนับสนุนให้เหมาะกับงานและสอดคล้องต่อความต้องการและความจำเป็นของสถาบัน',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 22,
            ],
            [
                'name' => 'มีระบบการดูแลบุคลากรใหม่',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 22,
            ],
            [
                'name' => 'การเตรียมบุคลากรให้พร้อมรับต่อการเปลี่ยนแปลงในสถานการณ์ปกติและสถานการณ์ที่ไม่คาดหมาย',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 22,
            ],
            [
                'name' => 'ทบทวนกระบวนการในข้อ 1 ถึง 4 และปรับปรุงกระบวนการ',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 22,
            ],
            // ตัวบ่งชี้ที่ 8 การบริหารงานบุคคล(HRM)
            [
                'name' => 'การมอบหมายงานที่สอดคล้องกับพันธกิจและวิสัยทัศน์ของสถาบันทุกระดับ',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 23,
            ],
            [
                'name' => 'การจัดทำข้อตกลงการปฏิบัติงาน(Performance Agreement)',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 23,
            ],
            [
                'name' => 'การส่งเสริมความก้าวหน้าและความสำเร็จในงานโดยการประเมินผลการปฏิบัติงาน เพื่อใช้ในกระบวนการกำหนดค่าตอบแทน การให้รางวัลและการยกย่องชมเชย',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 23,
            ],
            [
                'name' => 'การกำกับติดตามให้มีการดำเนินงานในข้อ 1 2 และ3',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 23,
            ],
            [
                'name' => 'ทบทวนกระบวนการในข้อ 1 2 และ 3 และปรับปรุงระบบบริหารงานบุคคล',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 23,
            ],
            // ตัวบ่งชี้ที่ 9 การพัฒนาบุคลากร(HRD)
            [
                'name' => 'แผนการพัฒนาสมรรรถนะและประสิทธิภาพการจัดการเรียนการสอน การวิจัยและบริการวิชาการของอาจารย์',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 24,
            ],
            [
                'name' => 'การพัฒนาบุคลากรตามขีดความสามารถ สอดคล้องกับความต้องการพัฒนาตนเองของบุคลากรและความจำเป็นของสถาบัน',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 24,
            ],
            [
                'name' => 'แผนการพัฒนาผู้บริหาร',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 24,
            ],
            [
                'name' => 'การกำกับติดตามให้มีการดำเนินงานในข้อ 1 2 และ 3',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 24,
            ],
            [
                'name' => 'ทบทวนกระบวนการในข้อ 1 2 3 และ 4 และปรับปรุงกระบวนการพัฒนาบุคลากร',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 24,
            ],
            // ตัวบ่งชี้ที่ 10 การสร้างความผูกพัน.
            [
                'name' => 'มีการกำหนดปัจจัยขับเคลื่อนความผูกพันของบุคลากร',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 25,
            ],
            [
                'name' => 'มีการสร้างความผูกพันในบุคลากร',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 25,
            ],
            [
                'name' => 'มีการกำหนดนโยบายด้านสวัสดิการ สิทธิประโยชน์ และสภาพแวดล้อมในการทำงาน',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 25,
            ],
            [
                'name' => 'มีการกำกับติดตามให้มีการดำเนินงานในข้อ 1 ถึง 3',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 25,
            ],
            [
                'name' => 'ทบทวนกระบวนการในข้อ 1 ถึง 3 ปรับปรุงกระบวนการสร้างและจัดการความผูกพัน',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 25,
            ],
            // ตัวบ่งชี้ที่ 11 การบริหารหลักสูตร
            [
                'name' => 'ใช้หลักสูตรที่ผ่านความเห็นชอบจากสภาการพยาบาล และ การรับรองจากกระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 26,
            ],
            [
                'name' => 'มีการเผยแพร่หลักสูตร รวมทั้งผลลัพธ์การเรียนรู้ของหลักสูตรไปยัง อาจารย์ นักศึกษา และผู้มีส่วนได้เสีย',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 26,
            ],
            [
                'name' => 'มีระบบและกลไกในการบริหารหลักสูตรที่สอดคล้องกับการประกันคุณภาพของหลักสูตร',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 26,
            ],
            [
                'name' => 'มีการกำกับการบริหารหลักสูตรให้มีการดำเนินงานตามที่หลักสูตรกำหนด',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 26,
            ],
            [
                'name' => 'มีการกำกับให้นักศึกษาเกิดผลลัพธ์การเรียนรู้ตามที่หลักสูตรกำหนดร',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 26,
            ],
            // ตัวบ่งชี้ที่ 12 การจัดกระบวนการเรียนรู้และการประเมินผล
            [
                'name' => 'การจัดกระบวนการเรียนรู้ทั้งภาคทฤษฎีและภาคปฏิบัติสอดคล้องกับที่ได้ออกแบบไว้ในหลักสูตร',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 27,
            ],
            [
                'name' => 'การประเมินผลการเรียนรู้ทั้งภาคทฤษฎีและภาคปฏิบัติสอดคล้องกับที่ได้ออกแบบไว้ในหลักสูตร',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 27,
            ],
            [
                'name' => 'การกำกับติดตามการจัดกระบวนการเรียนรู้ การประเมินผลทั้งในระดับรายวิชา รายชั้นปี ตลอดหลักสูตรที่สอดคล้องกับที่ได้ออกแบบไว้ในหลักสูตร',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 27,
            ],
            [
                'name' => 'การดำเนินการให้เกิดนวัตกรรมการเรียนการสอนของอาจารย์ในสถาบัน ที่สอดคล้องกับผลลัพธ์การเรียนรู้ ความต้องการของผู้เรียน อาจารย์ หรือผู้ใช้บัณฑิต',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 27,
            ],
            [
                'name' => 'การทบทวนกระบวนการในข้อ 1-4 และนำมาปรับปรุงการจัดกระบวนการเรียนรู้และการประเมินผล',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 27,
            ],
            // ตัวบ่งชี้ที่ 13 กระบวนการรับนักศึกษา
            [
                'name' => 'แผนการรับและแนวทางการคัดเลือกนักศึกษา',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 28,
            ],
            [
                'name' => 'การกำกับดูแลให้เป็นไปตามข้อกำหนดของกระบวนการรับเข้าและแผนการรับนักศึกษา',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 28,
            ],
            [
                'name' => 'แผนการเตรียมความพร้อมของนักศึกษาใหม่และการกำกับให้เป็นไปตามแผน',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 28,
            ],
            [
                'name' => 'ทบทวนกระบวนการในข้อ 1 ถึง 3 และนำมาปรับปรุงกระบวนการรับนักศึกษาและการเตรียมความพร้อม',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 28,
            ],
            // ตัวบ่งชี้ที่ 14 กระบวนการจัดการสิ่งสนับสนุนการเรียนรู้
            [
                'name' => 'มีแผนการจัดการให้มีสิ่งสนับสนุนการเรียนรู้ที่ทันสมัย มีมาตรฐาน เพียงพอ พร้อมใช้ สอดคล้องกับความต้องการของผู้เรียนและอาจารย์ ครอบคลุม ห้องเรียน ห้องปฏิบัติการ ห้องสมุด เทคโนโลยีดิจิทัล เป็นอย่างน้อย',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 29,
            ],
            [
                'name' => 'มีการกำกับดูแลจัดการสิ่งสนับสนุนการเรียนรู้ให้เป็นไปตามแผน',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 29,
            ],
            [
                'name' => 'มีการทบทวนการดำเนินงานในข้อ 1 และ 2 และปรับปรุงกระบวนการจัดสิ่งสนับสนุนการเรียนรู้',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 29,
            ],
            // ตัวบ่งชี้ที่ 15 การประกันคุณภาพการศึกษา
            [
                'name' => 'แผนการพัฒนางานวิจัยและ/หรือนวัตกรรมที่สอดคล้องกับวิสัยทัศน์และความเชี่ยวชาญของสถาบัน รวมถึงแผนการพัฒนาบุคลากรให้มีศักยภาพในการสร้างงานวิจัย/นวัตกรรม การจัดสรรภารกิจและเวลาการสนับสนุนงบประมาณ การจัดบุคลากรช่วยสนับสนุนการวิจัยหรือการจัดที่ปรึกษา',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 30,
            ],
            [
                'name' => 'ระบบและกลไกการสนับสนุนงานวิจัยและนวัตกรรม',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 30,
            ],
            [
                'name' => 'การกำกับดูแลจริยธรรมและจรรยาบรรณนักวิจัย/นักวิชาการ',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 30,
            ],
            [
                'name' => 'การกำกับดูแลและส่งเสริมให้มีการผลิตงานวิจัยและนวัตกรรม รวมถึงการนำไปใช้ประโยชน์',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 30,
            ],
            [
                'name' => 'มีการทบทวนการดำเนินงานในข้อ 1 ถึง 4 และนำมาปรับปรุงแผนและการดำเนินงาน',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 30,
            ],

            // ตัวบ่งชี้ที่ 16 กระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญา
            [
                'name' => 'มีแผนการส่งเสริมการเผยแพร่งานวิจัยและ/หรือการจดทรัพย์สินทางปัญญาในระดับชาติ/นานาชาติ',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 31,
            ],
            [
                'name' => 'มีระบบและกลไกการกำกับดูแลให้มีการเผยแพร่งานวิจัยและ/หรือการจดทรัพย์สินทางปัญญา',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 31,
            ],
            [
                'name' => 'มีการทบทวนการดำเนินงานในข้อ 1 และ2 นำมาปรับปรุงแผนและกระบวนการเผยแพร่งานวิจัย และ/หรือการจดทรัพย์สินทางปัญญา',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 31,
            ],
            // ตัวบ่งชี้ที่ 17 การบริการวิชาการเพื่อชุมชน/สังคม
            [
                'name' => 'มีแผนบริการวิชาการแก่สังคมของสถาบันเพื่อสุขภาพชุมชน/สังคมที่สอดคล้องกับวิสัยทัศน์และความเชี่ยวชาญของสถาบัน และตอบสนองต่อความต้องการด้านสุขภาพของชุมชน/สังคม',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 32,
            ],
            [
                'name' => ' มีระบบและกลไกการให้บริการวิชาการแก่ชุมชน/สังคม',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 32,
            ],
            [
                'name' => 'มีการกำกับดูแลให้มีการบริการวิชาการแก่ชุมชน/สังคมตามแผน',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 32,
            ],
            [
                'name' => 'มีการทบทวนการดำเนินงานในข้อ 1 ถึง 3 และนำมาปรับปรุงแผนและการดำเนินงาน',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 32,
            ],
            // ตัวบ่งชี้ที่ 18 การปฏิบัติการพยาบาลของอาจารย์ (faculty pracitce)
            [
                'name' => 'แผนการปฏิบัติการพยาบาลของอาจารย์ในสาขาที่รับผิดชอบ และการสนับสนุนให้มีการดำเนินงานตามแผน',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 33,
            ],
            [
                'name' => 'การจัดการผลลัพธ์ที่เกิดจากการปฏิบัติการพยาบาลของอาจารย์',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 33,
            ],
            [
                'name' => 'การใช้ความรู้จากการปฏิบัติการพยาบาลเพื่อพัฒนาการเรียนการสอน/การบริการวิชาการ/วิจัย',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 33,
            ],
            [
                'name' => 'ทบทวนการดำเนินงานในข้อ 1 ถึง 3 และนำมาปรับปรุงการปฏิบัติการพยาบาลของอาจารย์(faculty practice',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 33,
            ],
            // ตัวบ่งชี้ที่ 19 การบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรม กับ การเรียนการสอน/บริการวิชาการ/วิจัย
            [
                'name' => 'มีแผนการทำนุบำรุงศิลปวัฒนธรรมที่มีโครงการ/กิจกรรมซึ่งบูรณาการกับการเรียนการสอน/บริการวิชาการ/วิจัย',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 34,
            ],
            [
                'name' => 'มีระบบและกลไกการดำเนินงานบูรณาการกับการบริการวิชาการหรือการเรียนการสอนหรือวิจัย',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 34,
            ],
            [
                'name' => 'ทบทวนการดำเนินงานในข้อ 1 และ 2 และนำมาปรับปรุงแผนและการดำเนินงานการบูรณาการการเรียนการสอน บริการวิชาการ วิจัย และทำนุบำรุงศิลปวัฒนธรรม',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 34,
            ],
            // ตัวบ่งชี้ที่ 20 การพัฒนานักศึกษา
            [
                'name' => 'แผนการพัฒนานักศึกษาให้มีคุณลักษณะที่สอดคล้องกับอัตลักษณ์บัณฑิต/ค่านิยมของสถาบัน',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 35,
            ],
            [
                'name' => 'มีระบบและกลไกการพัฒนานักศึกษา ครอบคลุมการให้คำปรึกษา การช่วยเหลือนักศึกษา การรับและจัดการข้อร้องเรียนของนักศึกษา การสนับสนุนให้นักศึกษาประพฤติตามกฎระเบียบและหลักจริยธรรม',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 35,
            ],
            [
                'name' => 'มีการดำเนินงานพัฒนานักศึกษาตามแผนที่กำหนด',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 35,
            ],
            [
                'name' => 'ทบทวนการดำเนินงานในข้อ 1 ถึง 3 และนำมาปรับปรุงแผนและกระบวนการพัฒนานักศึกษา',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 35,
            ],
            // ตัวบ่งชี้ที่ 21 ความผูกพันของนักศึกษาและศิษย์เก่า
            [
                'name' => 'แผนการจัดการความสัมพันธ์ของนักศึกษาและศิษย์เก่ากับสถาบัน',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 36,
            ],
            [
                'name' => 'ระบบและกลไกการสร้างความสัมพันธ์ของนักศึกษาและศิษย์เก่ากับสถาบัน',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 36,
            ],
            [
                'name' => 'มีการดำเนินการสร้างความสัมพันธ์ของนักศึกษาและศิษย์เก่ากับสถาบันตามแผน',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 36,
            ],
            [
                'name' => 'ทบทวนการดำเนินงานในข้อ 1, 2 และ 3 และนำมาปรับปรุงแผนและกระบวนการสร้างความผูกพัน',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 36,
            ],
            // ผลลัพธ์
            // ตัวบ่งชี้ที่ 1 ผลการประเมินการบริหารงานของคณะผู้บริหารด้วยหลักธรรมาภิบาล หรือ การดำเนินการตามหลักคุณธรรมและความโปร่งใสของการดำเนินงาน
            [
                'name' => 'ผลการประเมินการบริหารงานด้วยหลักธรรมาภิบาลหรือการดำเนินการตามหลักคุณธรรมและ ความโปร่งใสของการดำเนินงานอย่างครบถ้วนทั้ง 10 ประการ',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 37,
            ],
            // ตัวบ่งชี้ที่ 2 ผลลัพธ์ของความสำเร็จของความร่วมมือกับสถาบันอื่น
            [
                'name' => 'มีผลลัพธ์ของความสำเร็จของความร่วมมือฯระดับชาติหรือนานาชาติ',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 38,
            ],
            [
                'name' => 'มีผลลัพธ์ของความสำเร็จของความร่วมมือฯระดับชาติและนานาชาติ',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 38,
            ],

            // ตัวบ่งชี้ที่ 3 ร้อยละของการดำเนินการที่บรรลุเป้าหมายตามแผนกลยุทธ์/ยุทธ์ศาสตร์
            [
                'name' => 'มีการประเมินผลลัพธ์ความสำเร็จของการดำเนินการตามแผนกลยุทธ์/ยุทธศาสตร์',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 39,
            ],
            // ตัวบ่งชี้ที่ 4 ร้อยละของการใช้จ่ายตามแผนการจัดสรรงบประมาณ
            [
                'name' => 'การประเมินผลการใช้จ่ายตามแผนการจัดสรรงบประมาณที่กำหนดไว้',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 40,
            ],
            // ตัวบ่งชี้ที่ 5 อัตราคงอยู่ของอาจารย์
            [
                'name' => 'ผลของการดำเนินงานบริหารและพัฒนาอาจารย์ มีการส่งเสริมให้อาจารย์มีความรักและผูกพันในองค์กร ส่งผลให้อาจารย์มีการปฏิบัติงานตามวิชาชีพในองค์กรอย่างต่อเนื่อง ข้อมูล 3 ปีย้อนหลัง (การสูญเสียไม่นับรวมการเสียชีวิต หรือการเกษียณอายุ หรือสถาบันประเมินให้ออก/ไม่ต่อสัญญา)',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 41,
            ],
            // ตัวบ่งชี้ที่ 6 อัตราคงอยู่ของบุคลากรสายสนับสนุน
            [
                'name' => ' ผลของการดำเนินงานบริหารและพัฒนาบุคลากรสายสนับสนุน มีการส่งเสริมให้เกิดความรักและผูกพันในองค์กร ส่งผลให้มีการปฏิบัติงานในองค์กรอย่างต่อเนื่อง ข้อมูล 3 ปีย้อนหลัง (การสูญเสียไม่นับรวมการเสียชีวิต หรือการเกษียณอายุ หรือสถาบันประเมินให้ออก/ไม่ต่อสัญญา)',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 42,
            ],
            // ตัวบ่งชี้ที่ 7 ผลลัพธ์การพัฒนาคุณภาพการจัดการเรียนการสอนของอาจารย์
            [
                'name' => '  คุณภาพการจัดการเรียนการสอนในแต่ละองค์ประกอบข้างต้น กำหนดให้มีระดับของคุณภาพของแต่ละองค์ประกอบ จำนวน 4 ระดับ',
                'description' => ' ระดับที่ 1 เป็นผู้มีความรู้ความเข้าใจในศาสตร์ของตนและประยุกต์ใช้ได้ มีความรู้ความเข้าใจในศาสตร์การเรียนรู้เบื้องต้น สามารถออกแบบกิจกรรม จัดบรรยากาศ ใช้ทรัพยากรและสื่อการเรียนรู้ โดยคำนึงถึงผู้เรียนและ ปัจจัยที่ส่งผลต่อการเรียนรู้ สามารถวัดและประเมินผลการเรียนรู้ของผู้เรียนนำผลประเมินมาใช้ปรับปรุงพัฒนา การจัดการเรียนรู้ พัฒนาตนเองอย่างต่อเนื่อง เปิดใจรับฟังความคิดเห็นจากผู้ที่เกี่ยวข้อง และปฏิบัติตามจรรยาบรรณ วิชาชีพอาจารย์ขององค์กร
                    ระดับที่ 2 เป็นผู้มีคุณภาพการจัดการเรียนการสอนระดับที่ 1 ที่มีความรู้ลึกในศาสตร์ของตน และติดตาม ความก้าวหน้าของความรู้ในศาสตร์อย่างสม่ำเสมอ มีความรู้ความเข้าใจในศาสตร์การเรียนรู้ สามารถจัดการเรียนรู้ ที่เหมาะสมกับกลุ่มผู้เรียน กำกับดูแลและติดตามผลการเรียนรู้ของผู้เรียนอย่างเป็นระบบ ให้คำปรึกษาชี้แนะแก่เพื่อน อาจารย์ในศาสตร์ได้ และส่งเสริมให้เกิดการปฏิบัติตามจรรยาบรรณวิชาชีพอาจารย์ภายในองค์กร
                    ระดับที่ 3 เป็นผู้มีคุณภาพการจัดการเรียนการสอนระดับที่ 2 ที่เชี่ยวชาญในศาสตร์ของตน ศาสตร์การเรียนรู้ และการจัดการเรียนรู้ข้ามศาสตร์ นำผลการวิจัยในชั้นเรียนมาพัฒนาการจัดการเรียนรู้ เป็นพี่เลี้ยงและผู้ชี้แนะในระดับ องค์กรด้านการจัดการเรียนรู้ และนโยบายด้านจรรยาบรรณวิชาชีพอาจารย์
                    ระดับที่ 4 เป็นผู้มีคุณภาพการจัดการเรียนการสอนระดับที่ 3 ที่เป็นผู้นำในศาสตร์ของตน ศาสตร์การเรียนรู้ และการจัดการเรียนรู้ข้ามศาสตร์ เป็นที่ยอมรับทั้งภายในและภายนอกองค์กร มีส่วนร่วมในการกำหนดนโยบายและ กลยุทธ์ในการพัฒนาองค์ความรู้ และการจัดการเรียนรู้ในระดับชาติ และนานาชาติ เป็นผู้นำเชิงนโยบายด้าน จรรยาบรรณวิชาชีพอาจารย์',
                'sequence' => 1,
                'indicator_id' => 43,
            ],
            // ตัวบ่งชี้ที่ 8 ผลการประเมินผลลัพธ์การเรียนรู้
            [
                'name' => 'ร้อยละนักศึกษาชั้นปีสุดท้ายที่มีผลลัพธ์การเรียนรู้ครบตามที่กำหนดไว้ในหลักสูตรประเมินโดยนักศึกษาและอาจารย์ผู้รับผิดชอบหลักสูตรประเมิน (PLOs)',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 44,
            ],
            // ตัวบ่งชี้ที่ 9 ร้อยละของผู้สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลผ่านในครั้งแรก
            [
                'name' => 'ร้อยละของผู้สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ผ่านในครั้งแรกของจำนวนผู้สำเร็จการศึกษาในปีการศึกษานั้น',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 45,
            ],
            // ตัวบ่งชี้ที่ 10 ร้อยละของผู้สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลผ่านในปีแรก
            [
                'name' => ' ร้อยละของผู้สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ผ่านในปีแรกของจำนวนผู้สำเร็จการศึกษาในปีการศึกษานั้น',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 46,
            ],
            // ตัวบ่งชี้ที่ 11 หลักสูตรได้รับการรับรองคุณภาพหลักสูตรตามมาตรฐานระดับสากล
            [
                'name' => '',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 47,
            ],
            [
                'name' => 'มีการดำเนินการประกันคุณภาพการศึกษาภายในระดับหลักสูตรตามที่สภาสถาบันอุดมศึกษากำหนด (5 คะแนน)',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 47,
            ],
            [
                'name' => 'มีการประกันคุณภาพการศึกษาภายในระดับหลักสูตรตามเกณฑ์มาตรฐานระดับสากลที่สภาสถาบันอุดมศึกษากำหนดโดยผู้ประเมินภายนอกมหาวิทยาลัยร่วมด้วยและได้ผลการประเมินระดับดีขึ้นไป (10 คะแนน)',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 47,
            ],
            // ตัวบ่งชี้ที่ 12 ผลการประเมินสถานที่และการใช้สิ่งสนับสนุนการเรียนรู้
            [
                'name' => 'การใช้ห้องปฏิบัติการพยาบาล',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 48,
            ],
            [
                'name' => 'การเข้าถึงข้อมูลทางอินเทอร์เน็ต',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 48,
            ],
            [
                'name' => 'อาคาร สถานที่ และสภาพแวดล้อมเอื้อต่อการเรียนรู้ สะอาด สวยงาม ถูกสุขอนามัย ปลอดภัย',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 48,
            ],
            [
                'name' => 'สิ่งสนับสนุนการเรียนรู้ด้วยตนเองของผู้เรียน',
                'description' => '',
                'sequence' => 4,
                'indicator_id' => 48,
            ],
            [
                'name' => 'การให้บริการในการใช้หนังสือ ตำรา วารสาร ของผู้เรียนและอาจารย์',
                'description' => '',
                'sequence' => 5,
                'indicator_id' => 48,
            ],
            // ตัวบ่งชี้ที่ 13 ผลลัพธ์การพัฒนาน
            [
                'name' => 'จำนวนผลงานทางวิชาการที่ตีพิมพ์เผยแพร่โดยอาจารย์ในสถาบันนั้น ๆ ที่เป็นไปตามกฏกระทรวง มาตรฐานการขอตำแหน่งทางวิชาการในสถาบันอุดมศึกษา ของกระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรมต่ออาจารย์ประจำทั้งหมด ร้อยละ 70 ภายใน 5 ปีย้อนหลัง(หากเป็นผลงานวิชาการที่เผยแพร่หลัง 24 มิถุนายน 2565 เป็นต้นไปต้องเป็นชื่อแรกหรือผู้ประพันธ์บรรณกิจเท่านั้น)',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 49,
            ],
            // ตัวบ่งชี้ที่ 14 ผลลัพธ์การผลิตตำรา/หนังสือ
            [
                'name' => 'จำนวนตำรา/หนังสือที่ตีพิมพ์เผยแพร่โดยอาจารย์ในสถาบันนั้น ๆ เฉลี่ย 3 ปีย้อนหลัง โดยกำหนดคุณภาพของตำรา/หนังสือ ดังนี้
              ตำรา/หนังสือที่มีคุณภาพผ่านตามหลักเกณฑ์การขอตำแหน่งทางวิชาการ แต่ไม่ได้นำมาขอรับการประเมินตำแหน่งทางวิชาการ หรือ
              ตำรา/หนังสือที่มีคุณภาพผ่านตามหลักเกณฑ์การขอตำแหน่งทางวิชาการ และเป็นส่วนหนึ่งที่ทำให้ได้รับตำแหน่งทางวิชาการตามที่กำหนด',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 50,
            ],
            // ตัวบ่งชี้ที่ 15  จำนวนทรัพย์สินทางปัญญา (สิทธิบัตรและอนุสิทธิบัตร)
            [
                'name' => 'มีผลงานวิชาการของสถาบันการศึกษา/อาจารย์ประจำที่ได้รับการจดทะเบียน ลิขสิทธิ์ อนุสิทธิบัตรและสิทธิบัตร ภายใน 5 ปี ย้อนหลัง',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 51,
            ],
            // ตัวบ่งชี้ที่ 16 ผลลัพธ์ของโครงการบริการวิชาการที่เป็นประโยชน์ต่อสังคมและประเทศ
            [
                'name' => 'การดำเนินงานด้านบริการวิชาการแก่สังคมทุกโครงการต้องมีการประเมินผลลัพธ์ของโครงการและแผนงาน เพื่อนำข้อมูลมาใช้ในการวางแผนการดำเนินงานในปีต่อไป',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 52,
            ],
            // ตัวบ่งชี้ที่ 17 ร้อยละของอาจารย์พยาบาลประจำที่ปฏิบัติการพยาบาลในสาขาวิชาที่รับผิดชอบ
            [
                'name' => ' ร้อยละของอาจารย์พยาบาลประจำที่ปฏิบัติการพยาบาลในสาขาวิชาที่รับผิดชอบ อย่างน้อย 80 ชั่วโมง/ปีการศึกษา ย้อนหลัง 3 ปี โดยเริ่มตั้งแต่ปีการศึกษา 2568 เป็นต้นไป',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 53,
            ],
            // ตัวบ่งชี้ที่ 18 ตัวบ่งชี้ที่ 18 การปฏิบัติการพยาบาลของอาจารย์ (faculty pracitce)
            [
                'name' => '  การบูรณาการกับการเรียนการสอนในรายวิชาที่เกี่ยวข้อง',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 54,
            ],
            [
                'name' => 'การบูรณาการกับการเรียนการสอนในรายวิชาที่เกี่ยวข้องและการวิจัยหรือการบริการวิชาการ',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 54,
            ],
            [
                'name' => ' การบูรณาการกับการเรียนการสอนในรายวิชาที่เกี่ยวข้องและการวิจัยและการบริการวิชาการ ',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 54,
            ],

            // ตัวบ่งชี้ที่ 19 ร้อยละของบัณฑิตที่มีอัตลักษณ์/คุณลักษณะพิเศษตามที่สถาบันกำหนด
            [
                'name' => 'อยละของบัณฑิตมีอัตลักษณ์/คุณลักษณะพิเศษตามที่สถาบันกำหนดต่อจำนวนบัณฑิตทั้งหมดโดยการประเมินจากผู้ใช้บัณฑิต ภายหลังสำเร็จการศึกษา 1 ปี',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 55,
            ],
            // ตัวบ่งชี้ที่ 20 การทำคุณประโยชน์ต่อสถาบันของศิษย์เก่า
            [
                'name' => 'ศิษย์เก่ามีส่วนร่วมในการดำเนินกิจกรรมด้านการพัฒนาวิชาการ/วิชาชีพของสถาบัน',
                'description' => '',
                'sequence' => 1,
                'indicator_id' => 56,
            ],
            [
                'name' => 'มีแผนงานสร้างความสัมพันธ์กับศิษย์เก่าและดำเนินการตามแผน',
                'description' => '',
                'sequence' => 2,
                'indicator_id' => 56,
            ],
            [
                'name' => 'การจัดตั้งชมรม/สมาคมศิษย์เก่าของสถาบันการศึกษา',
                'description' => '',
                'sequence' => 3,
                'indicator_id' => 56,
            ],

        ]);
    }
}
