<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class DepartmentsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

  
        \DB::table('departments')->insert(array (
            0 => 
            array (
                'id' => 1,
                'name' => 'หน่วยจัดการงานทั่วไป',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            1 => 
            array (
                'id' => 2,
                'name' => 'หน่วยทรัพยากรบุคคล',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            2 => 
            array (
                'id' => 3,
                'name' => 'หน่วยยุทธศาสตร์และพัฒนาคุณภาพ',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            3 => 
            array (
                'id' => 4,
                'name' => 'หน่วยเทคโนโลยีเพื่อการบริหารองค์กร',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            4 => 
            array (
                'id' => 5,
                'name' => 'หน่วยอาคารสถานที่และยานพาหนะ',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            5 => 
            array (
                'id' => 6,
                'name' => 'หอพักนักศึกษา',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            6 => 
            array (
                'id' => 7,
                'name' => 'หน่วยจัดการศึกษาปริญญาตรี',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            7 => 
            array (
                'id' => 8,
                'name' => 'หน่วยการต่างประเทศ',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            8 => 
            array (
                'id' => 9,
                'name' => 'หน่วยพัฒนานักศึกษาและศิษย์เก่าสัมพันธ์',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            9 => 
            array (
                'id' => 10,
                'name' => 'หน่วยเทคโนโลยีเพื่อการศึกษา',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            10 => 
            array (
                'id' => 11,
                'name' => 'หน่วยห้องปฏิบัติการพยาบาล',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            11 => 
            array (
                'id' => 12,
                'name' => 'หน่วยห้องสมุด',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            12 => 
            array (
                'id' => 13,
            'name' => 'หน่วยวิจัยและบริการวิชาการ (วิจัย)',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            13 => 
            array (
                'id' => 14,
            'name' => 'หน่วยวิจัยและบริการวิชาการ (บริการวิชาการ)',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
            14 => 
            array (
                'id' => 15,
                'name' => 'หน่วยจัดการศึกษาปริญญาตรีฯ',
                'created_at' => '2025-09-15 12:52:10',
                'updated_at' => '2025-09-15 12:52:10',
            ),
        ));
        
        
    }
}