<?php
namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class IndicatorsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('indicators')->insert([
            //โครงสร้าง
            [
                //id-1
                'name' => 'ตัวบ่งชี้ที่ 1 คุณสมบัติของผู้บริหารสถาบันการศึกษาพยาบาล',
                'year' => 2025,
                'type' => 'คุณภาพ',
                'categorie_id' => 1,
                'code' => 'NCS-1',
                'description' => 'ผู้บริหารสถาบันการศึกษาพยาบาล หมายถึง คณบดี ผู้อำนวยการของสถาบันการศึกษาวิชาการพยาบาลและการผดุงครรภ์ หรือตำแหน่งอื่นที่เทียบเท่า ที่เป็นอาจารย์ประจำ 
                   ผู้บริหารสถาบันการศึกษาระดับรอง หมายถึง อาจารย์ประจำที่ดำรงตำแหน่งผู้บริหารระดับรอง เช่น รองคณบดี รองผู้อำนวยการ หัวหน้าภาควิชา หรือตำแหน่งอื่นที่เทียบเท่า ที่ทำหน้าที่ช่วยบริหารสถาบันการศึกษา ทั้งนี้ เป็นไปจามพระราชบัญญัติหรือข้อกำหนดของสถาบันอุดมศึกษานั้น',
                'condition' => ' ไม่มีข้อ 1 , 2 , 3 และ 4 (0 คะแนน) มีข้อ 1 , 2 , 3 และ 4 (5 คะแนน) มีครบทุกข้อ (10 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => 1,
                'comment' => 'ตัวบ่งชี้นี้จะประเมินคุณสมบัติของผู้บริหารสถาบันการศึกษาพยาบาลและการผดุงครรภ์ โดยพิจารณาจากการมีคุณสมบัติตามที่กำหนดไว้ในข้อ 1 ถึง 4', //ผู้ประเมินcomment
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
        
                   
            [
                // id-2
                'name' => 'ตัวบ่งชี้ที่ 2 อาจารย์ประจำที่มีคุณวุฒิปริญญาเอก',
                'categorie_id' => 2,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-2',
                'description' => 'อาจารย์ประจําคุณวุฒิปริญญาเอก หมายถึง อาจารย์พยาบาลประจําที่มีคุณวุฒิระดับปริญญาเอกทางการพยาบาล',
                'condition' => 'วิธีการคำนวณ ร้อยละของจำนวนอาจารย์ประจำที่มีวุฒิปริญญาเอก= จำนวนอาจารย์ประจำที่มีคุณวุฒิปริญญาเอก/จำนวนอาจารย์ประจำทั้งหมด*100',
                'annotation' => 'คะแนนที่ได้ไม่เกินคะแนนเต็ม 10 คะแนน',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินจำนวนอาจารย์ประจำที่มีคุณวุฒิปริญญาเอก โดยคำนวณจากร้อยละของจำนวนอาจารย์ประจำที่มีคุณวุฒิปริญญาเอกต่อจำนวนอาจารย์ประจำทั้งหมด',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-3
                'name' => 'ตัวบ่งชี้ที่ 3 คุณสมบัติอาจารย์ประจำ',
                'categorie_id' => 2,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-3',
                'description' => 'อาจารย์ประจํา หมายถึง บุคคลที่ดํารงตําแหน่ง อาจารย์ ผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ และศาสตราจารย์ ทั้งนี้ให้รวมถึงตําแหน่งที่เรียกชื่ออย่างอื่น ในสถาบันอุดมศึกษาที่เปิดสอนหลักสูตรพยาบาลศาสตรบัณฑิต ที่มีหน้าที่รับผิดชอบตามพันธกิจของการอุดมศึกษา และปฏิบัติหน้าที่เต็มเวลา มีคุณวุฒิระดับปริญญาโท สาขาพยาบาลศาสตร์หรือสาขาที่สัมพันธ์กันเป็นอย่างน้อย โดยต้องมีคุณวุฒิปริญญาตรีทางการพยาบาลและการผดุงครรภ์ มีใบอนุญาตเป็นผู้ประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ ชั้นหนึ่ง หรือใบอนุญาตเป็นผู้ประกอบวิชาชีพการพยาบาลชั้นหนึ่ง ที่ไม่หมดอายุ สําหรับอาจารย์ที่สอนด้านการพยาบาลมารดา-ทารกและการผดุงครรภ์จะต้องมีใบอนุญาตเป็นผู้ประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ ชั้นหนึ่ง และมีประสบการณ์กา
                   ปฏิบัติการพยาบาลมาแล้วไม่น้อยกว่า 2 ปี และมีประสบการณ์การสอนทางการพยาบาลในสถาบันการศึกษาพยาบาลมาแล้วไม่น้อยกว่า 1 ปี ทั้งนี้ถ้าสําเร็จการศึกษาสาขาอื่นที่ไม่ใช่สาขาพยาบาลศาสตร์และไม่มีตําแหน่งทางวิชาการสาขาการพยาบาล ต้องมีจํานวนรวมไม่เกินร้อยละ 15 ของจํานวนอาจารย์ประจําทั้งหมด
                   กรณีอาจารย์ประจําไม่มีประสบการณ์การสอนทางการพยาบาลในสถาบันการศึกษา ให้สถาบันการศึกษาจัดให้มีระบบอาจารย์พี่เลี้ยง ซึ่งเป็นอาจารย์ประจําหลักสูตรที่มีประสบการณ์การจัดการเรียนการสอนในสาขา วิชานั้นเป็นอาจารย์พี่เลี้ยง โดยให้มีระยะเวลาไม่น้อยกว่า 1 ภาคการศึกษา หรือให้มีการจัดอบรม หลักสูตรด้านการจัดการเรียนการสอนทางการพยาบาลอย่างเป็นระบบ
                   สําหรับอาจารย์ประจําที่สถาบันอุดมศึกษารับเข้าใหม่ ต้องมีคะแนนทดสอบความสามารถภาษาอังกฤษได้ตามเกณฑ์ที่กําหนดไว้ในประกาศคณะกรรมการการอุดมศึกษา เรื่อง มาตรฐานความสามารถภาษาอังกฤษของอาจารย์ประจํา หรือมีระบบพัฒนาคะแนนทดสอบความสามารถภาษาอังกฤษให้ได้ตามเกณฑ์ที่กําหนดฯ ภายในระยะเวลา 3 ปี
                    การนับระยะเวลาการปฏิบัติงานของอาจารย์ประจํา ต้องไม่น้อยกว่า 9 เดือนต่อปีการศึกษา คิดเป็น 1 คน ในกรณีปฏิบัติงาน 6 เดือนขึ้นไป แต่ไม่ถึง 9 เดือน คิดเป็น 0.5 คน
                     กรณีหลักสูตรร่วมผลิตกับหน่วยงานภายนอกที่ไม่ใช่สถาบันการศึกษา หากมีอาจารย์ประจําที่มาจากหน่วยงานภายนอกต้องสําเร็จการศึกษาระดับปริญญาโทตรงกับสาขาวิชาที่รับผิดชอบและมีประสบการณ์ในการปฏิบัติการให้การพยาบาลในสาขาวิชาที่รับผิดชอบอย่างต่อเนื่องไม่น้อยกว่า 6 ปี และต้องมีภาระงานในการจัดการเรียนการสอนไม่น้อยกว่า 12 ชั่วโมงต่อสัปดาห์ เป็นระยะเวลาต่อเนื่องอย่างน้อย 1 ภาคการศึกษา โดย 1 ภาคการศึกษา คิดเป็น 0.5 คน',
                'condition' => 'วิธีการคำนวณ ร้อยละของจำวนอาจารย์ประจำที่ได้ตามเก็ณฑ์ = จำนวนอาจารย์พยาบาลประจำที่มีคุณสมบัติตามเก็ณฑ์/จำนวนอาจารย์ประจำทั้งหมดของสถายบันรวมทุกคุณวุฒิการศึกษา*100',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินคุณสมบัติของอาจารย์ประจำ โดยพิจารณาจากคุณสมบัติตามที่กำหนดไว้ในข้อ 1 ถึง 4 และคำนวณร้อยละของจำนวนอาจารย์ประจำที่มีคุณสมบัติตามเกณฑ์ต่อจำนวนอาจารย์ประจำทั้งหมด',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-4
                'name' => 'ตัวบ่งชี้ที่ 4 จำนวนและคุณสมบัติของอาจารย์ผู้รับผิดชอบหลักสูตร',
                'categorie_id' => 3,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-4',
                'description' => 'อาจารย์ผู้รับผิดชอบหลักสูตร หมายถึง อาจารย์ประจําหลักสูตร จํานวนอย่างน้อย 5 คน ใน 5 สาขาหลักได้แก่ สาขาการพยาบาลผู้ใหญ่และหรือผู้สูงอายุ การพยาบาลเด็ก การพยาบาลจิตเวชและสุขภาพจิต การพยาบาลชุมชน และการพยาบาลมารดาและทารก หรือการผดุงครรภ์ เป็นอย่างน้อย ทั้งนี้ให้มีประสบการณ์การสอนทางการพยาบาลในสถาบันการศึกษาพยาบาลอย่างต่อเนื่องไม่น้อยกว่า 2 ปี
                 ในกรณีที่อาจารย์ผู้รับผิดชอบหลักสูตรสําเร็จปริญญาโทสาขาอื่นนอกจาก 5 สาขาหลัก ต้องมีประสบการณ์การสอนในสาขาที่รับผิดชอบในสถาบันการศึกษาพยาบาลและ การผดุงครรภ์อย่างต่อเนื่องไม่ น้อยกว่า 3 ปี
                 กรณีหลักสูตรร่วมผลิตกับหน่วยงานภายนอกที่ไม่ใช่สถาบันการศึกษาหากจําเป็นมีอาจารย์ผู้รับผิดชอบหลักสูตรที่มาจากหน่วยงานภายนอกนั้นได้ไม่เกิน 2 คน โดยต้องสําเร็จการศึกษาระดับปริญญาโทตรงกับสาขาวิชาที่รับผิดชอบและมีประสบการณ์ในการปฏิบัติการให้การพยาบาลในสาขาวิชาที่รับผิดชอบอย่างต่อเนื่องไม่น้อยกว่า 6 ปี และมีผลงานวิชาการเช่นเดียวกับอาจารย์ประจําหลักสูตร และต้องมีภาระงานในการจัดการเรียนการสอนไม่น้อยกว่า 12 ชั่วโมงต่อสัปดาห์ เป็นระยะเวลาต่อเนื่องตลอด 1 ปีการศึกษา',
                'condition' => 'ไม่เป็นไปตามเกณฑ์มาตรฐาน (0 คะแนน)เป็นไปตามเกณฑ์มาตรฐาน (5 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินจำนวนและคุณสมบัติของอาจารย์ผู้รับผิดชอบหลักสูตร โดยพิจารณาจากจำนวนอาจารย์ผู้รับผิดชอบหลักสูตรที่มีคุณสมบัติตามเกณฑ์ที่กำหนดไว้',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-5
                'name' => 'ตัวบ่งชี้ที่ 5 สัดส่วนอาจารย์ประจำหลักสูตรต่ออาจารย์ประจำทั้งหมด',
                'categorie_id' => 3,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-5',
                'description' => ' อาจารย์ประจําหลักสูตร หมายถึง อาจารย์พยาบาลประจําที่มีผลงานทางวิชาการที่ไม่ใช่ส่วนหนึ่งของการศึกษาเพื่อรับปริญญา และเป็นผลงานทางวิชาการที่ได้รับการเผยแพร่ตามหลักเกณฑ์ที่กําหนดในการพิจารณาแต่งตั้งให้บุคคลดํารงตําแหน่งทางวิชาการอย่างน้อย 1 รายการ ในรอบ 5 ปีย้อนหลัง (หากเป็นผลงานวิชาการที่เผยแพร่หลัง 24 มิถุนายน 2565 เป็นต้นไป ต้องเป็นชื่อแรกหรือผู้ประพันธ์บรรณกิจเท่านั้น)
                  การนับระยะเวลาการปฏิบัติงานของอาจารย์ประจําหลักสูตร ต้องไม่น้อยกว่า 9 เดือนต่อปีการศึกษา คิดเป็น 1 คน ในกรณีปฏิบัติงาน 6 เดือนขึ้นไป แต่ไม่ถึง 9 เดือน คิดเป็น 0.5 คน
                 กรณีหลักสูตรร่วมผลิตกับหน่วยงานภายนอกที่ไม่ใช่สถาบันการศึกษาหากจําเป็นมีอาจารย์ประจําหลักสูตรที่มาจากหน่วยงานภายนอกนั้นได้ต้องสําเร็จการศึกษาระดับปริญญาโทตรงกับสาขาวิชาที่รับผิดชอบและมีประสบการณ์ในการปฏิบัติการให้การพยาบาลในสาขาวิชาที่รับผิดชอบอย่างต่อเนื่องไม่น้อยกว่า 6 ปี และต้องมีภาระงานในการจัดการเรียนการสอนไม่น้อยกว่า 12 ชั่วโมงต่อสัปดาห์ เป็นระยะเวลาต่อเนื่องอย่างน้อย 1 ภาคการศึกษา คิดเป็น 0.5 คน โดยมีจํานวนไม่มากกว่าร้อยละ 20 ของอาจารย์ประจําหลักสูตรทั้งหมด',
                'condition' => 'ร้อยละของอาจารย์ประจำหลักสูตร = จำนวนอาจารย์ประจำหลักสูตร/จำนวนอาจารย์ประจำทั้งหมด*100 และคะแนนที่ได้ = ร้อยละของอาจารย์ประจำหลักสูตร/100*15',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินสัดส่วนของอาจารย์ประจำหลักสูตรต่ออาจารย์ประจำทั้งหมด โดยคำนวณจากร้อยละของจำนวนอาจารย์ประจำหลักสูตรต่อจำนวนอาจารย์ประจำทั้งหมด',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-6
                'name' => 'ตัวบ่งชี้ที่ 6 อัตราส่วนจำนวนอาจารย์ประจำต่อนิสิต/นักศึกษาเต็มเวลาเทียบเท่า',
                'categorie_id' => 3,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-6',
                'description' => 'นิสิต/นักศึกษาเต็มเวลาเทียบเท่า (Full Time Equivalent Student : FTES) หมายถึง นิสิต/นักศึกษา ที่ลงทะเบียนเรียนตามเกณฑ์จํานวนหน่วยกิตมาตรฐานของการลงทะเบียน ดังนี
              ระบบทวิภาค   -   สําหรับนิสิต/นักศึกษาปริญญาตรี : ลงทะเบียน 36 หน่วยกิตต่อปีการศึกษา 
                                           (18 หน่วยกิต ต่อภาคการศึกษา)
                                      -   สําหรับนิสิต/นักศึกษาระดับบัณฑิตศึกษาทั้งโครงการปกติและโครงการภาคพิเศษ ลงทะเบียน 24 หน่วยกิต ต่อปีการศึกษา 
                                           (12 หน่วยกิตต่อภาคการศึกษาปกติ)
               ระบบไตรภาค -   สําหรับนิสิต/นักศึกษาปริญญาตรี : ลงทะเบียน 45 หน่วยกิตต่อปีการศึกษา
                                           (15 หน่วยกิตต่อภาคการศึกษา)
                                      -   สําหรับนิสิต/นักศึกษาระดับบัณฑิตศึกษาทั้งโครงการปกติและโครงการภาคพิเศษ ลงทะเบียน 30 หน่วยกิต ต่อปีการศึกษา 
             (10 หน่วยกิตต่อภาคการศึกษาปกติ)',
                'condition' => '1. คำนวณค่า SCH (Student Credit Hours):
                𝑆𝐶𝐻=Σ(𝑛𝑖×𝑐𝑖)SCH=Σ(n i×c i)
                nᵢ = จำนวนนักศึกษาที่ลงทะเบียนในวิชา i
                cᵢ = จำนวนหน่วยกิตของวิชา i
                2. คำนวณค่า FTES (Full-Time Equivalent Student):
                𝐹𝑇𝐸𝑆 = 𝑆𝐶𝐻/หน่วยกิตตามเกณฑ์มาตรฐาน(เช่น15หรือ36แล้วแต่ระดับ)
                FTES=SCH/หน่วยกิตตามเกณฑ์มาตรฐาน(เช่น15หรือ36แล้วแต่ระดับ)
                เกณฑ์การให้คะแนน
                 ≥1:9 (0 คะแนน)
                     1:8 (5 คะแนน)
                1:7 (10 คะแนน)
                 1:6 (15 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินอัตราส่วนของจำนวนอาจารย์ประจำต่อนิสิต/นักศึกษาเต็มเวลาเทียบเท่า โดยคำนวณจากค่า SCH (Student Credit Hours) และ FTES (Full-Time Equivalent Student) ตามเกณฑ์ที่กำหนด',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-7
                'name' => 'ตัวบ่งชี้ที่ 7 อัตราส่วนจำนวนอาจารย์ประจำหรือพยาบาลวิชาชีพ ที่ทำหน้าหน้าที่สอนภาคปฏิบัติต่อนิสิต/นักศึกษา',
                'categorie_id' => 3,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-7',
                'description' => ' อัตราส่วนจํานวนอาจารย์ประจําหรือพยาบาลวิชาชีพ ที่ทําหน้าที่สอนภาคปฏิบัติต่อนิสิต/นักศึกษา หมายถึง อัตราส่วนอาจารย์ประจําหรือพยาบาลวิชาชีพต่อนิสิต/นักศึกษา ในแต่ละแหล่งฝึกภาคปฏิบัติในทุกรายวิชาทั้งในโรงพยาบาลและในชุมชน
                 อาจารย์ประจํา หมายถึง อาจารย์พยาบาลที่มีคุณสมบัติครบตามข้อบังคับสภาการพยาบาลว่าด้วยการรับรองสถาบันฯ ฉบับล่าสุด
                 พยาบาลวิชาชีพที่ทําหน้าที่ผู้สอนภาคปฏิบัติ หมายถึง พยาบาลวิชาชีพที่ได้รับมอบหมายให้สอนภาคปฏิบัติที่มีคุณสมบัติ ดังนี้
                 1) มีใบอนุญาตประกอบวิชาชีพการพยาบาลชั้นหนึ่ง ในกรณีที่สอนภาคปฏิบัติวิชาการพยาบาลมารดาทารกและการผดุงครรภ์ต้องมีใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ชั้นหนึ่ง
                 2) มีวุฒิการศึกษาและประสบการณ์ ดังนี้
                               2.1) ปริญญาโท/ปริญญาเอกทางการพยาบาลหรือวิทยาศาสตร์สุขภาพ และมีประสบการณ์การปฏิบัติการพยาบาลในสาขาที่สอน ไม่น้อยกว่า 1 ปี
                               2.2) ปริญญาโท/ปริญญาเอกสาขาอื่น และมีประสบการณ์การปฏิบัติการพยาบาลในสาขาที่สอนไม่น้อยกว่า 2 ปี
                               2.3) ปริญญาตรีหรือประกาศนียบัตรพยาบาลศาสตรบัณฑิตและมีประสบการณ์การปฏิบัติการพยาบาล ไม่น้อยกว่า 3 ปี
                 3) เป็นพยาบาลวิชาชีพที่อาจปฏิบัติงานหรือไม่ปฏิบัติงานประจําในขณะสอนภาคปฏิบัติ
                 4) ผ่านการอบรมหลักสูตรด้านการจัดการเรียนการสอนทางการพยาบาล หรือหลักสูตรการฝึกอบรม เพื่อพัฒนาศักยภาพด้านการสอนสําหรับพยาบาลพี่เลี้ยงที่สภาการพยาบาลให้การรับรอง',
                'condition' => 'ร้อยละของรายวิชาที่มีอาจารย์พยาบาลประจำต่อนักศึกษาไม่เกิน1:8 = จำนวนรายวิชาที่มีอาจารย์พยาบาลประจำ|พยาบาลวิชาชีพสอนภาคปฏิบัติไม่เกิน1:8/จำนวนรายวิชาภาคปฏิบัติที่เปิดสอนในปีการศึกษาทีครบวาระการรับรองสถาบัน
                 อัตราส่วนจํานวนอาจารย์ประจําหรือพยาบาลวิชาชีพ ที่ทําหน้าที่สอนภาคปฏิบัติต่อนิสิต/นักศึกษาในรายวิชาภาคปฏิบัติทางการพยาบาลเป็นไปตามเกณฑ์การพิจารณา ข้อ 1 และ 2
                น้อยกว่าร้อยละ 80 ของรายวิชาทั้งหมด (0 คะแนน)
                ร้อยละ 80 – 89 ของรายวิชาทั้งหมด (5 คะแนน)
                ร้อยละ 90 – 99 ของรายวิชาทั้งหมด (10 คะแนน)
                ร้อยละ 100 ของรายวิชาทั้งหมด (15 คะแนน',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินอัตราส่วนของจำนวนอาจารย์ประจำหรือพยาบาลวิชาชีพที่ทำหน้าที่สอนภาคปฏิบัติต่อนิสิต/นักศึกษา โดยคำนวณจากร้อยละของรายวิชาที่มีอาจารย์พยาบาลประจำต่อนักศึกษาไม่เกิน 1:8 ต่อจำนวนรายวิชาภาคปฏิบัติที่เปิดสอนในปีการศึกษาที่ครบวาระการรับรองสถาบัน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            // id-8
            [
                'name' => 'ตัวบ่งชี้ที่ 8 สภาพแวดล้อมของสถาบันการศึกษา',
                'categorie_id' => 3,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-8',
                'description' => 'สภาพแวดล้อมสถานศึกษา หมายถึง อาคารสถานที่ ทําเลที่ตั้งและระบบสาธารณูปโภค อุปกรณ์และระบบการรักษาความปลอดภัย ระบบป้องกันอัคคีภัย โครงสร้างพื้นฐานทางเทคโนโลยีสารสนเทศ รวมถึงอุปกรณ์และสิ่งอํานวยความสะดวก',
                'condition' => 'มีน้อยกว่า 3 ข้อ (0 คะแนน)
                    มี 3 - 4 ข้อ (6 คะแนน)
                    มี 5 ข้อ (9 คะแนน)
                    มี 6 ข้อ (12 คะแนน)
                    มีครบทุกข้อ (15 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินสภาพแวดล้อมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น อาคารสถานที่ ทําเลที่ตั้ง ระบบสาธารณูปโภค อุปกรณ์และระบบการรักษาความปลอดภัย ระบบป้องกันอัคคีภัย และโครงสร้างพื้นฐานทางเทคโนโลยีสารสนเทศ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-9
                'name' => 'ตัวบ่งชี้ที่ 9 ทรัพยากรด้านเทคโนโลยีสารสนเทศ',
                'categorie_id' => 3,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-9',
                'description' => 'ระบบสารสนเทศเพื่อการบริหารและการตัดสินใจ หมายถึง ระบบสารสนเทศอิเล็กทรอนิกส์ที่เป็นปัจจุบัน ที่ผู้บริหารนำไปใช้ในการบริหารงานและการประกันคุณภาพการศึกษาประกอบด้วยข้อมูลนำเข้า การประมวลผล และผลลัพธ์
                1. มีระบบสารสนเทศเพื่อการตัดสินใจด้านการบริหาร หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารสามารถนำมาพิจารณาในการตัดสินใจได้ ประกอบด้วย
                ระบบสารสนเทศด้านการเงิน การงบประมาณ ที่แสดงถึงการนำข้อมูลมาวิเคราะห์ด้วยค่าสถิติเชิงพรรณา เช่น ร้อยละ ค่าเฉลี่ยของงบประมาณที่ได้รับและรายจ่ายในแต่ละปีงบประมาณ
                ระบบสารสนเทศบริหารงานบุคคล ที่แสดงถึงร้อยละของบุคลากรที่หน่วยงานมีอยู่ จำแนกตามวุฒิการศึกษา อายุ เพศ ระดับตำแหน่ง ตำแหน่งทางวิชาการ การลาศึกษาต่อ การลาฝึกอบรม ภาระงานของอาจารย์และบุคลากร
                ระบบสารสนเทศด้านครุภัณฑ์ ที่แสดงถึงจำนวนครุภัณฑ์ที่จำเป็นในการจัดการเรียนการสอนที่หน่วยงานมีอยู่ เช่น การเปรียบเทียบการเพิ่มขึ้น ลดลงในแต่ละปี รายละเอียดที่สามารถทราบถึงวันเวลา การซื้อ การซ่อม การจำหน่าย การยืม การคืน เพื่อการตัดสินใจในการจัดหาครุภัณฑ์
          	    2. มีระบบสารสนเทศเพื่อการตัดสินใจด้านการเรียนการสอน หมายถึง การจัดการข้อมูลเพื่อให้เป้นสารสนเทศในการตัดสินใจด้านการเรียนการสอนของหน่วยงาน เช่น การแสดงตารางสอน ในแต่ละชั้นปี การเปรียบเทียบจำนวนนิสิต/นักศึกษาแรกเข้าในแต่ละปี การเปรียบเทียบจำนวนผู้สำเร็จการศึกษาและนิสิต/นักศึกษาแรกเข้าในแต่ละรุ่น แต่ละปี หลักสูตรที่เปิดสอน จำนวนรายวิชาที่สอนในแต่ละปีการศึกษา ภาระงานของอาจารย์ผู้สอนในแต่ละภาคการศึกษา เป็นต้น
      		    3. มีระบบสารสนเทศเพื่อการตัดสินใจด้านการวิจัย หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารสามารถนำมาพิจารณาในการตัดสินใจด้านการวิจัยของหน่วยงาน เช่น จำนวน/ร้อยละของงานวิจัยเปรียบเทียบงงานบริการวิชาการของอาจารย์ในแต่ละปี  จำนวนทุนที่ได้รับการสนับสนุนจากภายใน/ภายนอกหน่วยงาน เรื่องที่ทำการวิจัยในแต่ละสาขาวิชา จำนวน/ร้อยละของงานวิจัยที่ตีพิมพ์ในแต่ละปี บทคัดย่อที่ผู้สนใจสามารถเข้าถึงได้
      		    4. มีระบบสารสนเทศเพื่อการตัดสินใจด้านการบริการวิชาการ หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารสามารถนำมาพิจารณาในการตัดสินใจด้านการบริการวิชาการของหน่วยงาน เช่น จำนวน/ร้อยละ การเปรียบเทียบงานบริการวิชาการของอาจารย์ในแต่ละปี จำนวนงบประมาณที่ได้รับการสนับสนุนจากภายใน/ภายนอกหน่วยงาน จำนวนอาจารย์ที่ให้บริการวิชาการแก่สังคม หลักสูตร/โครงการ/กิจกรรมที่ให้บริการในแต่ละปี
                 5. มีระบบสารสนเทศเพื่อการตัดสินใจ ด้านการทำนุบำรุงศิลปะและวัฒนธรรม หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารสามารถนำมาพิจารณาในการตัดสินใจด้านการทำนุบำรุงศิลปะและวัฒนธรรมของหน่วยงาน เช่น จำนวนโครงการ/กิจกรรมด้านศิลปวัฒนธรรมของอาจารย์และนิสิต/นักศึกษาในแต่ละปี จำนวนงบประมาณที่ได้รับการสนับสนุนจากภายใน/ภายนอกหน่วยงาน จำนวนอาจารย์ที่เข้าร่วมในโครงการทำนุบำรุงศิลปะและวัฒนธรรม',
                'condition' => 'มี 1 ระบบ (2 คะแนน)
                    มี 2 ระบบ (4 คะแนน)
                    มี 3 ระบบ (6 คะแนน)
                    มี 4 ระบบ (8 คะแนน)
                    มีครบทุกระบบ (10 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินทรัพยากรด้านเทคโนโลยีสารสนเทศของสถาบันการศึกษา โดยพิจารณาจากจำนวนระบบสารสนเทศที่มีอยู่ในแต่ละด้าน เช่น ระบบสารสนเทศเพื่อการบริหารและการตัดสินใจ ระบบสารสนเทศเพื่อการเรียนการสอน ระบบสารสนเทศเพื่อการวิจัย ระบบสารสนเทศเพื่อการบริการวิชาการ และระบบสารสนเทศเพื่อการทำนุบำรุงศิลปะและวัฒนธรรม',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-10
                'name' => 'ตัวบ่งชี้ที่ 10 ศูนย์การเรียนรู้การปฏิบัติการพยาบาลและห้องปฏิบัติการเสมือนจริง',
                'categorie_id' => 3,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-10',
                'description' => 'ศูนย์การเรียนรู้การปฏิบัติการพยาบาล ประกอบด้วย
                1. ห้องฝึกปฏิบัติการพยาบาลให้นักศึกษาฝึกปฏิบัติหัตถการทางการพยาบาล มีหุ่นจำลองผู้ป่วย อุปกรณ์ในการฝึกปฏิบัติ ทันสมัย พร้อมใช้และเพียงพอ
                2. ห้องปฏิบัติการพยาบาลเสมือนจริงให้นักศึกษาฝึกฝนทักษะการปฏิบัติการพยาบาล การแก้ไขปัญหาและการตัดสินใจทางคลินิก โดยใช้สถานการณ์เสมือนจริงทางการพยาบาล (Scenario) หุ่นจำลองผู้ป่วยเสมือนจริง (Patient Simulator) และผู้ป่วยเสมือนจริง (Standardized Patient) ที่สอดคล้องกับสถานการณ์ในแต่ละรายวิชา ที่ครอบคลุม 5 สาขาวิชาหลัก เพื่อให้ผู้เรียนเกิดผลลัพธ์การเรียนรู้ตามที่หลักสูตรกำหนด
                 3. อุปกรณ์/เครื่องมือทางการแพทย์ หมายถึง อุปกรณ์ทางการวินิจฉัยและการรักษาพยาบาลที่จำเป็นต่อชีวิตและความปลอดภัยของผู้ป่วย เพื่อใช้ในการเตรียมความพร้อมให้แก่นักศึกษาก่อนการฝึกปฏิบัติกับผู้ป่วย ได้แก่ เครื่องช่วยหายใจ เครื่องควบคุมการให้สารน้ำทางหลอดเลือดดำ เครื่องตรวจคลื่นไฟฟ้าหัวใจ ทั้งนี้เป็นอุปกรณ์ในศูนย์การเรียนรู้การปฏิบัติการพยาบาลหรือสถานบริการสุขภาพ',
                'condition' => 'ไม่มีหลักฐาน (0)
                มีข้อ 1 (5)
                มีข้อ 1 และ 2 (10)
                มีข้อ 1 , 2 และ 3 (20)
                มีข้อ 1 , 2 , 3 และ 4 (30)
                มีครบทุกข้อ (50)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินศูนย์การเรียนรู้การปฏิบัติการพยาบาลและห้องปฏิบัติการเสมือนจริง โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น ห้องฝึกปฏิบัติการพยาบาล ห้องปฏิบัติการพยาบาลเสมือนจริง และอุปกรณ์/เครื่องมือทางการแพทย์',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 50.00,
            ],
            [
                // id-11
                'name' => 'ตัวบ่งชี้ที่ 11 หนังสือ ตำรา วารสาร ฐานข้อมูล',
                'categorie_id' => 3,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-11',
                'description' => '  หนังสือ/ ตำราหลัก หมายถึง หนังสือ/ตำรา ทางการพยาบาลทั้งภาษาไทยและภาษาต่างประเทศที่ครอบคลุมเนื้อหาสาระหลักในแต่ละสาขาวิชา 
                หนังสือ ตำรา วารสาร หมายถึง หนังสือ ตำรา วารสาร ที่มีองค์ความรู้หรือแนวคิดทางการพยาบาลรวมทั้งพื้นฐานวิชาชีพ และวิทยาศาสตร์สุขภาพ ที่ตีพิมพ์เผยแพร่ไม่เกิน 10 ปี โดยสถาบันอาจจัดหาในรูปแบบเล่มเอกสาร หรือ หนังสืออิเล็กทรอนิกส์ (e-book) 
                 ฐานข้อมูลอีเล็กทรอนิกส์ ประกอบด้วยฐานข้อมูลวารสารทางการพยาบาลต่างประเทศ เป็นฐานข้อมูลที่รวบรวมวารสารที่มีคุณภาพมาตรฐานทางวิชาการ ซึ่งผู้ใช้สามารถสืบค้นวารสารทางการพยาบาลฉบับเต็มได้ เช่น CINAHL Complete , Medline , Science Direct 
                 ฐานข้อมูลหนังสือ/ตำราทางการพยาบาล (eBook Nursing Collection) เป็นฐานข้อมูลที่รวบรวมหนังสืออิเล็กทรอนิกส์ทางการพยาบาลทั้งภาษาไทยและภาษาอังกฤษ',
                'condition' => 'ไม่มีข้อ 1 (0)
                    มีข้อ 1 (5)
                    มีข้อ 1 และ 2 (10)
                    มีข้อ 1 , 2 และ 3 (15)
                    มีข้อ 1 , 2 , 3 และ 4 (20)
                    มีครบทุกข้อ (25)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินหนังสือ ตำรา วารสาร และฐานข้อมูลของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น หนังสือ/ตำราหลัก หนังสือ ตำรา วารสาร และฐานข้อมูลอีเล็กทรอนิกส์',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 25.00,
            ],
            [
                // id-12
                'name' => 'ตัวบ่งชี้ที่ 12 โครงสร้างการบริหารจัดการงานวิจัยและนวัตกรรม',
                'categorie_id' => 4,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-12',
                'description' => '',
                'condition' => 'ไม่มีหลักฐาน (0)
                    มีข้อ 1 (1)
                    มีข้อ 1 และ 2 (2)
                    มีข้อ 1 , 2 และ 3 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินโครงสร้างการบริหารจัดการงานวิจัยและนวัตกรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น โครงสร้างการบริหารจัดการงานวิจัยและนวัตกรรม การสนับสนุนงานวิจัยและนวัตกรรม และการเผยแพร่ผลงานวิจัยและนวัตกรรม',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-13
                'name' => 'ตัวบ่งชี้ที่ 13 โครงสร้างการบริหารจัดการงานบริการวิชาการ/วิชาชีพ/สังคม',
                'categorie_id' => 5,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-13',
                'description' => '',
                'condition' => 'ไม่มีหลักฐาน (0)
                    มีข้อ 1 (1)
                    มีข้อ 1 และ 2 (2)
                    มีข้อ 1 , 2 และ 3 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินโครงสร้างการบริหารจัดการงานบริการวิชาการ/วิชาชีพ/สังคมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น โครงสร้างการบริหารจัดการงานบริการวิชาการ การสนับสนุนงานบริการวิชาการ และการเผยแพร่ผลงานบริการวิชาการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-14
                'name' => 'ตัวบ่งชี้ที่ 14 โครงสร้างการบริหารจัดการงานทำนุบำรุงศิลปวัฒนธรรม',
                'categorie_id' => 6,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-14',
                'description' => '',
                'condition' => 'ไม่มีหลักฐาน (0)
                    มีข้อ 1 (1)
                    มีข้อ 1 และ 2 (2)
                    มีข้อ 1 , 2 และ 3 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินโครงสร้างการบริหารจัดการงานบริการวิชาการ/วิชาชีพ/สังคมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น โครงสร้างการบริหารจัดการงานบริการวิชาการ การสนับสนุนงานบริการวิชาการ และการเผยแพร่ผลงานบริการวิชาการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-15
                'name' => 'ตัวบ่งชี้ที่ 15  โครงสร้างการบริหารจัดการงานพัฒนานิสิต/นักศึกษา/ศิษย์เก่า',
                'categorie_id' => 7,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCS-15',
                'description' => '',
                'condition' => 'ไม่มีหลักฐาน (0)
                    มีข้อ 1 (1)
                    มีข้อ 1 และ 2 (2)
                    มีข้อ 1 , 2 และ 3 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินโครงสร้างการบริหารจัดการงานพัฒนานิสิต/นักศึกษา/ศิษย์เก่าของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น โครงสร้างการบริหารจัดการงานพัฒนานิสิต/นักศึกษา การสนับสนุนงานพัฒนานิสิต/นักศึกษา และการเผยแพร่ผลงานพัฒนานิสิต/นักศึกษา',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            //กระบวนการ
            [
                // id-16
                'name' => 'ตัวบ่งชี้ที่ 1 การนำองค์กร',
                'categorie_id' => 8,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-1',
                'description' => 'การถ่ายทอด/สื่อสารวิสัยทัศน์หมายถึง กระบวนการนำข้อมูลเกี่ยวกับวิสัยทัศน์ พันธกิจ ให้บุคลากร นิสิต/นักศึกษารับรู้อย่างทั่วถึง เช่น การใช้ช่องทางออนไลน์ การประชุมชี้แจง การติดประกาศ เป็นต้น เมื่อครบ วงรอบการดำเนินงาน มีการประเมินความพึงพอใจของกระบวนการถ่ายทอด/ สื่อสารวิสัยทัศน์ พันธกิจ และ ประเมินผลการรับรู้วิสัยทัศน์ พันธกิจ ของบุคลากรและนิสิต/นักศึกษา',
                'condition' => 'ไม่มีหลักฐานการดำเนินการทั้ง 4 ข้อ (0)  
                    มีการดำเนินงานข้อ 1 (2)  
                    มีการดำเนินงานข้อ 1 และ 2 (5)  
                    มีการดำเนินงานข้อ 1 ถึง 3 (10)  
                    มีครบทุกข้อ (15) ',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการนำองค์กรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การถ่ายทอด/สื่อสารวิสัยทัศน์ พันธกิจ การกำหนดเป้าหมาย และการประเมินผลการรับรู้ของบุคลากรและนิสิต/นักศึกษา',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-17
                'name' => 'ตัวบ่งชี้ที่ 2 ยุทธศาสตร์ ',
                'categorie_id' => 8,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-2',
                'description' => 'แผนกลยุทธ์/ยุทธศาสตร์ หมายถึง แผนที่กำหนดทิศทางการพัฒนาคณะ/สถาบันระยะยาวตั้งแต่ 3 ปีขึ้นไป ประกอบด้วย วิสัยทัศน์ พันธกิจ วัตถุประสงค์ โครงการ ครอบคลุมทุกพันธกิจของสถาบัน มีการกำหนดตัวบ่งชี้ ความสำเร็จของแต่ละกลยุทธ์ และค่าเป้าหมายของตัวบ่งชี้ เพื่อวัดความสำเร็จของการดำเนินการตามกลยุทธ์
                      แผนปฏิบัติงานประจำปี หมายถึง แผนระยะสั้นที่มีระยะเวลาดำเนินการภายใน 1 ปี เป็นแผนที่ถ่ายทอด แผนกลยุทธ์/ยุทธศาสตร์ ลงสู่การปฏิบัติ เพื่อให้เกิดการดำเนินงานจริง ประกอบด้วย โครงการหรือกิจกรรมต่าง ๆ ที่ จะต้องดำเนินการในปีนั้น ๆ เพื่อให้บรรลุเป้าหมายตัวบ่งชี้ความสำเร็จของแผนกลยุทธ์/ ยุทธศาสตร์ และกำหนดค่า เป้าหมายของโครงการที่สอดคล้องกับตัวบ่งชี้ รวมทั้งระบุผู้รับผิดชอบโครงการ/กิจกรรม งบประมาณ ทรัพยากรที่ ต้องใช้ในการดำเนินการ และเมื่อดำเนินงานแล้ว มีผลการดำเนินงานตามแผนปฏิบัติปฏิบัติการ 
                       แผนการจัดสรรงบประมาณ หมายถึง แผนการจัดสรรงบประมาณทุกประเภทเป็นรายปีที่สอดคล้องกับ วิสัยทัศน์ และกลยุทธ์/ ยุทธศาสตร์ มีการวิเคราะห์ การประเมินการใช้งบประมาณตามพันธกิจ เมื่อดำเนินการแล้วมี การประเมินแผนการจัดการสรรงบประมาณ 
                       การถ่ายทอดกลยุทธ์/ ยุทธศาสตร์ หมายถึง กระบวนการนำข้อมูลเกี่ยวกับ กลยุทธ์/ ยุทธศาสตร์ ให้ บุคลากรรับรู้ เช่น การใช้ช่องทางออนไลน์ การประชุมชี้แจงแลกเปลี่ยน การติดประกาศ เป็นต้น เมื่อครบวงรอบการ ดำเนินงานมีการประเมินความพึงพอใจของช่องทางที่ใช้ในการถ่ายทอด/สื่อสาร กลยุทธ์/ยุทธศาสตร์ และการ ประเมินผลการรับรู้ของบุคลากรต่อกลยุทธ์/ยุทธศาสตร์ ที่ได้รับการถ่ายทอด ',
                'condition' => 'ไม่มีหลักฐานการดำเนินการทั้ง 4 ข้อ (0)  
                    มีการดำเนินงานข้อ 1 (2)  
                    มีการดำเนินงานข้อ 1 และ 2 (5)  
                    มีการดำเนินงานข้อ 1 ถึง 3 (10)  
                    มีครบทุกข้อ (15)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินยุทธศาสตร์ของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น แผนกลยุทธ์/ยุทธศาสตร์ แผนปฏิบัติงานประจำปี แผนการจัดสรรงบประมาณ และการถ่ายทอดกลยุทธ์/ยุทธศาสตร์',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-18
                'name' => 'ตัวบ่งชี้ที่ 3 การประพฤติตามกฎหมายและจริยธรรม ',
                'categorie_id' => 8,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-3',
                'description' => 'การประพฤติตามกฎหมายและจริยธรรม หมายถึง กระบวนการที่สถาบันดำเนินการตามมาตรฐาน ข้อกำหนด กฏหมาย ระเบียบ ข้อบังคับ และหลักธรรมาภิบาลของการบริหารกิจการบ้านเมืองที่ดีหรือการ ดำเนินการตามหลักคุณธรรมและความโปร่งใสของการดำเนินงาน และการจัดการข้อร้องเรียน อุทธรณ์ ร้องทุกข์ 
                 หลักธรรมาภิบาล หมายถึง การปกครอง การบริหาร การจัดการ การควบคุม ดูแลกิจการต่าง ๆ ให้ เป็นไปในครรลองธรรม โดยยึดตามหลักธรรมาภิบาลของการบริหารกิจการบ้านเมืองที่ดี (Good Governance) 10 ประการ ที่เหมาะสมจะนำมาปรับใช้ในหน่วยงานมี 10 ประการ ดังนี้
                  1. หลักประสิทธิผล (Effectiveness) คือ ผลการปฏิบัติราชการที่บรรลุวัตถุประสงค์และเป้าหมายของ แผนการปฏิบัติราชการตามที่ได้รับงบประมาณมาดำเนินการ รวมถึงสามารถ เทียบเคียงกับส่วนราชการหรือ หน่วยงานที่มีภารกิจคล้ายคลึงกันและมีผลการปฏิบัติงานใน ระดับชั้นนำของประเทศเพื่อให้เกิดประโยชน์สุขต่อ ประชาชนโดยการปฏิบัติราชการ จะต้องมีทิศทางยุทธศาสตร์และเป้าประสงค์ที่ชัดเจนมีกระบวนการปฏิบัติงานและ ระบบงานที่เป็นมาตรฐานรวมถึงมีการติดตามประเมินผลและพัฒนาปรับปรุงอย่างต่อเนื่อง และเป็นระบบ 
                   2. หลักประสิทธิภาพ (Efficiency) คือ การบริหารราชการตามแนวทางการกำกับดูแลที่ดีที่ มีการออกแบบกระบวนการปฏิบัติงานโดยใช้เทคนิคและเครื่องมือการบริหารจัดการที่ เหมาะสมให้องค์การสามารถ ใช้ทรัพยากรทั้งด้านต้นทุน แรงงานและระยะเวลาให้เกิดประโยชน์สูงสุดต่อการพัฒนาขีดความสามารถในการปฏิบัติ ราชการตามภารกิจเพื่อตอบสนองความต้องการของประชาชนและผู้มีส่วนได้ส่วนเสียทุกกลุ่ม 
                   3. หลักการตอบสนอง (Responsiveness) คือ การให้บริการที่สามารถดำเนินการได้ภายในระยะเวลา ที่กำหนด และสร้างความเชื่อมั่น ความไว้วางใจ รวมถึงตอบสนองความคาดหวัง หรือความต้องการของประชาชน ผู้รับบริการ และผู้มีส่วนได้ส่วนเสียที่มีความหลากหลาย และมีความแตกต่าง 
                   4. หลักภาระรับผิดชอบ (Accountability) คือ การแสดงความรับผิดชอบในการปฏิบัติหน้าที่และผลงาน ต่อเป้าหมายที่กำหนดไว้ โดยความรับผิดชอบนั้นควรอยู่ในระดับที่สนองต่อความคาดหวังของสาธารณะ รวมทั้งการ แสดงถึงความสำนึกในการรับผิดชอบต่อปัญหาสาธารณะ 
                   5. หลักความโปร่งใส (Transparency) คือ กระบวนการเปิดเผยอย่างตรงไปตรงมาชี้แจงได้เมื่อมี ข้อสงสัยและสามารถเข้าถึงข้อมูลข่าวสารอันไม่ต้องห้ามตามกฎหมายได้อย่างเสรีโดยประชาชนสามารถรู้ทุกขั้นตอน ในการดำเนินกิจกรรมหรือกระบวนการต่างๆ และ สามารถตรวจสอบได้ 
                   6. หลักการมีส่วนร่วม (Participation) คือ กระบวนการที่ข้าราชการ ประชาชน และผู้มีส่วนได้เสีย ทุกกลุ่มมีโอกาสได้เข้าร่วมในการรับรู้เรียนรู้ ทำความเข้าใจ ร่วมแสดงทัศนะ ร่วมเสนอปัญหาหรือ ประเด็นที่สำคัญ ที่เกี่ยวข้อง ร่วมคิดแนวทาง ร่วมการแก้ไขปัญหา ร่วมในกระบวนการตัดสินใจ และร่วมกระบวนการพัฒนาในฐานะ หุ้นส่วนการพัฒนา 
                   7. หลักการกระจายอำนาจ (Decentralization) คือ การถ่ายโอนอำนาจการตัดสินใจ ทรัพยากร และ ภารกิจจากส่วนราชการส่วนกลางให้แก่หน่วยการปกครองอื่นๆ (ราชการ บริหารส่วนท้องถิ่น) และภาคประชาชน ดำเนินการแทนโดยมีอิสระตามสมควรรวมถึงการ มอบอำนาจและความรับผิดชอบในการตัดสินใจและการดำเนินการให้แก่บุคลากร โดย มุ่งเน้นการสร้างความพึงพอใจในการให้บริการต่อผู้รับบริการและผู้มีส่วนได้เสียการ ปรับปรุงกระบวนการ และเพิ่มผลิตภาพเพื่อผลการดำเนินงานที่ดีของส่วนราชการ 
                  8. หลักนิติธรรม (Rule of Law) คือ การใช้อำนาจของกฎหมาย กฎระเบียบข้อบังคับในการบริหาร ราชการด้วยความเป็นธรรม ไม่เลือกปฏิบัติและคำนึงถึงสิทธิเสรีภาพของผู้มีส่วนได้เสีย 
                  9. หลักความเสมอภาค (Equity) คือ การได้รับการปฏิบัติและได้รับบริการอย่างเท่าเทียมกัน โดยไม่มี การแบ่งแยกด้านชายหรือหญิง ถิ่นกำเนิด เชื้อชาติ ภาษา เพศ อายุ ความพิการ สภาพทางกายหรือสุขภาพ สถานะ ของบุคคล ฐานะทางเศรษฐกิจและสังคม ความเชื่อทางศาสนา การศึกษา การฝึกอบรม และอื่นๆ 
                   10. หลักมุ่งเน้นฉันทามติ (Consensus Oriented) คือ การหาข้อตกลงทั่วไปภายในกลุ่มผู้มีส่วนได้เสีย ที่เกี่ยวข้อง ซึ่งเป็นข้อตกลงที่เกิดจากการใช้กระบวนการเพื่อหาข้อคิดเห็น จากกลุ่มบุคคลที่ได้รับประโยชน์และเสีย ประโยชน์ โดยเฉพาะกลุ่มที่ได้รับผลกระทบโดยตรงซึ่งต้องไม่มีข้อคัดค้านที่ยุติไม่ได้ในประเด็นที่สำคัญ โดยฉันทามติ ไม่จำเป็นต้องหมายความว่าเป็นความเห็นพ้องโดยเอกฉันท์ 
                   การประเมินคุณธรรมและความโปร่งใสในการดำเนินงานของหน่วยงานภาครัฐ (Integrity and Transparency Assessment : ITA) เป็นเครื่องมือการประเมินเชิงบวกเพื่อเป็นมาตรการป้องกันการทุจริต และ เป็นกลไกในการสร้างความตระหนักให้หน่วยงานภาครัฐมีการดำเนินงานอย่างโปร่งใสและมีคุณธรรม ซึ่ง ประกอบด้วย 10 ตัวชี้วัด ดังนี้
                   ตัวชี้วัดที่ 1 การปฏิบัติหน้าที่ 
                   ตัวชี้วัดที่ 2 การใช้งบประมาณ 
                   ตัวชี้วัดที่ 3 การใช้อำนาจ 
                   ตัวชี้วัดที่ 4 การใช้ทรัพย์สินของทางราชการ 
                   ตัวชี้วัดที่ 5 การแก้ไขปัญหาการทุจริต 
                   ตัวชี้วัดที่ 6 คุณภาพการดำเนินงาน 
                   ตัวชี้วัดที่ 7 ประสิทธิภาพการสื่อสาร 
                   ตัวชี้วัดที่ 8 การปรับปรุงระบบการทำงาน 
                   ตัวชี้วัดที่ 9 การเปิดเผยข้อมูล 
                   ตัวชี้วัดที่ 10 การป้องกันการทุจริต ',
                'condition' => 'ไม่มีหลักฐานการดำเนินการทั้ง 4 ข้อ (0)  
                    มีการดำเนินงานข้อ 1 (3)  
                    มีการดำเนินงานข้อ 1 และ 2 (5)  
                    มีการดำเนินงานข้อ 1 ถึง 3 (7)  
                    มีครบทุกข้อ (10) ',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการใช้ข้อมูลเพื่อการตัดสินใจของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น ระบบสารสนเทศเพื่อการบริหารและการตัดสินใจ การจัดการข้อมูลด้านการเรียนการสอน การวิจัย การบริการวิชาการ และการทำนุบำรุงศิลปะและวัฒนธรรม',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-19
                'name' => 'ตัวบ่งชี้ที่ 4 การใช้ข้อมูลเพื่อการตัดสินใจ  ',
                'categorie_id' => 8,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-4',
                'description' => ' ระบบสารสนเทศเพื่อการบริหารและการตัดสินใจ หมายถึง ระบบการจัดเก็บ ประมวลผล วิเคราะห์ข้อมูล และนำ สารสนเทศไปใช้เพื่อการตัดสินใจ ครอบคลุมทุกพันธกิจที่สถาบันกำหนด โดยแสดงผลข้อมูลที่เป็นปัจจุบัน ถูกต้อง พร้อมใช้ และเข้าถึงได้ ทำให้ผู้บริหารนำไปใช้ในการบริหารงานและตัดสินใจ ครอบคลุมทุกพันธกิจที่สถาบันกำหนด ดังนี้ 
                     1) ด้านการบริหาร หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารสามารถนำมาพิจารณาในการ ตัดสินใจได้ ประกอบด้วย 
                                1.1) ด้านการเงิน การงบประมาณ แสดงถึงการนำข้อมูลมาวิเคราะห์ด้วยค่าสถิติเชิงพรรณนา เช่น ร้อยละ ค่าเฉลี่ย ของเงินงบประมาณที่ได้รับและรายจ่ายในแต่ละปีงบประมาณแต่ละไตรมาส เพื่อพิจารณาบริหาร จัดการให้ทันเวลา การเสนอรายงานสารสนเทศอาจเป็นการบรรยาย ตาราง แผนภูมิ แผนภาพที่สื่อต่อความเข้าใจได้ ง่าย เป็นต้น 
                                1.2) ด้านการบริหารงานบุคคล แสดงถึงจำนวนร้อยละของบุคลากรที่หน่วยงานมีอยู่ จำแนกตามวุฒิ การศึกษา อายุ เพศ ระดับตำแหน่ง ตำแหน่งทางวิชาการ การลาศึกษาต่อ การลาฝึกอบรม ภาระงานของอาจารย์ และบุคลากร ประวัติของบุคลากรที่จำเป็นต่อการบริหารงานและการตัดสินใจของผู้บริหาร เป็นต้น 
                                1.3) ด้านครุภัณฑ์แสดงถึงจำนวนครุภัณฑ์ที่จำเป็นในการจัดการเรียนการสอน ที่หน่วยงานมีอยู่ เช่น การเปรียบเทียบการเพิ่มขึ้น - ลดลงในแต่ละปี รายละเอียดที่สามารถทราบถึงวันเวลา การซื้อ การซ่อม การจำหน่าย การยืม การคืน เพื่อการตัดสินใจในการจัดหาครุภัณฑ์ที่จำเป็น เป็นต้น 
                     2) ด้านการเรียนการสอน หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศผู้บริหารนำมาใช้ในการตัดสินใจ ด้านการเรียนการสอนของหน่วยงาน เช่น การแสดงตารางสอน ในแต่ละชั้นปีการเปรียบเทียบจำนวนนิสิต/นักศึกษาแรกเข้าในแต่ละปี การเปรียบเทียบจำนวนผู้สำเร็จการศึกษาและนิสิต/นักศึกษาแรกเข้าในแต่ละรุ่น แต่ละปี หลักสูตรที่เปิดสอน จำนวนรายวิชาที่สอนในแต่ละปีการศึกษา ภาระงานของอาจารย์ผู้สอนในแต่ละภาคการศึกษา เป็นต้น 
                     3) ด้านการวิจัย หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศผู้บริหารนำมาใช้ในการตัดสินใจด้านการ วิจัยของหน่วยงาน เช่น จำนวน/ร้อยละของงานวิจัย เปรียบเทียบจำนวนงานวิจัยของอาจารย์ในแต่ละปี จำนวนทุน ที่ได้รับการสนับสนุนจากภายใน/ภายนอกหน่วยงานเรื่องที่ทำการวิจัยในแต่ละสาขาวิชา จำนวน/ร้อยละของ งานวิจัยที่ตีพิมพ์ในแต่ละปี บทคัดย่อที่ผู้สนใจสามารถเข้าถึงได้ เป็นต้น 
                      4) ด้านการบริการวิชาการ หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารนำมาใช้ในการ ตัดสินใจด้านการบริการวิชาการของหน่วยงาน เช่น จำนวน/ร้อยละ การเปรียบเทียบงานบริการวิชาการของอาจารย์ ในแต่ละปี จำนวนงบประมาณที่ได้รับการสนับสนุนจากภายใน/ภายนอกหน่วยงาน จำนวนอาจารย์ที่ให้บริการ วิชาการแก่สังคม หลักสูตร/โครงการ/กิจกรรมที่ให้บริการในแต่ละปี เป็นต้น 
                      5) ด้านการทำนุบำรุงศิลปะและวัฒนธรรม หมายถึง มีการจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหาร สามารถนำมาพิจารณาในการตัดสินใจด้านการทำนุบำรุงศิลปะและวัฒนธรรม เช่น จำนวน/ร้อยละ การเปรียบเทียบ งาน/กิจกรรมทำนุบำรุงศิลปะและวัฒนธรรมในแต่ละปี จำนวนงบประมาณที่ได้รับการสนับสนุนจากภายใน/ ภายนอกหน่วยงาน จำนวนอาจารย์ที่งาน/กิจกรรมทำนุบำรุงศิลปะและวัฒนธรรม หลักสูตร/โครงการ/กิจกรรมที่ ให้บริการในแต่ละปี เป็นต้น ',
                'condition' => 'ไม่มีหลักฐานการดำเนินการทั้ง 4 ข้อ (0)  
                    มีการดำเนินงานข้อ 1 (3)  
                    มีการดำเนินงานข้อ 1 และ 2 (5)  
                    มีการดำเนินงานข้อ 1 ถึง 3 (7)  
                    มีครบทุกข้อ (10)  ',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการประพฤติตามกฎหมายและจริยธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การประพฤติตามกฎหมายและจริยธรรม หลักธรรมาภิบาล และการประเมินคุณธรรมและความโปร่งใสในการดำเนินงาน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-20
                'name' => 'ตัวบ่งชี้ที่ 5 การบริหารความเสี่ยง',
                'categorie_id' => 8,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-5',
                'description' => 'การบริหารความเสี่ยง หมายถึง กระบวนการวิเคราะห์ความเสี่ยง การจัดลำดับความสำคัญ การจัดทำ แผนบริหารความเสี่ยง การควบคุมภายใน/การจัดการ เพื่อป้องกันปัญหาที่เกิดจากความเสี่ยงต่าง ๆ รวมถึง แผน เตรียมความพร้อมต่อภาวะฉุกเฉิน แผนความต่อเนื่องทางธุรกิจ และมีการติดตาม ประเมินผลการดำเนินการ 
                     แผนบริหารความเสี่ยง หมายถึง แผนการจัดการเพื่อป้องกันความเสี่ยงต่าง ๆ ที่เกี่ยวกับการจัดการศึกษา และการบริหารที่อาจเกิดขึ้น ซึ่งเกิดจากการวิเคราะห์ความเสี่ยงอย่างรอบด้าน สอดคล้องกับกลยุทธ์ของสถาบัน เช่น ความเสี่ยงด้านกลยุทธ์หรือยุทธศาสตร์ของสถาบัน ความเสี่ยงด้านนโยบาย กฎหมาย ระเบียบ ข้อบังคับ และความ เสี่ยงด้านการปฏิบัติงาน ความเสี่ยงด้านบุคลากร การเงิน งบประมาณ ระบบเทคโนโลยีสารสนเทศ อาคารสถานที่ เป็นต้น 
                      แผนเตรียมความพร้อมต่อภาวะฉุกเฉิน หมายถึง แผนสำหรับผู้บริหาร บุคลากร นักศึกษาของสถาบันเพื่อ เตรียมความพร้อมต่อภาวะฉุกเฉินที่สถาบันระบุไว้ เช่น การเกิดไฟไหม้ น้ำท่วม เป็นต้น แผนความต่อเนื่องทางธุรกิจ (Business Continuity Plan: BCP) หมายถึง แผนสำหรับผู้บริหาร เพื่อใช้ ในการประคองการดำเนินงานของสถาบันในสถานการณ์ภัยพิบัติและเหตุฉุกเฉินที่อาจเกิดขึ้น โดยเริ่มจากวิเคราะห์ สถานการณ์ที่อาจทำให้การดำเนินงานของสถาบันไม่ต่อเนื่อง กำหนดแผน และมีการซ้อมแผนความต่อเนื่องทาง ธุรกิจอย่างน้อยปีละ 1 ครั้ง',
                'condition' => 'ไม่มีหลักฐานการดำเนินการ (0)  
                    มีการดำเนินงานข้อ 1 (3)  
                    มีการดำเนินงานข้อ 1 และ 2 (5)  
                    มีการดำเนินงานข้อ 1 ถึง 3 (7)  
                    มีครบทุกข้อ (10) ',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบริหารความเสี่ยงของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การบริหารความเสี่ยง แผนบริหารความเสี่ยง แผนเตรียมความพร้อมต่อภาวะฉุกเฉิน และแผนความต่อเนื่องทางธุรกิจ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-21
                'name' => 'ตัวบ่งชี้ที่ 6 การสร้างความร่วมมือ',
                'categorie_id' => 8,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-6',
                'description' => 'การสร้างความร่วมมือ หมายถึง กระบวนการดำเนินงานตามพันธกิจที่สำคัญของสถาบันการศึกษาร่วมกับสถาบันอื่น ๆ ในประเทศ หรือ ต่างประเทศ เพื่อสนับสนุนให้สถาบันบรรลุวิสัยทัศน์ และการดำเนินงานตามพันธกิจเป็นไปตามเป้าหมาย เช่น การพัฒนาการเรียนการสอน การวิจัย การบริการวิชาการ การทำนุบำรุงศิลปวัฒนธรรม การพัฒนาคุณภาพการพยาบาลในแหล่งฝึกปฏิบัติทางการพยาบาล เป็นต้น',
                'condition' => 'ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 (3)
                    มีการดำเนินงานข้อ 1 และ 2 (5)
                    มีการดำเนินงานข้อ 1 2 และ3 (8)
                    มีการดำเนินงานครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการสร้างความร่วมมือของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การสร้างความร่วมมือกับสถาบันอื่น ๆ ในประเทศหรือต่างประเทศ การพัฒนาการเรียนการสอน การวิจัย การบริการวิชาการ และการทำนุบำรุงศิลปวัฒนธรรม',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-22
                'name' => 'ตัวบ่งชี้ที่ 7 ขีดความสามารถ และอัตรากำลัง',
                'categorie_id' => 9,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-7',
                'description' => 'ขีดความสามารถ หมายถึง สมรรถนะหรือความสามารถของบุคลากรทั้งสายวิชาการและสายสนับสนุนที่สถาบันพึงมี ซึ่งมีความจำเป็นต่อการตอบสนองพันธกิจและอาจช่วยเสริมสมรรถนะหลักของสถาบัน สร้างความได้เปรียบในการแข่งขัน
                       การกำหนดขีดความสามารถของบุคลากร หมายถึง กระบวนการกำหนดสมรรถนะหรือความสามารถของบุคลากรทั้งสายวิชาการ และสายสนับสนุนเพื่อให้บรรลุวิสัยทัศน์ ยุทธศาสตร์ของสถาบัน ครอบคลุมพันธกิจที่สำคัญที่สถาบันกำหนด
                        การวางแผนด้านอัตรากำลัง หมายถึง กระบวนการวิเคราะห์อัตรากำลังของบุคลากรทั้งสายวิชาการและสายสนับสนุนที่ต้องการอย่างเพียงพอที่จะดำเนินการตามกระบวนการทำงานตามพันธกิจสำคัญที่สถาบันกำหนดให้สำเร็จ รวมทั้งคำนึงถึงการตอบสนองความต้องการกำลังคนตามความต้องการที่มีการเปลี่ยนแปลงในสถานการณ์ปกติและสถานการณ์ที่ไม่คาดหมาย
                        การสรรหาบุคลากร หมายถึง กระบวนการจัดการเพื่อให้สถาบันมีบุคลากรใหม่ทั้งสายวิชาการและสายสนับสนุนที่มีคุณสมบัติและสมรรถนะเพียงพอในการตอบสนองความสำเร็จของสถาบันในการดำเนินการพันธกิจที่สำคัญ ครอบคลุมถึงกระบวนการกำหนดคุณสมบัติที่สอดคล้องกับแผนกลยุทธ์/ยุทธศาสตร์ กระบวนการคัดเลือกบุคลากร กระบวนการว่าจ้างและบรรจุ รวมถึงระบบการดูแลบุคลากรใหม่
                        การเปลี่ยนแปลงในสถานการณ์ปกติและสถานการณ์ที่ไม่คาดหมาย หมายถึง เหตุการณ์การเปลี่ยนแปลงต่างๆที่สถาบันควรนำมาพิจารณาทั้งในเรื่องขีดความสามารถและอัตรากำลังให้มีความเพียงพอต่อการตอบสนองพันธกิจและสามารถดำเนินการได้อย่างต่อเนื่อง เช่น การเกษียณอายุราชการ การลาออก การเจ็บป่วย การเสียชีวิตของบุคลากร การเปิดหลักสูตรและบริการใหม่ ๆ การเปลี่ยนแปลงด้านโครงสร้าง ระบบงานที่ออกแบบใหม่ การใช้เทคโนโลยีทดแทนคน การจัดการภาวะหมดไฟของบุคลากร การเปลี่ยนแปลงด้านความต้องการของนักศึกษา และผู้รับบริการอื่น การพลิกโฉมองค์กร เป็นต้น',
                'condition' => 'ไม่มีหลักฐานการดำเนินการ (0)
                        มีการดำเนินงานข้อ 1 (2)
                        มีการดำเนินงานข้อ 1 และ 2 (4)
                        มีการดำเนินงานข้อ 1 ถึง 3 (6)
                        มีการดำเนินงานข้อ 1 ถึง 4 (8)
                        มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินขีดความสามารถและอัตรากำลังของบุคลากรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การกำหนดขีดความสามารถของบุคลากร การวางแผนด้านอัตรากำลัง การสรรหาบุคลากร และการเปลี่ยนแปลงในสถานการณ์ปกติและสถานการณ์ที่ไม่คาดหมาย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-23
                'name' => 'ตัวบ่งชี้ที่ 8 การบริหารงานบุคคล(HRM)',
                'categorie_id' => 9,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-8',
                'description' => 'การบริหารงานบุคคล หมายถึง กระบวนการจัดระบบการทำงานและบริหารบุคลากรเพื่อให้สามารถใช้ประโยชน์อย่างเต็มที่จากอัตรากำลังและขีดความสามารถของบุคลากรทั้งสายวิชาการและสายสนับสนุนที่มีอยู่ เพื่อตอบสนองการดำเนินงานตามพันธกิจ ตอบสนองความต้องการและความคาดหวังของนักศึกษาและผู้รับบริการอื่น ทำให้เกิดการทำงานที่มีความคล่องตัว รวมถึงการมอบหมายงาน การกำกับติดตาม การจัดการผลการปฏิบัติงาน การบริหารค่าตอบแทน การให้รางวัล ยกย่อง ชมเชย การบริหารการคงอยู่ของบุคลากรเพื่อทำให้สถาบันบรรลุผลสำเร็จของแผนปฏิบัติการได้และสนับสนุนให้เกิดผลการปฏิบัติงานที่โดดเด่น',
                'condition' => 'ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 และ 2 (2)
                    มีการดำเนินงานข้อ 1 ถึง 3 (5)
                    มีการดำเนินงานข้อ 1 ถึง 4 (10)
                    มีครบทุกข้อ (15)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบริหารงานบุคคลของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การจัดระบบการทำงาน การบริหารบุคลากร การมอบหมายงาน การกำกับติดตาม และการบริหารค่าตอบแทน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-24
                'name' => 'ตัวบ่งชี้ที่ 9 การพัฒนาบุคลากร(HRD)',
                'categorie_id' => 9,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-9',
                'description' => ' การพัฒนาบุคลากร หมายถึง ระบบการเรียนรู้และพัฒนาที่สนับสนุนความก้าวหน้าในอาชีพการงานซึ่งสอดคล้องกับความต้องการของตนเองและความจำเป็นด้านขีดความสามารถหรือสมรรถนะที่สถาบันต้องการ โดยสถาบันอาจกำหนดขอบเขตของโอกาสในการพัฒนาบุคลากรอย่างเป็นระบบโดยมุ่งหวังให้บุคลากรสามารถนำ ความรู้และทักษะมาใช้ในการปรับปรุงการปฏิบัติงาน เสริมสร้างทักษะใหม่ในการปฏิบัติงาน และสอนงานกับบุคลากรที่เกี่ยวข้องได้
              การพัฒนาผู้บริหาร หมายถึง กระบวนการเตรียมผู้บริหาร ผู้นำและตำแหน่งสำคัญอื่นๆของสถาบันในอนาคต หรือการพัฒนาความสามารถในการบริหารจัดการองค์กรของผู้บริหาร ผู้นำและตำแหน่งสำคัญอื่นๆของสถาบันในปัจจุบัน',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 (2)
                    มีการดำเนินงานข้อ 1 และ 2 (5)
                    มีการดำเนินงานข้อ 1 ถึง 3 (10)
                    มีการดำเนินงานข้อ 1 ถึง 4 (12)
                    มีครบทุกข้อ (15',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการพัฒนาบุคลากรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การพัฒนาบุคลากร การพัฒนาผู้บริหาร และการพัฒนาความสามารถในการบริหารจัดการองค์กร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-25
                'name' => 'ตัวบ่งชี้ที่ 10 การสร้างความผูกพัน',
                'categorie_id' => 9,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-10',
                'description' => ' การสร้างความผูกพัน หมายถึง กระบวนการสร้างให้บุคลากรสายวิชาการและสายสนับสนุนมีความรู้สึกเป็นส่วนหนึ่งขององค์กร ยึดในอุดมการณ์และมีเป้าหมายร่วมกัน ภาคภูมิใจในงานที่ได้รับมอบหมาย โดยครอบคลุมตั้งแต่การกำหนดปัจจัยขับเคลื่อนความผูกพันของบุคลากร การสร้างสภาพแวดล้อม การสร้างวัฒนธรรมการสื่อสารที่เปิดกว้างและการสร้างบรรยากาศที่เอื้อต่อการปฏิบัติงานที่ทำให้บุคลากรเกิดแรงจูงใจที่จะปฏิบัติงานอย่างเต็มที่เพื่อประโยชน์ของผู้เรียนและผู้รับบริการ รวมทั้งความสำเร็จขององค์กร
                      ปัจจัยขับเคลื่อนความผูกพัน หมายถึง สิ่งที่ทำให้บุคลากรเกิดแรงจูงใจในการปฏิบัติงานอย่างเต็มที่ให้แก่องค์กรและพร้อมที่จะเสียสละ ทุ่มเท สนับสนุนเพื่อให้องค์กรประสบความสำเร็จ สามารถค้นหาจากการสำรวจ การทำวิจัย การสนทนากลุ่ม เป็นต้น
                      นโยบายด้านสวัสดิการ สิทธิประโยชน์ หมายถึง กระบวนการกำหนดระเบียบ แนวทางในการให้ค่าตอบแทนพิเศษ หรือการจัดสรรสวัสดิการ และสิทธิประโยชน์ที่ตอบสนองต่อความต้องการที่หลากหลายและระดับการจ้างงานที่มีความแตกต่างกัน คำนึงถึงการมีส่วนร่วมและเกิดความเท่าเทียม ซึ่งความเหมาะสมอาจขึ้นอยู่กับประสบการณ์และผลการปฏิบัติงานตามข้อกำหนดงานของแต่ละบุคคล โดยคำนึงถึงความสำเร็จขององค์กร
                       สภาพแวดล้อมการทำงาน หมายถึง สิ่งแวดล้อมด้านกายภาพ เครื่องมือเครื่องใช้ อุปกรณ์ที่เอื้อต่อความสำเร็จของงาน สภาวะแวดล้อมที่มีความปลอดภัย การมีสารสนเทศที่สนับสนุนการปฏิบัติงาน เป็นต้น รวมถึงความสะดวกในการเข้าถึงสถานที่ทำงาน สุขภาวะในสถานที่ทำงาน',
                'condition' => 'ไม่มีหลักฐานการดำเนินการ (0)
                        มีการดำเนินงานข้อ 1 และ 2 (3)
                        มีการดำเนินงานข้อ 1 ถึง 3 (5)
                        มีการดำเนินงานข้อ 1 ถึง 4 (7)
                        มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการพัฒนาบุคลากรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การพัฒนาบุคลากร การพัฒนาผู้บริหาร และการพัฒนาความสามารถในการบริหารจัดการองค์กร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-26
                'name' => 'ตัวบ่งชี้ที่ 11 การบริหารหลักสูตร',
                'categorie_id' => 10,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-11',
                'description' => 'การออกแบบหลักสูตร หมายถึง การออกแบบหลักสูตรของสถาบันที่ตอบสนองความต้องการของผู้มีส่วนได้เสียทุกกลุ่ม และนำมากำหนดผลลัพธ์การเรียนรู้ของบัณฑิต (Outcome Based Education: OBE) สอดคล้องกับมาตรฐานหลักสูตรการศึกษาระดับอุดมศึกษา รวมทั้งมาตรฐานคุณวุฒิสาขา หรือสาขาวิชา หรือมาตรฐานระดับนานาชาติ
                      การปรับปรุงหลักสูตร หมายถึง การนำข้อมูลการประเมินผลการจัดการศึกษาและความต้องการของผู้มีส่วนได้เสีย มาใช้ทบทวน ปรับปรุงและพัฒนาคุณภาพของหลักสูตร เพื่อให้ผู้เรียนบรรลุมาตรฐานผลลัพธ์การเรียนรู้ที่กำหนดและผู้ใช้บัณฑิตมั่นใจว่าจะได้บัณฑิตพยาบาลที่มีสมรรถนะตรงตามความต้องการ โดยเป็นการปรับปรุงพัฒนาหลักสูตรเป็นระยะ อย่างน้อยตามรอบระยะเวลาของหลักสูตร หรืออย่างน้อยทุก 5 ปี
                      การประกันคุณภาพหลักสูตร หมายถึง กระบวนการออกแบบ การพัฒนาระบบและกลไก หรือวิธีการเพื่อให้มั่นใจว่าจะได้บัณฑิตที่มีผลลัพธ์การเรียนรู้ที่กำหนดไว้ในหลักสูตร โดยมีหลักฐานเชิงประจักษ์ที่แสดงคุณภาพ มาตรฐานการจัดการศึกษาของหลักสูตรตามที่สถาบันกำหนด',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                     มีการดำเนินงานข้อ 1 และ 2 (10)
                     มีการดำเนินงานข้อ 1 ถึง 3 (15)
                     มีการดำเนินงานข้อ 1 ถึง 4 (20)
                     มีครบทุกข้อ (25)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบริหารหลักสูตรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การออกแบบหลักสูตร การปรับปรุงหลักสูตร และการประกันคุณภาพหลักสูตร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 25.00,
            ],
            [
                // id-27
                'name' => 'ตัวบ่งชี้ที่ 12 การจัดกระบวนการเรียนรู้และการประเมินผล',
                'categorie_id' => 10,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-12',
                'description' => 'การจัดกระบวนการเรียนรู้ หมายถึง การออกแบบกระบวนการเรียนการสอนที่สอดคล้องกับผลลัพธ์การเรียนรู้ของผู้เรียนทั้งระดับหลักสูตร ระดับชั้นปี และระดับรายวิชา ทั้งภาคทฤษฎีและภาคปฏิบัติ ที่เน้นผู้เรียนเป็นศูนย์กลาง ปลูกฝังทักษะการเรียนรู้ตลอดชีวิต เพื่อให้ผู้เรียนบรรลุผลลัพธ์การเรียนรู้ตามที่หลักสูตรและรายวิชาคาดหวัง เกิดชุดความคิดแบบเติบโต (Growth Mindset) สามารถนำสิ่งที่เรียนรู้ไปใช้ในการทำงานได้จริง
                      การประเมินผล หมายถึง กระบวนการวัดและประเมินผลลัพธ์การเรียนรู้ระดับหลักสูตร ระดับชั้นปี และระดับรายวิชา โดยใช้วิธีการ เครื่องมือ และเกณฑ์การตัดสินผลที่เหมาะสม มีความตรง ความเที่ยง และยุติธรรม และมีการทบทวน ตรวจสอบ กำกับ การให้ข้อมูลป้อนกลับ นำไปสู่การปรับปรุง/พัฒนาคุณภาพการเรียนการสอนของผู้สอนและผู้เรียน เพื่อให้มั่นใจว่าผู้เรียนบรรลุผลลัพธ์การเรียนรู้ที่คาดหวัง
                       นวัตกรรมการเรียนการสอน หมายถึง กระบวนการหรือสิ่งประดิษฐ์ใหม่ ที่พัฒนาขึ้นโดยอาจารย์ในสถาบันเพื่อให้การจัดการเรียนการสอนและการประเมินผลบรรลุผลลัพธ์การเรียนรู้ระดับรายวิชา หรือระดับชั้นปี หรือระดับหลักสูตร หรือตามความต้องการของผู้เรียน อาจารย์ หรือ ผู้ใช้บัณฑิต',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                     มีการดำเนินงานข้อ 1 และ 2 (10)
                     มีการดำเนินงานข้อ 1 ถึง 3 (15)
                     มีการดำเนินงานข้อ 1 ถึง 4 (20)
                     มีครบทุกข้อ (25)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการจัดกระบวนการเรียนรู้และการประเมินผลของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การจัดกระบวนการเรียนรู้ การประเมินผล และนวัตกรรมการเรียนการสอน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 25.00,
            ],
            [
                // id-28
                'name' => 'ตัวบ่งชี้ที่ 13 กระบวนการรับนักศึกษา',
                'categorie_id' => 10,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-13',
                'description' => 'การรับนักศึกษา หมายถึง กระบวนการคัดเลือกบุคคลที่มีคุณสมบัติตรงตามที่หลักสูตรกำหนด การกำหนดเกณฑ์ที่ใช้ในการคัดเลือกต้องมีความโปร่งใส ชัดเจน และสอดคล้องกับคุณสมบัติของนักศึกษาที่กำหนดในหลักสูตร มีเครื่องมือที่ใช้ในการคัดเลือก หรือวิธีการคัดเลือกให้ได้นักศึกษาที่มีความพร้อมทางปัญญา สุขภาพกายและจิต มีความมุ่งมั่นที่จะเรียนและมีเวลาเรียนเพียงพอ เพื่อให้สามารถสำเร็จการศึกษาได้ตามที่หลักสูตรกำหนด',
                'condition' => ' ไม่มีหลักฐานการดำเนินงาน (0)
                    มีการดำเนินงานข้อ 1 (2)
                    มีการดำเนินงานข้อ 1 และ 2 (5)
                    มีการดำเนินงานข้อ 1 2 และ 3 (8)
                    มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการรับนักศึกษาของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การคัดเลือกบุคคลที่มีคุณสมบัติตรงตามที่หลักสูตรกำหนด การกำหนดเกณฑ์ที่ใช้ในการคัดเลือก และเครื่องมือที่ใช้ในการคัดเลือก',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-29
                'name' => 'ตัวบ่งชี้ที่ 14 กระบวนการจัดการสิ่งสนับสนุนการเรียนรู้',
                'categorie_id' => 10,
                'year' => 2025,
                'type' => 'ปริมาณ/คุณภาพ',
                'code' => 'NCP-13',
                'description' => 'กระบวนการจัดการสิ่งสนับสนุนการเรียนรู้ หมายถึง การดำเนินการให้เกิดความพร้อมด้านกายภาพ อุปกรณ์ เทคโนโลยี การให้บริการด้านต่างๆ เพื่อสนับสนุนให้นักศึกษาสามารถเรียนรู้ได้อย่างมีประสิทธิภาพและประสิทธิผลของสถาบัน',
                'condition' => '  ไม่มีหลักฐานการดำเนินงาน (0)
                    มีการดำเนินงานข้อ 1 (3)
                    มีการดำเนินงานข้อ 1 และ 2 (7)
                    มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการจัดการสิ่งสนับสนุนการเรียนรู้ของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การดำเนินการให้เกิดความพร้อมด้านกายภาพ อุปกรณ์ เทคโนโลยี และการให้บริการด้านต่าง ๆ เพื่อสนับสนุนให้นักศึกษาสามารถเรียนรู้ได้อย่างมีประสิทธิภาพและประสิทธิผลของสถาบัน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-30
                'name' => 'ตัวบ่งชี้ที่ 15 กระบวนการจัดการสิ่งสนับสนุนการเรียนรู้',
                'categorie_id' => 11,
                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCP-15',
                'description' => ' การพัฒนางานวิจัย นวัตกรรม หมายถึง ระบบและกลไกสนับสนุนให้เกิดงานวิจัย/นวัตกรรมของสถาบัน ครอบคลุมอย่างน้อย การพัฒนาบุคลากรให้มีศักยภาพในการสร้างงานวิจัย/นวัตกรรม การส่งเสริมจริยธรรมและจรรยาบรรณนักวิจัย/นักวิชาการ การจัดสรรภารกิจและเวลา การสนับสนุนงบประมาณ การจัดบุคลากรช่วยสนับสนุนการวิจัยหรือการจัดที่ปรึกษา
                        ความเชี่ยวชาญของสถาบัน หมายถึง ความเข้มแข็งทางวิชาการซึ่งสอดคล้องกับความต้องการของผู้มีส่วนได้เสียหรือชุมชน สังคม ตามที่สถาบันกำหนด
                        การนำงานวิจัย/นวัตกรรม ไปใช้ประโยชน์ หมายถึง ระบบและกลไกที่สนับสนุนให้เกิดการนำวิจัย/นวัตกรรมไปใช้ประโยชน์ การนำไปใช้ประโยชน์มี ดังนี้
                      1. เชิงวิชาการ คือ งานวิจัย/นวัตกรรมของสถาบันที่ได้รับการอ้างอิง
                      2. เชิงนโยบาย คือ งานวิจัย/นวัตกรรมที่มีการนำไปใช้ประกอบการตัดสินใจในการบริหารหรือกำหนดนโยบาย
                      3. เชิงชุมชนหรือสังคม คือ งานวิจัย/นวัตกรรมที่ชุมชนหรือท้องถิ่นนำไปใช้ประโยชน์ หรือนำไปพัฒนาคุณภาพการปฏิบัติการพยาบาล',
                'condition' => '  ไม่มีหลักฐานการดำเนินงาน (0)
                    มีการดำเนินงานข้อ 1 (3)
                    มีการดำเนินงานข้อ 1 และ 2 (6)
                    มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการพัฒนางานวิจัยและนวัตกรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การพัฒนางานวิจัย นวัตกรรม ความเชี่ยวชาญของสถาบัน และการนำงานวิจัย/นวัตกรรมไปใช้ประโยชน์',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-31
                'name' => 'ตัวบ่งชี้ที่ 16 กระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญา',
                'categorie_id' => 11,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCP-16',
                'description' => 'กระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญา หมายถึง กระบวนการนำผลงานวิจัยไปเผยแพร่และ/หรือจดทรัพย์สินทางปัญญาของสถาบัน อย่างมีจริยธรรมและความซื่อสัตย์ทางวิชาการ ครอบคลุมอย่างน้อย การจัดทำต้นฉบับงานวิจัยที่มีคุณภาพ การคัดเลือกวารสาร การจัดสรรงบประมาณสนับสนุนการเผยแพร่ และหรือการสนับสนุนการจดทะเบียนทรัพย์สินทางปัญญา',
                'condition' => '  ไม่มีหลักฐานการดำเนินงาน (0)
                    มีการดำเนินงานข้อ 1 (3)
                    มีการดำเนินงานข้อ 1 และ 2 (6)
                    มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญาของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำผลงานวิจัยไปเผยแพร่ การจดทรัพย์สินทางปัญญา และการจัดทำต้นฉบับงานวิจัยที่มีคุณภาพ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-32
                'name' => 'ตัวบ่งชี้ที่ 17 การบริการวิชาการเพื่อชุมชน/สังคม',
                'categorie_id' => 12,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCP-17',
                'description' => '  การบริการวิชาการเพื่อชุมชน/สังคม หมายถึง กระบวนการในการให้บริการวิชาการแก่ชุมชน/สังคมของสถาบันที่สอดคล้องกับวิสัยทัศน์และความเชี่ยวชาญของสถาบัน โดยมีโครงการ/กิจกรรมที่ก่อให้เกิดประโยชน์แก่ชุมชน/สังคม',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 และ ข้อ 2 (5)
                    มีการดำเนินงานข้อ 1, 2 และ 3 (10)
                    มีครบทุกข้อ (15)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญาของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำผลงานวิจัยไปเผยแพร่ การจดทรัพย์สินทางปัญญา และการจัดทำต้นฉบับงานวิจัยที่มีคุณภาพ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-33
                'name' => 'ตัวบ่งชี้ที่ 18 การปฏิบัติการพยาบาลของอาจารย์ (faculty pracitce)',
                'categorie_id' => 12,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCP-18',
                'description' => ' การปฏิบัติการพยาบาลของอาจารย์ (faculty practice) หมายถึง การนำความชำนาญหรือความเชี่ยวชาญของอาจารย์พยาบาล ไปให้บริการโดยตรงแก่ผู้รับบริการ เป็นรายบุคคล ครอบครัว กลุ่ม หรือชุมชน แสดงให้เห็นถึงความชำนาญ/เชี่ยวชาญทางคลินิก (clinical area) ของอาจารย์พยาบาลในสาขานั้น ๆ นำไปสู่การพัฒนาคุณภาพการพยาบาล
                    วิชาชีพการพยาบาลเป็นวิชาชีพการปฏิบัติ (practice profession) อาจารย์พยาบาลต้องมีความชำนาญในการพยาบาลผู้รับบริการแต่ละสาขา เฉพาะกลุ่ม/เฉพาะโรค ซึ่งเป็นสมรรถนะมาตรฐาน',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 (5)
                    มีการดำเนินงานข้อ 1 และ 2 (10)
                    มีครบทุกข้อ (15)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญาของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำผลงานวิจัยไปเผยแพร่ การจดทรัพย์สินทางปัญญา และการจัดทำต้นฉบับงานวิจัยที่มีคุณภาพ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-34
                'name' => 'ตัวบ่งชี้ที่ 19 การบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรม กับ การเรียนการสอน/บริการวิชาการ/วิจัย',
                'categorie_id' => 13,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCP-19',
                'description' => ' การบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรม กับ การเรียนการสอน/บริการวิชาการ/วิจัย หมายถึง การนำศิลปะและวัฒนธรรม/ภูมิปัญญาของท้องถิ่นหรือไทย บูรณาการเข้ากับศาสตร์ทางวิทยาศาสตร์สุขภาพ เกิดการ พัฒนาองค์ความรู้ที่มีรากฐานความเป็นไทย และนำไปสู่การพัฒนาการเรียนการสอน/บริการวิชาการ/วิจัย',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 (3)
                    มีการดำเนินงานข้อ 1 และ 2 (7)
                    มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำศิลปะและวัฒนธรรม/ภูมิปัญญาของท้องถิ่นหรือไทย บูรณาการเข้ากับศาสตร์ทางวิทยาศาสตร์สุขภาพ และการพัฒนาองค์ความรู้ที่มีรากฐานความเป็นไทย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-35
                'name' => 'ตัวบ่งชี้ที่ 20 การพัฒนานักศึกษา',
                'categorie_id' => 14,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCP-20',
                'description' => ' การพัฒนานักศึกษา หมายถึง กระบวนการเสริมหลักสูตรที่พัฒนาให้นักศึกษามีคุณลักษณะที่สอคล้องกับอัตลักษณ์บัณฑิต/ค่านิยมของสถาบัน กระบวนการช่วยเหลือนักศึกษา และการจัดการข้อร้องเรียน รวมถึงกระบวนการสนับสนุนให้นักศึกษาประพฤติตามกฎระเบียบและหลักจริยธรรม',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 และ ข้อ 2 (10)
                    มีการดำเนินงานข้อ 1 , 2 และ 3 (15)
                    มีครบทุกข้อ (20)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำศิลปะและวัฒนธรรม/ภูมิปัญญาของท้องถิ่นหรือไทย บูรณาการเข้ากับศาสตร์ทางวิทยาศาสตร์สุขภาพ และการพัฒนาองค์ความรู้ที่มีรากฐานความเป็นไทย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 20.00,
            ],
            [
                // id-36
                'name' => 'ตัวบ่งชี้ที่ 21 ความผูกพันของนักศึกษาและศิษย์เก่า',
                'categorie_id' => 14,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCP-21',
                'description' => ' ความผูกพัน หมายถึง กระบวนการจัดการความสัมพันธ์ระยะยาวของนักศึกษาและศิษย์เก่ากับสถาบัน ที่ทำให้นักศึกษาและศิษย์เก่าเกิดความรู้สึกภาคภูมิใจในสถาบัน และมีส่วนสนับสนุนความเจริญก้าวหน้าและชื่อเสียงของสถาบัน',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 และ ข้อ 2 (10)
                    มีการดำเนินงานข้อ 1 , 2 และ 3 (15)
                    มีครบทุกข้อ (20)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำศิลปะและวัฒนธรรม/ภูมิปัญญาของท้องถิ่นหรือไทย บูรณาการเข้ากับศาสตร์ทางวิทยาศาสตร์สุขภาพ และการพัฒนาองค์ความรู้ที่มีรากฐานความเป็นไทย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 20.00,
            ],
            //ผลลัพธ์
            [
                // id-37
                'name' => 'ตัวบ่งชี้ที่ 1 ผลการประเมินการบริหารงานของคณะผู้บริหารด้วยหลักธรรมาภิบาล หรือ การดำเนินการตามหลักคุณธรรมและความโปร่งใสของการดำเนินงาน',
                'categorie_id' => 15,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-1',
                'description' => '',
                'condition' => 'ใช้คะแนนเฉลี่ยของการประเมินคณะผู้บริหาร (คะแนนเต็ม 5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลการประเมินการบริหารงานของคณะผู้บริหารด้วยหลักธรรมาภิบาล หรือ การดำเนินการตามหลักคุณธรรมและความโปร่งใสของการดำเนินงาน โดยใช้คะแนนเฉลี่ยของการประเมินคณะผู้บริหาร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-38
                'name' => 'ตัวบ่งชี้ที่ 2 ผลลัพธ์ของความสำเร็จของความร่วมมือกับสถาบันอื่น ',
                'categorie_id' => 15,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-2',
                'description' => ' ความสำเร็จของความร่วมมือ หมายถึง ผลลัพธ์ที่เกิดจากความร่วมมือตามเป้าหมาย/วัตถุประสงค์ที่ทำให้บรรลุวิสัยทัศน์ และพันธกิจของสถาบัน',
                'condition' => 'ไม่มีหลักฐานแสดงผลลัพธ์การดำเนินการ (0)
                    มีผลลัพธ์ของความสำเร็จของความร่วมมือฯระดับชาติหรือนานาชาติ (6)
                    มีผลลัพธ์ของความสำเร็จของความร่วมมือฯระดับชาติและนานาชาติ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลลัพธ์ของความสำเร็จของความร่วมมือกับสถาบันอื่น โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การมีผลลัพธ์ของความสำเร็จของความร่วมมือระดับชาติหรือนานาชาติ และการมีผลลัพธ์ของความสำเร็จของความร่วมมือระดับชาติและนานาชาติ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-39
                'name' => 'ตัวบ่งชี้ที่ 3 ร้อยละของการดำเนินการที่บรรลุเป้าหมายตามแผนกลยุทธ์/ยุทธ์ศาสตร์ ',
                'categorie_id' => 15,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-3',
                'description' => ' บรรลุเป้าหมาย หมายถึง ผลของการดำเนินการตามโครงการ/กิจกรรมเป็นไปตามเป้าหมายที่กำหนดไว้ในแผนกลยุทธ์/ยุทธศาสตร์',
                'condition' => ' ต่ำกว่า ร้อยละ 61 (0)
                        ร้อยละ 61 – 70 (1)
                        ร้อยละ 71 – 80 (2)
                        ร้อยละ 81 – 90 (3)
                        ร้อยละ 91 – 100 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินร้อยละของการดำเนินการที่บรรลุเป้าหมายตามแผนกลยุทธ์/ยุทธ์ศาสตร์ของสถาบันการศึกษา โดยพิจารณาจากจำนวนโครงการหรือกิจกรรมที่มีผลการดำเนินงานเป็นไปตามเป้าหมายที่กำหนดไว้ในแผนกลยุทธ์หรือยุทธศาสตร์',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-40
                'name' => 'ตัวบ่งชี้ที่ 4 ร้อยละของการใช้จ่ายตามแผนการจัดสรรงบประมาณ  ',
                'categorie_id' => 15,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-4',
                'description' => '',
                'condition' => 'ต่ำกว่า ร้อยละ 61 (0)
                    ร้อยละ 61 – 70 (1)
                    ร้อยละ 71 – 80 (2)
                    ร้อยละ 81 – 90 (3)
                    ร้อยละ 91 – 100 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการประพฤติตามกฎหมายและจริยธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การประพฤติตามกฎหมายและจริยธรรม หลักธรรมาภิบาล และการประเมินคุณธรรมและความโปร่งใสในการดำเนินงาน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-41
                'name' => 'ตัวบ่งชี้ที่ 5 อัตราคงอยู่ของอาจารย์',
                'categorie_id' => 16,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-5',
                'description' => 'อัตราการคงอยู่ หมายถึง จำนวนอาจารย์ที่ปฏิบัติงานในสถาบันการศึกษาอย่างต่อเนื่องในแต่ละปีการศึกษา โดยนับตั้งแต่วันเริ่มต้นของแต่ละปีการศึกษาถึงวันสุดท้ายของปีการศึกษา',
                'condition' => 'น้อยกว่าร้อยละ 95 (0)
                        ร้อยละ 95 – 96.9 (3)
                        เท่ากับหรือมากกว่ารัอยละ 97 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินอัตราคงอยู่ของอาจารย์ในสถาบันการศึกษา โดยพิจารณาจากจำนวนอาจารย์ที่ปฏิบัติงานในสถาบันการศึกษาอย่างต่อเนื่องในแต่ละปีการศึกษา เช่น อัตราคงอยู่ของอาจารย์ที่มีคุณสมบัติและความสามารถในการสอน และการพัฒนาคุณภาพการสอน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-42
                'name' => 'ตัวบ่งชี้ที่ 6 อัตราการคงอยู่ของบุคลากรสายสนับสนุน',
                'categorie_id' => 16,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-6',
                'description' => 'การสร้างความร่วมมือ หมายถึง กระบวนการดำเนินงานตามพันธกิจที่สำคัญของสถาบันการศึกษาร่วมกับสถาบันอื่น ๆ ในประเทศ หรือ ต่างประเทศ เพื่อสนับสนุนให้สถาบันบรรลุวิสัยทัศน์ และการดำเนินงานตามพันธกิจเป็นไปตามเป้าหมาย เช่น การพัฒนาการเรียนการสอน การวิจัย การบริการวิชาการ การทำนุบำรุงศิลปวัฒนธรรม การพัฒนาคุณภาพการพยาบาลในแหล่งฝึกปฏิบัติทางการพยาบาล เป็นต้น',
                'condition' => ' น้อยกว่าร้อยละ 85 (0)
                        ร้อยละ 85 – 89.9 (3)
                        เท่ากับหรือมากกว่ารัอยละ 90 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินอัตราการคงอยู่ของบุคลากรสายสนับสนุนในสถาบันการศึกษา โดยพิจารณาจากจำนวนบุคลากรสายสนับสนุนที่ปฏิบัติงานในสถาบันการศึกษาอย่างต่อเนื่องในแต่ละปีการศึกษา เช่น อัตราคงอยู่ของบุคลากรสายสนับสนุนที่มีคุณสมบัติและความสามารถในการให้บริการ และการพัฒนาคุณภาพการให้บริการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-43
                'name' => 'ตัวบ่งชี้ที่ 7 ผลลัพธ์การพัฒนาคุณภาพการจัดการเรียนการสอนของอาจารย์',
                'categorie_id' => 16,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-7',
                'description' => 'ผลลัพธ์การพัฒนาคุณภาพการจัดการเรียนการสอนของอาจารย์ ได้แก่ ผลสำเร็จของการส่งเสริมส่งเสริมสมรรถนะและประสิทธิภาพการจัดการเรียนการสอนที่ครอบคลุม 3 องค์ประกอบ ได้แก่
                    งค์ประกอบที่ 1 องค์ความรู้(Knowledge) ประกอบด้วย 2 มิติ คือ
                           1.1 ความรู้ในศาสตร์สาขาวิชา
                           1.2 ความรู้ในศาสตร์การสอนและการเรียนรู้
                    องค์ประกอบที่ 2 สมรรถนะ (Competencies) ประกอบด้วย 4 มิติ คือ
                           2.1 ออกแบบและวางแผนการจัดกิจกรรมการเรียนรู้ของผู้เรียนอย่างมีประสิทธิภาพ
                           2.2 ดำเนินกิจกรรมการเรียนรู้ได้อย่างมีประสิทธิภาพ
                           2.3 เสริมสร้างบรรยากาศการเรียนรู้และสนับสนุนการเรียนรู้ของผู้เรียน
                           2.4 วัดและประเมินผลการเรียนรู้ของผู้เรียน พร้อมทั้งสามารถให้ข้อมูลป้อนกลับอย่างสร้างสรรค์
                     องค์ประกอบที่3 ค่านิยม (Values) ประกอบด้วย 2 มิติ คือ
                            3.1 คุณค่าในการพัฒนาวิชาชีพอาจารย์และการพัฒนาตนเองอย่างต่อเนื่อง
                            3.2 ธำรงไว้ซึ่งจรรยาบรรณแห่งวิชาชีพอาจารย์',
                'condition' => 'การประเมินปีการศึกษา 2568 - 2570
                               อาจารย์อย่างน้อยร้อยละ 70 มีคุณภาพการจัดการเรียนการสอน ระดับที่ 1 (10)
                               มีข้อ 1 และ มีอาจารย์ที่มีคุณภาพการจัดการเรียนการสอน ระดับที่ 2 อย่างน้อยร้อยละ 50 (20)
                               การประเมินปีการศึกษา 2571 เป็นต้นไป
                        อาจารย์ร้อยละ 100 มีคุณภาพการจัดการเรียนการสอน ระดับที่ 1 (7)
                        มีอาจารย์ที่มีคุณภาพการจัดการเรียนการสอน ระดับที่ 2 อย่างน้อยร้อยละ 80 (14)
                        มีอาจารย์ที่มีคุณภาพการจัดการเรียนการสอน ระดับที่ 3 อย่างน้อยร้อยละ 20 (20)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินขีดความสามารถและอัตรากำลังของบุคลากรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การกำหนดขีดความสามารถของบุคลากร การวางแผนด้านอัตรากำลัง การสรรหาบุคลากร และการเปลี่ยนแปลงในสถานการณ์ปกติและสถานการณ์ที่ไม่คาดหมาย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 20.00,
            ],
            [
                // id-44
                'name' => 'ตัวบ่งชี้ที่ 8 ผลการประเมินผลลัพธ์การเรียนรู้ ',
                'categorie_id' => 17,
                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-8',
                'description' => 'การประเมินผลลัพธ์การเรียนรู้ หมายถึง การวัดและประเมินผลลัพธ์การเรียนรู้อย่างเป็นรูปธรรม โดยมีความเชื่อมโยงและสัมพันธ์กัน (Aligned) ในทุกระดับตั้งแต่บทเรียน รายวิชา หลักสูตร',
                'condition' => ' ผ่านน้อยกว่าร้อยละ 95 (0)
                        ผ่านร้อยละ 95 - 99 (5)
                        ผ่านร้อยละ 100 (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบริหารงานบุคคลของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การจัดระบบการทำงาน การบริหารบุคลากร การมอบหมายงาน การกำกับติดตาม และการบริหารค่าตอบแทน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-45
                'name' => 'ตัวบ่งชี้ที่ 9 ร้อยละของผู้สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลผ่านในครั้งแรก',
                'categorie_id' => 17,

                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-9',
                'description' => 'ผู้สอบผ่านในครั้งแรก หมายถึง ผู้สำเร็จการศึกษาที่สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ผ่านในครั้งแรกตามรอบการจัดสอบของสภาการพยาบาลหลังสำเร็จการศึกษา
              การนับจำนวนผู้สำเร็จการศึกษาที่เข้าสอบครั้งแรกในปีการศึกษานั้น ให้ยกเว้นกรณี 
               (1) บัณฑิตไม่ประสงค์จะขอรับใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ของประเทศไทย 
               (2) ขาดสอบด้วยเหตุสุดวิสัย ให้แสดงหลักฐานเป็นลายลักษณ์อักษรจากสถาบันการศึกษา',
                'condition' => ' ใช้บัญญัติไตรยางศ์เทียบ โดยกำหนดผู้สอบผ่านครั้งแรก ย้อนหลัง 3 ปี
                        ต่ำกว่า 60 % (0)
                        ร้อยละ 60 ขึ้นไป (10)
                        ร้อยละ 70 ขึ้นไป (20)
                        ร้อยละ 80 ขึ้นไป (30)
                        ร้อยละ 90 ขึ้นไป (40)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลลัพธ์การเรียนรู้ของผู้สำเร็จการศึกษา โดยพิจารณาจากร้อยละของผู้สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลผ่านในครั้งแรก ซึ่งเป็นการวัดความสำเร็จในการเตรียมความพร้อมของผู้สำเร็จการศึกษาในการเข้าสู่วิชาชีพ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 40.00,
            ],
            [
                // id-46
                'name' => 'ตัวบ่งชี้ที่ 10 ร้อยละของผู้สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลผ่านในปีแรก ',
                'categorie_id' => 17,

                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-10',
                'description' => ' ผู้สอบผ่านในปีแรก หมายถึง ผู้สำเร็จการศึกษาที่สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ผ่านภายในปีแรกที่สำเร็จการศึกษา
              การนับจำนวนผู้สำเร็จการศึกษาทั้งหมดในปีแรก ให้ยกเว้นกรณีบัณฑิตไม่ประสงค์จะขอรับใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ของประเทศไทย โดยแสดงหลักฐานเป็นลายลักษณ์อักษรจากสถาบันการศึกษา',
                'condition' => 'โดยกำหนดผู้สอบผ่านในปีแรก ย้อนหลัง 3 ปี
                        น้อยกว่าร้อยละ 80 (0)
                        ร้อยละ 80 ขึ้นไป (2)
                        ร้อยละ 85 ขึ้นไป (4)
                        ร้อยละ 90 ขึ้นไป (6)
                        ร้อยละ 95 ขึ้นไป (8)
                        ร้อยละ 100 (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการพัฒนาบุคลากรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การพัฒนาบุคลากร การพัฒนาผู้บริหาร และการพัฒนาความสามารถในการบริหารจัดการองค์กร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-47
                'name' =>
                'ตัวบ่งชี้ที่ 11 หลักสูตรได้รับการรับรองคุณภาพหลักสูตรตามมาตรฐานระดับสากล',
                'categorie_id' => 17,

                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-11',
                'description' => 'หลักสูตรได้รับการรับรองคุณภาพหลักสูตรตามมาตรฐานระดับสากล หมายถึง หลักสูตรที่ได้รับการประเมินคุณภาพตามมาตรฐานระดับสากล เช่น AUNQA , The Accreditation Commission for Education in Nursing (ACEN) เป็นต้น',
                'condition' => '  ไม่มีการดำเนินงาน (0 คะแนน)
                        มีการดำเนินการประกันคุณภาพการศึกษาภายในระดับหลักสูตรตามที่สภาสถาบันอุดมศึกษากำหนด (5 คะแนน)
                        มีการประกันคุณภาพการศึกษาภายในระดับหลักสูตรตามเกณฑ์มาตรฐานระดับสากลที่สภาสถาบันอุดมศึกษากำหนดโดยผู้ประเมินภายนอกมหาวิทยาลัยร่วมด้วยและได้ผลการประเมินระดับดีขึ้นไป (10 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการรับรองคุณภาพหลักสูตรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การรับรองคุณภาพหลักสูตรตามมาตรฐานระดับสากล การประกันคุณภาพการศึกษาภายในระดับหลักสูตร และการประเมินผลการดำเนินงานของหลักสูตร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-48
                'name' => 'ตัวบ่งชี้ที่ 12 ผลการประเมินสถานที่และการใช้สิ่งสนับสนุนการเรียนรู้',
                'categorie_id' => 17,

                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-12',
                'description' => '',
                'condition' => ' ไม่พบหลักฐาน (0)
                        มี 1 ข้อ (1)
                        มี 2 ข้อ (2)
                        มี 3 ข้อ (3)
                        มี 4 ข้อ (4)
                        ครบทุกข้อ (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการจัดกระบวนการเรียนรู้และการประเมินผลของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การจัดกระบวนการเรียนรู้ การประเมินผล และนวัตกรรมการเรียนการสอน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-49
                'name' => 'ตัวบ่งชี้ที่ 13  ผลงานวิจัยและผลงานวิชาการที่ตีพิมพ์เผยแพร่ต่ออาจารย์ประจำทั้งหมด',
                'categorie_id' => 18,

                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-13',
                'description' => 'อาจารย์ประจำทั้งหมด หมายถึง อาจารย์พยาบาลประจำทั้งหมดของสถาบันการศึกษา',
                'condition' => 'ใช้บัญญัติไตรยางศ์เทียบโดยกำหนดผลงานวิจัยและผลงานวิชาการที่ตีพิมพ์เผยแพร่ที่คำนวณจากระดับคุณภาพงานวิจัย ร้อยละ 70 เท่ากับ 25 คะแนน
                คะแนนืั้ได้ = ร้อยละของผลงานทางวิชาการ/70*25',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลงานวิจัยและผลงานวิชาการที่ตีพิมพ์เผยแพร่ของอาจารย์ประจำทั้งหมดของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การตีพิมพ์ผลงานวิจัยและผลงานวิชาการในวารสารวิชาการที่มีคุณภาพ และการเผยแพร่ผลงานวิจัยและผลงานวิชาการในงานประชุมวิชาการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 25.00,
            ],
            [
                // id-50
                'name' => 'ตัวบ่งชี้ที่ 14 ผลลัพธ์การผลิตตำรา/หนังสือ',
                'categorie_id' => 18,

                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-13',
                'description' => 'ตำรา หมายถึง ผลงานวิชาการที่ใช้สำหรับการเรียนการสอนทั้งวิชา หรือเป็นส่วนหนึ่งของวิชา ซึ่งเกิดจากการนำข้อค้นพบจากทฤษฎีจากงานวิจัยของตนเอง หรือความรู้ที่ได้จากการค้นคว้าศึกษา มาวิเคราะห์ สังเคราะห์รวบรวมและเรียบเรียง โดยมีมโนทัศน์ที่ผู้เขียนกำหนดให้เป็นแกนกลาง ซึ่งสัมพันธ์กับมโนทัศน์ย่อยอื่นอย่างเป็นระบบ มีเอกภาพ สัมพันธภาพ และสารัตถภาพตามหลักการเขียนที่ดี ใช้ภาษาที่เป็นมาตรฐานทางวิชาการ และให้ความรู้ใหม่ อันเป็นความรู้สำคัญที่มีผลให้เกิดความเปลี่ยนแปลงต่อวงการวิชาการนั้น ๆ เนื้อหาสาระของตำราต้องมีความทันสมัย เป็นรูปเล่มที่ประกอบด้วย คำนำ สารบัญ เนื้อเรื่อง การอธิบายหรือการวิเคราะห์ การสรุป การอ้างอิง บรรณานุกรม และดัชนีค้นคำ ทั้งนี้ควรมีการอ้างอิงแหล่งข้อมูลที่ทันสมัยและ ครบถ้วนสมบูรณ์ การอธิบายสาระสำคัญมีความชัดเจน โดยอาจใช้ข้อมูล แผนภาพ ตัวอย่าง หรือกรณีศึกษาประกอบจนผู้อ่านสามารถทำความเข้าใจในสาระสำคัญนั้นได้โดยเบ็ดเสร็จ
                      หนังสือ หมายถึง ผลงานวิชาการที่เกิดจากการค้นคว้าศึกษาความรู้ในเรื่องใดเรื่องหนึ่งอย่างรอบด้านและลึกซึ้ง มีการวิเคราะห์ สังเคราะห์และเรียบเรียงอย่างเป็นระบบ ประกอบด้วยมโนทัศน์หลัก ที่เป็นแกนกลางและมโนทัศน์ย่อยที่สัมพันธ์กัน มีความละเอียดลึกซึ้ง ใช้ภาษาที่เป็นมาตรฐานทางวิชาการ ให้ทัศนะของผู้เขียนที่สร้างเสริมปัญญาความคิดและสร้างความแข็งแกร่งทางวิชาการให้แก่สาขาวิชานั้น ๆ หรือสาขาวิชาที่เกี่ยวข้อง เนื้อหาของหนังสือไม่จำเป็นต้องสอดคล้องหรือเป็นไปตามข้อกำหนดของหลักสูตรหรือของวิชาใดวิชาหนึ่ง ในหลักสูตรและ ไม่จำเป็นต้องนำไปใช้ประกอบการเรียนการสอนในวิชาใดวิชาหนึ่ง เนื้อหาสาระของหนังสือต้องมีความทันสมัย เป็นรูปเล่มที่ประกอบด้วย คำนำ สารบัญ เนื้อเรื่อง การวิเคราะห์ การสรุป การอ้างอิง บรรณานุกรม และดัชนีค้นคำ ที่ทันสมัยและครบถ้วนสมบูรณ์ โดยอาจมีข้อมูล แผนภาพ ตัวอย่าง หรือกรณีศึกษาประกอบด้วยก็ได้ ตามรูปแบบอย่างใดอย่างหนึ่งต่อไปนี้ ๑. เป็นงานที่นักวิชาการเขียนทั้งเล่ม (authored book) คือเอกสารที่ผู้เขียนเรียบเรียง ขึ้นทั้งเล่มอย่างมีเอกภาพ มีรากฐานทางวิชาการที่มั่นคง และให้ทัศนะของผู้เขียนที่สร้าง เสริมปัญญา ความคิด และสร้างความแข็งแกร่งทางวิชาการ ๒. เป็นงานวิชาการบางบทหรือส่วนหนึ่งในหนังสือที่มีผู้เขียนหลายคน (book chapter) โดยจะต้องมีความเป็นเอกภาพของเนื้อหาวิชาการ ซึ่งผู้อ่านสามารถทำความเข้าใจ ในสาระสำคัญนั้นได้โดยเบ็ดเสร็จในแต่ละบท และเป็นงานศึกษาค้นคว้าอย่างมีระบบ มีการวิเคราะห์และสังเคราะห์ข้อมูลด้วยวิธีวิทยาอันเป็นที่ยอมรับจนได้ข้อสรุปที่ทำให้เกิด ความก้าวหน้าทางวิชาการ หรือนำไปประยุกต์ใช้ได้ กรณีที่ในแต่ละบทมีผู้เขียนหลายคน จะต้องระบุบทบาทหน้าที่ของแต่ละคนอย่างชัดเจน จำนวนบทที่จะนำมาแทนหนังสือ ๑ เล่ม ต้องมีจำนวนอย่างน้อย ๕ บท และมีจำนวนหน้ารวมกันแล้วไม่น้อยกว่า ๘๐ หน้า โดยเนื้อหาสาระของบทในหนังสือทั้ง ๕ บท จะต้องไม่ซ้ำซ้อนกัน
                      ผู้ทรงคุณวุฒิที่ทำหน้าที่ประเมินผลงานทางวิชาการและจริยธรรมและจรรยาบรรณทางวิชาการ ในสาขาวิชานั้น ๆ ซึ่งมีองค์ประกอบ ดังนี้ (๑) ประธานกรรมการ (๒) กรรมการผู้ทรงคุณวุฒิ จำนวนสามถึงห้าคน การแต่งตั้งกรรมการผู้ทรงคุณวุฒิเพื่อทำหน้าที่ประเมินผลงานทางวิชาการ และจริยธรรมและจรรยาบรรณทางวิชาการ ต้องคัดสรรจากบัญชีรายชื่อผู้ทรงคุณวุฒิที่ ก.พ.อ. กาหนด สำหรับสาขาวิชาที่เสนอขอ หรือมีความรู้ความเชี่ยวชาญเกี่ยวข้องกับสาขาวิชาและผลงานที่เสนอขอ โดยต้องไม่ใช่บุคลากรและไม่เคยเป็นบุคลากรในสังกัดสถาบันอุดมศึกษานั้น ๆ รวมทั้งมีตำแหน่งทางวิชาการไม่ต่ำกว่าตำแหน่งที่เสนอขอ',
                'condition' => '1 สาขาหลักทางการพยาบาล (2)
                        2 สาขาหลักทางการพยาบาล (4)
                        3 สาขาหลักทางการพยาบาล (6)
                        4 สาขาหลักทางการพยาบาล (8)
                        5 สาขาหลักทางการพยาบาล (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลการผลิตตำรา/หนังสือของสถาบันการศึกษา โดยพิจารณาจากจำนวนสาขาหลักทางการพยาบาลที่มีการผลิตตำรา/หนังสือ และคุณภาพของผลงานที่ตีพิมพ์เผยแพร่ เช่น การตีพิมพ์ในวารสารวิชาการที่มีคุณภาพ และการเผยแพร่ผลงานวิจัยและผลงานวิชาการในงานประชุมวิชาการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-51
                'name' => 'ตัวบ่งชี้ที่ 15 จำนวนทรัพย์สินทางปัญญา (สิทธิบัตรและอนุสิทธิบัตร)',
                'categorie_id' => 18,

                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-15',
                'description' => '',
                'condition' => ' ไม่มีชิ้นงาน (0)
                        มีผลงานที่มีสิขสิทธิ์ (5)
                        มีผลงานที่มีอนุสิทธิบัตร (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินจำนวนทรัพย์สินทางปัญญา (สิทธิบัตรและอนุสิทธิบัตร) ของสถาบันการศึกษา โดยพิจารณาจากจำนวนผลงานที่มีสิทธิ์ได้รับการคุ้มครองตามกฎหมายทรัพย์สินทางปัญญา เช่น สิทธิบัตรและอนุสิทธิบัตรที่ได้รับการจดทะเบียน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-52
                'name' => 'ตัวบ่งชี้ที่ 16 ผลลัพธ์ของโครงการบริการวิชาการที่เป็นประโยชน์ต่อสังคมและประเทศ',
                'categorie_id' => 19,

                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-16',
                'description' => '',
                'condition' => ' ไม่มีหลักฐานฐานการดำเนินงาน (0)
                         ผลลัพธ์บรรลุวัตถุประสงค์และเป้าหมายของโครงการ (10)
                         ผลลัพธ์ตอบสนองความต้องการของชุมชนและส่งผลให้ชุมชนเข้มแข็ง (20)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลลัพธ์ของโครงการบริการวิชาการที่เป็นประโยชน์ต่อสังคมและประเทศ โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การดำเนินงานโครงการบริการวิชาการที่ตอบสนองความต้องการของชุมชน การสร้างความเข้มแข็งให้กับชุมชน และการส่งเสริมการพัฒนาที่ยั่งยืน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 20.00,
            ],
            [
                // id-53
                'name' => 'ตัวบ่งชี้ที่ 17 ร้อยละของอาจารย์พยาบาลประจำที่ปฏิบัติการพยาบาลในสาขาวิชาที่รับผิดชอบ',
                'categorie_id' => 19,

                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-17',
                'description' => 'อาจารย์พยาบาลประจำที่ปฏิบัติการพยาบาล หมายถึง อาจารย์พยาบาลของสถาบันการศึกษาที่รับผิดชอบ ในการสอนรายวิชาการพยาบาลและวิชาการรักษาโรคเบื้องต้น ทั้งนี้ไม่นับรวมอาจารย์ประจำที่มีตำแหน่งเป็นผู้บริหารตามที่สภามหาวิทยาลัยกำหนด',
                'condition' => 'น้อยกว่าร้อยละ 60 (0)
                        ร้อยละ 60 - 69 (5)
                        ร้อยละ 70 - 79 (10)
                        ร้อยละ 80 - 89 (15)
                        ร้อยละ 90 ขึ้นไป (20)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญาของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำผลงานวิจัยไปเผยแพร่ การจดทรัพย์สินทางปัญญา และการจัดทำต้นฉบับงานวิจัยที่มีคุณภาพ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 20.00,
            ],
            [
                // id-54
                'name' => 'ตัวบ่งชี้ที่ 18 การปฏิบัติการพยาบาลของอาจารย์ (faculty pracitce)',
                'categorie_id' => 20,

                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-18',
                'description' => ' การปฏิบัติการพยาบาลของอาจารย์ (faculty practice) หมายถึง การนำความชำนาญหรือความเชี่ยวชาญของอาจารย์พยาบาล ไปให้บริการโดยตรงแก่ผู้รับบริการ เป็นรายบุคคล ครอบครัว กลุ่ม หรือชุมชน แสดงให้เห็นถึงความชำนาญ/เชี่ยวชาญทางคลินิก (clinical area) ของอาจารย์พยาบาลในสาขานั้น ๆ นำไปสู่การพัฒนาคุณภาพการพยาบาล
                    วิชาชีพการพยาบาลเป็นวิชาชีพการปฏิบัติ (practice profession) อาจารย์พยาบาลต้องมีความชำนาญในการพยาบาลผู้รับบริการแต่ละสาขา เฉพาะกลุ่ม/เฉพาะโรค ซึ่งเป็นสมรรถนะมาตรฐาน',
                'condition' => ' ไม่พบหลักฐานการบูรณาการ (0)
                    การบูรณาการกับการเรียนการสอนในรายวิชาที่เกี่ยวข้อง (5)
                    การบูรณาการกับการเรียนการสอนในรายวิชาที่เกี่ยวข้องและการวิจัยหรือการบริการวิชาการ (10)
                    การบูรณาการกับการเรียนการสอนในรายวิชาที่เกี่ยวข้องและการวิจัยและการบริการวิชาการ (15)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการปฏิบัติการพยาบาลของอาจารย์ โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำความชำนาญหรือความเชี่ยวชาญของอาจารย์พยาบาลไปให้บริการโดยตรงแก่ผู้รับบริการ การบูรณาการการปฏิบัติการพยาบาลเข้ากับการเรียนการสอน และการวิจัยหรือบริการวิชาการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-55
                'name' => 'ตัวบ่งชี้ที่ 19 ร้อยละของบัณฑิตที่มีอัตลักษณ์/คุณลักษณะพิเศษตามที่สถาบันกำหนด ',
                'categorie_id' => 21,

                'year' => 2025,
                'type' => 'ปริมาณ',
                'code' => 'NCO-19',
                'description' => '',
                'condition' => 'ใช้บัญญัติไตรยางค์เทียบโดยกำหนดร้อยละของบัณฑิตที่มีอัตลักษณ์/คุณลักษณะพิเศษตามที่สถาบันกำหนดต่อจำนวนบัณฑิตทั้งหมด ที่มีค่าคะแนนเฉลี่ยตั้งแต่ 3.51 ขึ้นไปในระบบ 5 คะแนน ร้อยละ100 เท่ากับ 10 คะแนน',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำศิลปะและวัฒนธรรม/ภูมิปัญญาของท้องถิ่นหรือไทย บูรณาการเข้ากับศาสตร์ทางวิทยาศาสตร์สุขภาพ และการพัฒนาองค์ความรู้ที่มีรากฐานความเป็นไทย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-56
                'name' => 'ตัวบ่งชี้ที่ 20 การทำคุณประโยชน์ต่อสถาบันของศิษย์เก่า',
                'categorie_id' => 21,

                'year' => 2025,
                'type' => 'คุณภาพ',
                'code' => 'NCO-20',
                'description' => 'การทำคุณประโยชน์ต่อสถาบันของศิษย์เก่า หมายถึง การช่วยเหลือสถาบันการศึกษาของศิษย์เก่าในลักษณะที่เป็นประโยชน์ เพื่อให้บรรลุพันธกิจของสถาบัน',
                'condition' => 'ไม่มีการดำเนินการ (0)
                        มี ข้อ 1 (3)
                        มีข้อ 1 และ 2 (6)
                        มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการทำคุณประโยชน์ต่อสถาบันของศิษย์เก่า โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การช่วยเหลือสถาบันการศึกษาในลักษณะที่เป็นประโยชน์ การสนับสนุนกิจกรรมต่าง ๆ ของสถาบัน และการสร้างเครือข่ายความร่วมมือกับศิษย์เก่า',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
              [
                //id-1
                'name' => 'ตัวบ่งชี้ที่ 1 คุณสมบัติของผู้บริหารสถาบันการศึกษาพยาบาล',
                'year' => 2026,
                'type' => 'คุณภาพ',
                'categorie_id' => 1,
                'code' => 'NCS-1',
                'description' => 'ผู้บริหารสถาบันการศึกษาพยาบาล หมายถึง คณบดี ผู้อำนวยการของสถาบันการศึกษาวิชาการพยาบาลและการผดุงครรภ์ หรือตำแหน่งอื่นที่เทียบเท่า ที่เป็นอาจารย์ประจำ 
                   ผู้บริหารสถาบันการศึกษาระดับรอง หมายถึง อาจารย์ประจำที่ดำรงตำแหน่งผู้บริหารระดับรอง เช่น รองคณบดี รองผู้อำนวยการ หัวหน้าภาควิชา หรือตำแหน่งอื่นที่เทียบเท่า ที่ทำหน้าที่ช่วยบริหารสถาบันการศึกษา ทั้งนี้ เป็นไปจามพระราชบัญญัติหรือข้อกำหนดของสถาบันอุดมศึกษานั้น',
                'condition' => ' ไม่มีข้อ 1 , 2 , 3 และ 4 (0 คะแนน) มีข้อ 1 , 2 , 3 และ 4 (5 คะแนน) มีครบทุกข้อ (10 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => 1,
                'comment' => 'ตัวบ่งชี้นี้จะประเมินคุณสมบัติของผู้บริหารสถาบันการศึกษาพยาบาลและการผดุงครรภ์ โดยพิจารณาจากการมีคุณสมบัติตามที่กำหนดไว้ในข้อ 1 ถึง 4', //ผู้ประเมินcomment
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
        
                   
            [
                // id-2
                'name' => 'ตัวบ่งชี้ที่ 2 อาจารย์ประจำที่มีคุณวุฒิปริญญาเอก',
                'categorie_id' => 2,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-2',
                'description' => 'อาจารย์ประจําคุณวุฒิปริญญาเอก หมายถึง อาจารย์พยาบาลประจําที่มีคุณวุฒิระดับปริญญาเอกทางการพยาบาล',
                'condition' => 'วิธีการคำนวณ ร้อยละของจำนวนอาจารย์ประจำที่มีวุฒิปริญญาเอก= จำนวนอาจารย์ประจำที่มีคุณวุฒิปริญญาเอก/จำนวนอาจารย์ประจำทั้งหมด*100',
                'annotation' => 'คะแนนที่ได้ไม่เกินคะแนนเต็ม 10 คะแนน',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินจำนวนอาจารย์ประจำที่มีคุณวุฒิปริญญาเอก โดยคำนวณจากร้อยละของจำนวนอาจารย์ประจำที่มีคุณวุฒิปริญญาเอกต่อจำนวนอาจารย์ประจำทั้งหมด',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-3
                'name' => 'ตัวบ่งชี้ที่ 3 คุณสมบัติอาจารย์ประจำ',
                'categorie_id' => 2,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-3',
                'description' => 'อาจารย์ประจํา หมายถึง บุคคลที่ดํารงตําแหน่ง อาจารย์ ผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ และศาสตราจารย์ ทั้งนี้ให้รวมถึงตําแหน่งที่เรียกชื่ออย่างอื่น ในสถาบันอุดมศึกษาที่เปิดสอนหลักสูตรพยาบาลศาสตรบัณฑิต ที่มีหน้าที่รับผิดชอบตามพันธกิจของการอุดมศึกษา และปฏิบัติหน้าที่เต็มเวลา มีคุณวุฒิระดับปริญญาโท สาขาพยาบาลศาสตร์หรือสาขาที่สัมพันธ์กันเป็นอย่างน้อย โดยต้องมีคุณวุฒิปริญญาตรีทางการพยาบาลและการผดุงครรภ์ มีใบอนุญาตเป็นผู้ประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ ชั้นหนึ่ง หรือใบอนุญาตเป็นผู้ประกอบวิชาชีพการพยาบาลชั้นหนึ่ง ที่ไม่หมดอายุ สําหรับอาจารย์ที่สอนด้านการพยาบาลมารดา-ทารกและการผดุงครรภ์จะต้องมีใบอนุญาตเป็นผู้ประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ ชั้นหนึ่ง และมีประสบการณ์กา
                   ปฏิบัติการพยาบาลมาแล้วไม่น้อยกว่า 2 ปี และมีประสบการณ์การสอนทางการพยาบาลในสถาบันการศึกษาพยาบาลมาแล้วไม่น้อยกว่า 1 ปี ทั้งนี้ถ้าสําเร็จการศึกษาสาขาอื่นที่ไม่ใช่สาขาพยาบาลศาสตร์และไม่มีตําแหน่งทางวิชาการสาขาการพยาบาล ต้องมีจํานวนรวมไม่เกินร้อยละ 15 ของจํานวนอาจารย์ประจําทั้งหมด
                   กรณีอาจารย์ประจําไม่มีประสบการณ์การสอนทางการพยาบาลในสถาบันการศึกษา ให้สถาบันการศึกษาจัดให้มีระบบอาจารย์พี่เลี้ยง ซึ่งเป็นอาจารย์ประจําหลักสูตรที่มีประสบการณ์การจัดการเรียนการสอนในสาขา วิชานั้นเป็นอาจารย์พี่เลี้ยง โดยให้มีระยะเวลาไม่น้อยกว่า 1 ภาคการศึกษา หรือให้มีการจัดอบรม หลักสูตรด้านการจัดการเรียนการสอนทางการพยาบาลอย่างเป็นระบบ
                   สําหรับอาจารย์ประจําที่สถาบันอุดมศึกษารับเข้าใหม่ ต้องมีคะแนนทดสอบความสามารถภาษาอังกฤษได้ตามเกณฑ์ที่กําหนดไว้ในประกาศคณะกรรมการการอุดมศึกษา เรื่อง มาตรฐานความสามารถภาษาอังกฤษของอาจารย์ประจํา หรือมีระบบพัฒนาคะแนนทดสอบความสามารถภาษาอังกฤษให้ได้ตามเกณฑ์ที่กําหนดฯ ภายในระยะเวลา 3 ปี
                    การนับระยะเวลาการปฏิบัติงานของอาจารย์ประจํา ต้องไม่น้อยกว่า 9 เดือนต่อปีการศึกษา คิดเป็น 1 คน ในกรณีปฏิบัติงาน 6 เดือนขึ้นไป แต่ไม่ถึง 9 เดือน คิดเป็น 0.5 คน
                     กรณีหลักสูตรร่วมผลิตกับหน่วยงานภายนอกที่ไม่ใช่สถาบันการศึกษา หากมีอาจารย์ประจําที่มาจากหน่วยงานภายนอกต้องสําเร็จการศึกษาระดับปริญญาโทตรงกับสาขาวิชาที่รับผิดชอบและมีประสบการณ์ในการปฏิบัติการให้การพยาบาลในสาขาวิชาที่รับผิดชอบอย่างต่อเนื่องไม่น้อยกว่า 6 ปี และต้องมีภาระงานในการจัดการเรียนการสอนไม่น้อยกว่า 12 ชั่วโมงต่อสัปดาห์ เป็นระยะเวลาต่อเนื่องอย่างน้อย 1 ภาคการศึกษา โดย 1 ภาคการศึกษา คิดเป็น 0.5 คน',
                'condition' => 'วิธีการคำนวณ ร้อยละของจำวนอาจารย์ประจำที่ได้ตามเก็ณฑ์ = จำนวนอาจารย์พยาบาลประจำที่มีคุณสมบัติตามเก็ณฑ์/จำนวนอาจารย์ประจำทั้งหมดของสถายบันรวมทุกคุณวุฒิการศึกษา*100',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินคุณสมบัติของอาจารย์ประจำ โดยพิจารณาจากคุณสมบัติตามที่กำหนดไว้ในข้อ 1 ถึง 4 และคำนวณร้อยละของจำนวนอาจารย์ประจำที่มีคุณสมบัติตามเกณฑ์ต่อจำนวนอาจารย์ประจำทั้งหมด',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-4
                'name' => 'ตัวบ่งชี้ที่ 4 จำนวนและคุณสมบัติของอาจารย์ผู้รับผิดชอบหลักสูตร',
                'categorie_id' => 3,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-4',
                'description' => 'อาจารย์ผู้รับผิดชอบหลักสูตร หมายถึง อาจารย์ประจําหลักสูตร จํานวนอย่างน้อย 5 คน ใน 5 สาขาหลักได้แก่ สาขาการพยาบาลผู้ใหญ่และหรือผู้สูงอายุ การพยาบาลเด็ก การพยาบาลจิตเวชและสุขภาพจิต การพยาบาลชุมชน และการพยาบาลมารดาและทารก หรือการผดุงครรภ์ เป็นอย่างน้อย ทั้งนี้ให้มีประสบการณ์การสอนทางการพยาบาลในสถาบันการศึกษาพยาบาลอย่างต่อเนื่องไม่น้อยกว่า 2 ปี
                 ในกรณีที่อาจารย์ผู้รับผิดชอบหลักสูตรสําเร็จปริญญาโทสาขาอื่นนอกจาก 5 สาขาหลัก ต้องมีประสบการณ์การสอนในสาขาที่รับผิดชอบในสถาบันการศึกษาพยาบาลและ การผดุงครรภ์อย่างต่อเนื่องไม่ น้อยกว่า 3 ปี
                 กรณีหลักสูตรร่วมผลิตกับหน่วยงานภายนอกที่ไม่ใช่สถาบันการศึกษาหากจําเป็นมีอาจารย์ผู้รับผิดชอบหลักสูตรที่มาจากหน่วยงานภายนอกนั้นได้ไม่เกิน 2 คน โดยต้องสําเร็จการศึกษาระดับปริญญาโทตรงกับสาขาวิชาที่รับผิดชอบและมีประสบการณ์ในการปฏิบัติการให้การพยาบาลในสาขาวิชาที่รับผิดชอบอย่างต่อเนื่องไม่น้อยกว่า 6 ปี และมีผลงานวิชาการเช่นเดียวกับอาจารย์ประจําหลักสูตร และต้องมีภาระงานในการจัดการเรียนการสอนไม่น้อยกว่า 12 ชั่วโมงต่อสัปดาห์ เป็นระยะเวลาต่อเนื่องตลอด 1 ปีการศึกษา',
                'condition' => 'ไม่เป็นไปตามเกณฑ์มาตรฐาน (0 คะแนน)เป็นไปตามเกณฑ์มาตรฐาน (5 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินจำนวนและคุณสมบัติของอาจารย์ผู้รับผิดชอบหลักสูตร โดยพิจารณาจากจำนวนอาจารย์ผู้รับผิดชอบหลักสูตรที่มีคุณสมบัติตามเกณฑ์ที่กำหนดไว้',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-5
                'name' => 'ตัวบ่งชี้ที่ 5 สัดส่วนอาจารย์ประจำหลักสูตรต่ออาจารย์ประจำทั้งหมด',
                'categorie_id' => 3,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-5',
                'description' => ' อาจารย์ประจําหลักสูตร หมายถึง อาจารย์พยาบาลประจําที่มีผลงานทางวิชาการที่ไม่ใช่ส่วนหนึ่งของการศึกษาเพื่อรับปริญญา และเป็นผลงานทางวิชาการที่ได้รับการเผยแพร่ตามหลักเกณฑ์ที่กําหนดในการพิจารณาแต่งตั้งให้บุคคลดํารงตําแหน่งทางวิชาการอย่างน้อย 1 รายการ ในรอบ 5 ปีย้อนหลัง (หากเป็นผลงานวิชาการที่เผยแพร่หลัง 24 มิถุนายน 2565 เป็นต้นไป ต้องเป็นชื่อแรกหรือผู้ประพันธ์บรรณกิจเท่านั้น)
                  การนับระยะเวลาการปฏิบัติงานของอาจารย์ประจําหลักสูตร ต้องไม่น้อยกว่า 9 เดือนต่อปีการศึกษา คิดเป็น 1 คน ในกรณีปฏิบัติงาน 6 เดือนขึ้นไป แต่ไม่ถึง 9 เดือน คิดเป็น 0.5 คน
                 กรณีหลักสูตรร่วมผลิตกับหน่วยงานภายนอกที่ไม่ใช่สถาบันการศึกษาหากจําเป็นมีอาจารย์ประจําหลักสูตรที่มาจากหน่วยงานภายนอกนั้นได้ต้องสําเร็จการศึกษาระดับปริญญาโทตรงกับสาขาวิชาที่รับผิดชอบและมีประสบการณ์ในการปฏิบัติการให้การพยาบาลในสาขาวิชาที่รับผิดชอบอย่างต่อเนื่องไม่น้อยกว่า 6 ปี และต้องมีภาระงานในการจัดการเรียนการสอนไม่น้อยกว่า 12 ชั่วโมงต่อสัปดาห์ เป็นระยะเวลาต่อเนื่องอย่างน้อย 1 ภาคการศึกษา คิดเป็น 0.5 คน โดยมีจํานวนไม่มากกว่าร้อยละ 20 ของอาจารย์ประจําหลักสูตรทั้งหมด',
                'condition' => 'ร้อยละของอาจารย์ประจำหลักสูตร = จำนวนอาจารย์ประจำหลักสูตร/จำนวนอาจารย์ประจำทั้งหมด*100 และคะแนนที่ได้ = ร้อยละของอาจารย์ประจำหลักสูตร/100*15',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินสัดส่วนของอาจารย์ประจำหลักสูตรต่ออาจารย์ประจำทั้งหมด โดยคำนวณจากร้อยละของจำนวนอาจารย์ประจำหลักสูตรต่อจำนวนอาจารย์ประจำทั้งหมด',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-6
                'name' => 'ตัวบ่งชี้ที่ 6 อัตราส่วนจำนวนอาจารย์ประจำต่อนิสิต/นักศึกษาเต็มเวลาเทียบเท่า',
                'categorie_id' => 3,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-6',
                'description' => 'นิสิต/นักศึกษาเต็มเวลาเทียบเท่า (Full Time Equivalent Student : FTES) หมายถึง นิสิต/นักศึกษา ที่ลงทะเบียนเรียนตามเกณฑ์จํานวนหน่วยกิตมาตรฐานของการลงทะเบียน ดังนี
              ระบบทวิภาค   -   สําหรับนิสิต/นักศึกษาปริญญาตรี : ลงทะเบียน 36 หน่วยกิตต่อปีการศึกษา 
                                           (18 หน่วยกิต ต่อภาคการศึกษา)
                                      -   สําหรับนิสิต/นักศึกษาระดับบัณฑิตศึกษาทั้งโครงการปกติและโครงการภาคพิเศษ ลงทะเบียน 24 หน่วยกิต ต่อปีการศึกษา 
                                           (12 หน่วยกิตต่อภาคการศึกษาปกติ)
               ระบบไตรภาค -   สําหรับนิสิต/นักศึกษาปริญญาตรี : ลงทะเบียน 45 หน่วยกิตต่อปีการศึกษา
                                           (15 หน่วยกิตต่อภาคการศึกษา)
                                      -   สําหรับนิสิต/นักศึกษาระดับบัณฑิตศึกษาทั้งโครงการปกติและโครงการภาคพิเศษ ลงทะเบียน 30 หน่วยกิต ต่อปีการศึกษา 
             (10 หน่วยกิตต่อภาคการศึกษาปกติ)',
                'condition' => '1. คำนวณค่า SCH (Student Credit Hours):
                𝑆𝐶𝐻=Σ(𝑛𝑖×𝑐𝑖)SCH=Σ(n i×c i)
                nᵢ = จำนวนนักศึกษาที่ลงทะเบียนในวิชา i
                cᵢ = จำนวนหน่วยกิตของวิชา i
                2. คำนวณค่า FTES (Full-Time Equivalent Student):
                𝐹𝑇𝐸𝑆 = 𝑆𝐶𝐻/หน่วยกิตตามเกณฑ์มาตรฐาน(เช่น15หรือ36แล้วแต่ระดับ)
                FTES=SCH/หน่วยกิตตามเกณฑ์มาตรฐาน(เช่น15หรือ36แล้วแต่ระดับ)
                เกณฑ์การให้คะแนน
                 ≥1:9 (0 คะแนน)
                     1:8 (5 คะแนน)
                1:7 (10 คะแนน)
                 1:6 (15 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินอัตราส่วนของจำนวนอาจารย์ประจำต่อนิสิต/นักศึกษาเต็มเวลาเทียบเท่า โดยคำนวณจากค่า SCH (Student Credit Hours) และ FTES (Full-Time Equivalent Student) ตามเกณฑ์ที่กำหนด',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-7
                'name' => 'ตัวบ่งชี้ที่ 7 อัตราส่วนจำนวนอาจารย์ประจำหรือพยาบาลวิชาชีพ ที่ทำหน้าหน้าที่สอนภาคปฏิบัติต่อนิสิต/นักศึกษา',
                'categorie_id' => 3,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-7',
                'description' => ' อัตราส่วนจํานวนอาจารย์ประจําหรือพยาบาลวิชาชีพ ที่ทําหน้าที่สอนภาคปฏิบัติต่อนิสิต/นักศึกษา หมายถึง อัตราส่วนอาจารย์ประจําหรือพยาบาลวิชาชีพต่อนิสิต/นักศึกษา ในแต่ละแหล่งฝึกภาคปฏิบัติในทุกรายวิชาทั้งในโรงพยาบาลและในชุมชน
                 อาจารย์ประจํา หมายถึง อาจารย์พยาบาลที่มีคุณสมบัติครบตามข้อบังคับสภาการพยาบาลว่าด้วยการรับรองสถาบันฯ ฉบับล่าสุด
                 พยาบาลวิชาชีพที่ทําหน้าที่ผู้สอนภาคปฏิบัติ หมายถึง พยาบาลวิชาชีพที่ได้รับมอบหมายให้สอนภาคปฏิบัติที่มีคุณสมบัติ ดังนี้
                 1) มีใบอนุญาตประกอบวิชาชีพการพยาบาลชั้นหนึ่ง ในกรณีที่สอนภาคปฏิบัติวิชาการพยาบาลมารดาทารกและการผดุงครรภ์ต้องมีใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ชั้นหนึ่ง
                 2) มีวุฒิการศึกษาและประสบการณ์ ดังนี้
                               2.1) ปริญญาโท/ปริญญาเอกทางการพยาบาลหรือวิทยาศาสตร์สุขภาพ และมีประสบการณ์การปฏิบัติการพยาบาลในสาขาที่สอน ไม่น้อยกว่า 1 ปี
                               2.2) ปริญญาโท/ปริญญาเอกสาขาอื่น และมีประสบการณ์การปฏิบัติการพยาบาลในสาขาที่สอนไม่น้อยกว่า 2 ปี
                               2.3) ปริญญาตรีหรือประกาศนียบัตรพยาบาลศาสตรบัณฑิตและมีประสบการณ์การปฏิบัติการพยาบาล ไม่น้อยกว่า 3 ปี
                 3) เป็นพยาบาลวิชาชีพที่อาจปฏิบัติงานหรือไม่ปฏิบัติงานประจําในขณะสอนภาคปฏิบัติ
                 4) ผ่านการอบรมหลักสูตรด้านการจัดการเรียนการสอนทางการพยาบาล หรือหลักสูตรการฝึกอบรม เพื่อพัฒนาศักยภาพด้านการสอนสําหรับพยาบาลพี่เลี้ยงที่สภาการพยาบาลให้การรับรอง',
                'condition' => 'ร้อยละของรายวิชาที่มีอาจารย์พยาบาลประจำต่อนักศึกษาไม่เกิน1:8 = จำนวนรายวิชาที่มีอาจารย์พยาบาลประจำ|พยาบาลวิชาชีพสอนภาคปฏิบัติไม่เกิน1:8/จำนวนรายวิชาภาคปฏิบัติที่เปิดสอนในปีการศึกษาทีครบวาระการรับรองสถาบัน
                 อัตราส่วนจํานวนอาจารย์ประจําหรือพยาบาลวิชาชีพ ที่ทําหน้าที่สอนภาคปฏิบัติต่อนิสิต/นักศึกษาในรายวิชาภาคปฏิบัติทางการพยาบาลเป็นไปตามเกณฑ์การพิจารณา ข้อ 1 และ 2
                น้อยกว่าร้อยละ 80 ของรายวิชาทั้งหมด (0 คะแนน)
                ร้อยละ 80 – 89 ของรายวิชาทั้งหมด (5 คะแนน)
                ร้อยละ 90 – 99 ของรายวิชาทั้งหมด (10 คะแนน)
                ร้อยละ 100 ของรายวิชาทั้งหมด (15 คะแนน',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินอัตราส่วนของจำนวนอาจารย์ประจำหรือพยาบาลวิชาชีพที่ทำหน้าที่สอนภาคปฏิบัติต่อนิสิต/นักศึกษา โดยคำนวณจากร้อยละของรายวิชาที่มีอาจารย์พยาบาลประจำต่อนักศึกษาไม่เกิน 1:8 ต่อจำนวนรายวิชาภาคปฏิบัติที่เปิดสอนในปีการศึกษาที่ครบวาระการรับรองสถาบัน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            // id-8
            [
                'name' => 'ตัวบ่งชี้ที่ 8 สภาพแวดล้อมของสถาบันการศึกษา',
                'categorie_id' => 3,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-8',
                'description' => 'สภาพแวดล้อมสถานศึกษา หมายถึง อาคารสถานที่ ทําเลที่ตั้งและระบบสาธารณูปโภค อุปกรณ์และระบบการรักษาความปลอดภัย ระบบป้องกันอัคคีภัย โครงสร้างพื้นฐานทางเทคโนโลยีสารสนเทศ รวมถึงอุปกรณ์และสิ่งอํานวยความสะดวก',
                'condition' => 'มีน้อยกว่า 3 ข้อ (0 คะแนน)
                    มี 3 - 4 ข้อ (6 คะแนน)
                    มี 5 ข้อ (9 คะแนน)
                    มี 6 ข้อ (12 คะแนน)
                    มีครบทุกข้อ (15 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินสภาพแวดล้อมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น อาคารสถานที่ ทําเลที่ตั้ง ระบบสาธารณูปโภค อุปกรณ์และระบบการรักษาความปลอดภัย ระบบป้องกันอัคคีภัย และโครงสร้างพื้นฐานทางเทคโนโลยีสารสนเทศ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-9
                'name' => 'ตัวบ่งชี้ที่ 9 ทรัพยากรด้านเทคโนโลยีสารสนเทศ',
                'categorie_id' => 3,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-9',
                'description' => 'ระบบสารสนเทศเพื่อการบริหารและการตัดสินใจ หมายถึง ระบบสารสนเทศอิเล็กทรอนิกส์ที่เป็นปัจจุบัน ที่ผู้บริหารนำไปใช้ในการบริหารงานและการประกันคุณภาพการศึกษาประกอบด้วยข้อมูลนำเข้า การประมวลผล และผลลัพธ์
                1. มีระบบสารสนเทศเพื่อการตัดสินใจด้านการบริหาร หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารสามารถนำมาพิจารณาในการตัดสินใจได้ ประกอบด้วย
                ระบบสารสนเทศด้านการเงิน การงบประมาณ ที่แสดงถึงการนำข้อมูลมาวิเคราะห์ด้วยค่าสถิติเชิงพรรณา เช่น ร้อยละ ค่าเฉลี่ยของงบประมาณที่ได้รับและรายจ่ายในแต่ละปีงบประมาณ
                ระบบสารสนเทศบริหารงานบุคคล ที่แสดงถึงร้อยละของบุคลากรที่หน่วยงานมีอยู่ จำแนกตามวุฒิการศึกษา อายุ เพศ ระดับตำแหน่ง ตำแหน่งทางวิชาการ การลาศึกษาต่อ การลาฝึกอบรม ภาระงานของอาจารย์และบุคลากร
                ระบบสารสนเทศด้านครุภัณฑ์ ที่แสดงถึงจำนวนครุภัณฑ์ที่จำเป็นในการจัดการเรียนการสอนที่หน่วยงานมีอยู่ เช่น การเปรียบเทียบการเพิ่มขึ้น ลดลงในแต่ละปี รายละเอียดที่สามารถทราบถึงวันเวลา การซื้อ การซ่อม การจำหน่าย การยืม การคืน เพื่อการตัดสินใจในการจัดหาครุภัณฑ์
          	    2. มีระบบสารสนเทศเพื่อการตัดสินใจด้านการเรียนการสอน หมายถึง การจัดการข้อมูลเพื่อให้เป้นสารสนเทศในการตัดสินใจด้านการเรียนการสอนของหน่วยงาน เช่น การแสดงตารางสอน ในแต่ละชั้นปี การเปรียบเทียบจำนวนนิสิต/นักศึกษาแรกเข้าในแต่ละปี การเปรียบเทียบจำนวนผู้สำเร็จการศึกษาและนิสิต/นักศึกษาแรกเข้าในแต่ละรุ่น แต่ละปี หลักสูตรที่เปิดสอน จำนวนรายวิชาที่สอนในแต่ละปีการศึกษา ภาระงานของอาจารย์ผู้สอนในแต่ละภาคการศึกษา เป็นต้น
      		    3. มีระบบสารสนเทศเพื่อการตัดสินใจด้านการวิจัย หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารสามารถนำมาพิจารณาในการตัดสินใจด้านการวิจัยของหน่วยงาน เช่น จำนวน/ร้อยละของงานวิจัยเปรียบเทียบงงานบริการวิชาการของอาจารย์ในแต่ละปี  จำนวนทุนที่ได้รับการสนับสนุนจากภายใน/ภายนอกหน่วยงาน เรื่องที่ทำการวิจัยในแต่ละสาขาวิชา จำนวน/ร้อยละของงานวิจัยที่ตีพิมพ์ในแต่ละปี บทคัดย่อที่ผู้สนใจสามารถเข้าถึงได้
      		    4. มีระบบสารสนเทศเพื่อการตัดสินใจด้านการบริการวิชาการ หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารสามารถนำมาพิจารณาในการตัดสินใจด้านการบริการวิชาการของหน่วยงาน เช่น จำนวน/ร้อยละ การเปรียบเทียบงานบริการวิชาการของอาจารย์ในแต่ละปี จำนวนงบประมาณที่ได้รับการสนับสนุนจากภายใน/ภายนอกหน่วยงาน จำนวนอาจารย์ที่ให้บริการวิชาการแก่สังคม หลักสูตร/โครงการ/กิจกรรมที่ให้บริการในแต่ละปี
                 5. มีระบบสารสนเทศเพื่อการตัดสินใจ ด้านการทำนุบำรุงศิลปะและวัฒนธรรม หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารสามารถนำมาพิจารณาในการตัดสินใจด้านการทำนุบำรุงศิลปะและวัฒนธรรมของหน่วยงาน เช่น จำนวนโครงการ/กิจกรรมด้านศิลปวัฒนธรรมของอาจารย์และนิสิต/นักศึกษาในแต่ละปี จำนวนงบประมาณที่ได้รับการสนับสนุนจากภายใน/ภายนอกหน่วยงาน จำนวนอาจารย์ที่เข้าร่วมในโครงการทำนุบำรุงศิลปะและวัฒนธรรม',
                'condition' => 'มี 1 ระบบ (2 คะแนน)
                    มี 2 ระบบ (4 คะแนน)
                    มี 3 ระบบ (6 คะแนน)
                    มี 4 ระบบ (8 คะแนน)
                    มีครบทุกระบบ (10 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินทรัพยากรด้านเทคโนโลยีสารสนเทศของสถาบันการศึกษา โดยพิจารณาจากจำนวนระบบสารสนเทศที่มีอยู่ในแต่ละด้าน เช่น ระบบสารสนเทศเพื่อการบริหารและการตัดสินใจ ระบบสารสนเทศเพื่อการเรียนการสอน ระบบสารสนเทศเพื่อการวิจัย ระบบสารสนเทศเพื่อการบริการวิชาการ และระบบสารสนเทศเพื่อการทำนุบำรุงศิลปะและวัฒนธรรม',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-10
                'name' => 'ตัวบ่งชี้ที่ 10 ศูนย์การเรียนรู้การปฏิบัติการพยาบาลและห้องปฏิบัติการเสมือนจริง',
                'categorie_id' => 3,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-10',
                'description' => 'ศูนย์การเรียนรู้การปฏิบัติการพยาบาล ประกอบด้วย
                1. ห้องฝึกปฏิบัติการพยาบาลให้นักศึกษาฝึกปฏิบัติหัตถการทางการพยาบาล มีหุ่นจำลองผู้ป่วย อุปกรณ์ในการฝึกปฏิบัติ ทันสมัย พร้อมใช้และเพียงพอ
                2. ห้องปฏิบัติการพยาบาลเสมือนจริงให้นักศึกษาฝึกฝนทักษะการปฏิบัติการพยาบาล การแก้ไขปัญหาและการตัดสินใจทางคลินิก โดยใช้สถานการณ์เสมือนจริงทางการพยาบาล (Scenario) หุ่นจำลองผู้ป่วยเสมือนจริง (Patient Simulator) และผู้ป่วยเสมือนจริง (Standardized Patient) ที่สอดคล้องกับสถานการณ์ในแต่ละรายวิชา ที่ครอบคลุม 5 สาขาวิชาหลัก เพื่อให้ผู้เรียนเกิดผลลัพธ์การเรียนรู้ตามที่หลักสูตรกำหนด
                 3. อุปกรณ์/เครื่องมือทางการแพทย์ หมายถึง อุปกรณ์ทางการวินิจฉัยและการรักษาพยาบาลที่จำเป็นต่อชีวิตและความปลอดภัยของผู้ป่วย เพื่อใช้ในการเตรียมความพร้อมให้แก่นักศึกษาก่อนการฝึกปฏิบัติกับผู้ป่วย ได้แก่ เครื่องช่วยหายใจ เครื่องควบคุมการให้สารน้ำทางหลอดเลือดดำ เครื่องตรวจคลื่นไฟฟ้าหัวใจ ทั้งนี้เป็นอุปกรณ์ในศูนย์การเรียนรู้การปฏิบัติการพยาบาลหรือสถานบริการสุขภาพ',
                'condition' => 'ไม่มีหลักฐาน (0)
                มีข้อ 1 (5)
                มีข้อ 1 และ 2 (10)
                มีข้อ 1 , 2 และ 3 (20)
                มีข้อ 1 , 2 , 3 และ 4 (30)
                มีครบทุกข้อ (50)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินศูนย์การเรียนรู้การปฏิบัติการพยาบาลและห้องปฏิบัติการเสมือนจริง โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น ห้องฝึกปฏิบัติการพยาบาล ห้องปฏิบัติการพยาบาลเสมือนจริง และอุปกรณ์/เครื่องมือทางการแพทย์',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 50.00,
            ],
            [
                // id-11
                'name' => 'ตัวบ่งชี้ที่ 11 หนังสือ ตำรา วารสาร ฐานข้อมูล',
                'categorie_id' => 3,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-11',
                'description' => '  หนังสือ/ ตำราหลัก หมายถึง หนังสือ/ตำรา ทางการพยาบาลทั้งภาษาไทยและภาษาต่างประเทศที่ครอบคลุมเนื้อหาสาระหลักในแต่ละสาขาวิชา 
                หนังสือ ตำรา วารสาร หมายถึง หนังสือ ตำรา วารสาร ที่มีองค์ความรู้หรือแนวคิดทางการพยาบาลรวมทั้งพื้นฐานวิชาชีพ และวิทยาศาสตร์สุขภาพ ที่ตีพิมพ์เผยแพร่ไม่เกิน 10 ปี โดยสถาบันอาจจัดหาในรูปแบบเล่มเอกสาร หรือ หนังสืออิเล็กทรอนิกส์ (e-book) 
                 ฐานข้อมูลอีเล็กทรอนิกส์ ประกอบด้วยฐานข้อมูลวารสารทางการพยาบาลต่างประเทศ เป็นฐานข้อมูลที่รวบรวมวารสารที่มีคุณภาพมาตรฐานทางวิชาการ ซึ่งผู้ใช้สามารถสืบค้นวารสารทางการพยาบาลฉบับเต็มได้ เช่น CINAHL Complete , Medline , Science Direct 
                 ฐานข้อมูลหนังสือ/ตำราทางการพยาบาล (eBook Nursing Collection) เป็นฐานข้อมูลที่รวบรวมหนังสืออิเล็กทรอนิกส์ทางการพยาบาลทั้งภาษาไทยและภาษาอังกฤษ',
                'condition' => 'ไม่มีข้อ 1 (0)
                    มีข้อ 1 (5)
                    มีข้อ 1 และ 2 (10)
                    มีข้อ 1 , 2 และ 3 (15)
                    มีข้อ 1 , 2 , 3 และ 4 (20)
                    มีครบทุกข้อ (25)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินหนังสือ ตำรา วารสาร และฐานข้อมูลของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น หนังสือ/ตำราหลัก หนังสือ ตำรา วารสาร และฐานข้อมูลอีเล็กทรอนิกส์',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 25.00,
            ],
            [
                // id-12
                'name' => 'ตัวบ่งชี้ที่ 12 โครงสร้างการบริหารจัดการงานวิจัยและนวัตกรรม',
                'categorie_id' => 4,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-12',
                'description' => '',
                'condition' => 'ไม่มีหลักฐาน (0)
                    มีข้อ 1 (1)
                    มีข้อ 1 และ 2 (2)
                    มีข้อ 1 , 2 และ 3 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินโครงสร้างการบริหารจัดการงานวิจัยและนวัตกรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น โครงสร้างการบริหารจัดการงานวิจัยและนวัตกรรม การสนับสนุนงานวิจัยและนวัตกรรม และการเผยแพร่ผลงานวิจัยและนวัตกรรม',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-13
                'name' => 'ตัวบ่งชี้ที่ 13 โครงสร้างการบริหารจัดการงานบริการวิชาการ/วิชาชีพ/สังคม',
                'categorie_id' => 5,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-13',
                'description' => '',
                'condition' => 'ไม่มีหลักฐาน (0)
                    มีข้อ 1 (1)
                    มีข้อ 1 และ 2 (2)
                    มีข้อ 1 , 2 และ 3 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินโครงสร้างการบริหารจัดการงานบริการวิชาการ/วิชาชีพ/สังคมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น โครงสร้างการบริหารจัดการงานบริการวิชาการ การสนับสนุนงานบริการวิชาการ และการเผยแพร่ผลงานบริการวิชาการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-14
                'name' => 'ตัวบ่งชี้ที่ 14 โครงสร้างการบริหารจัดการงานทำนุบำรุงศิลปวัฒนธรรม',
                'categorie_id' => 6,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-14',
                'description' => '',
                'condition' => 'ไม่มีหลักฐาน (0)
                    มีข้อ 1 (1)
                    มีข้อ 1 และ 2 (2)
                    มีข้อ 1 , 2 และ 3 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินโครงสร้างการบริหารจัดการงานบริการวิชาการ/วิชาชีพ/สังคมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น โครงสร้างการบริหารจัดการงานบริการวิชาการ การสนับสนุนงานบริการวิชาการ และการเผยแพร่ผลงานบริการวิชาการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-15
                'name' => 'ตัวบ่งชี้ที่ 15  โครงสร้างการบริหารจัดการงานพัฒนานิสิต/นักศึกษา/ศิษย์เก่า',
                'categorie_id' => 7,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCS-15',
                'description' => '',
                'condition' => 'ไม่มีหลักฐาน (0)
                    มีข้อ 1 (1)
                    มีข้อ 1 และ 2 (2)
                    มีข้อ 1 , 2 และ 3 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินโครงสร้างการบริหารจัดการงานพัฒนานิสิต/นักศึกษา/ศิษย์เก่าของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น โครงสร้างการบริหารจัดการงานพัฒนานิสิต/นักศึกษา การสนับสนุนงานพัฒนานิสิต/นักศึกษา และการเผยแพร่ผลงานพัฒนานิสิต/นักศึกษา',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            //กระบวนการ
            [
                // id-16
                'name' => 'ตัวบ่งชี้ที่ 1 การนำองค์กร',
                'categorie_id' => 8,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-1',
                'description' => 'การถ่ายทอด/สื่อสารวิสัยทัศน์หมายถึง กระบวนการนำข้อมูลเกี่ยวกับวิสัยทัศน์ พันธกิจ ให้บุคลากร นิสิต/นักศึกษารับรู้อย่างทั่วถึง เช่น การใช้ช่องทางออนไลน์ การประชุมชี้แจง การติดประกาศ เป็นต้น เมื่อครบ วงรอบการดำเนินงาน มีการประเมินความพึงพอใจของกระบวนการถ่ายทอด/ สื่อสารวิสัยทัศน์ พันธกิจ และ ประเมินผลการรับรู้วิสัยทัศน์ พันธกิจ ของบุคลากรและนิสิต/นักศึกษา',
                'condition' => 'ไม่มีหลักฐานการดำเนินการทั้ง 4 ข้อ (0)  
                    มีการดำเนินงานข้อ 1 (2)  
                    มีการดำเนินงานข้อ 1 และ 2 (5)  
                    มีการดำเนินงานข้อ 1 ถึง 3 (10)  
                    มีครบทุกข้อ (15) ',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการนำองค์กรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การถ่ายทอด/สื่อสารวิสัยทัศน์ พันธกิจ การกำหนดเป้าหมาย และการประเมินผลการรับรู้ของบุคลากรและนิสิต/นักศึกษา',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-17
                'name' => 'ตัวบ่งชี้ที่ 2 ยุทธศาสตร์ ',
                'categorie_id' => 8,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-2',
                'description' => 'แผนกลยุทธ์/ยุทธศาสตร์ หมายถึง แผนที่กำหนดทิศทางการพัฒนาคณะ/สถาบันระยะยาวตั้งแต่ 3 ปีขึ้นไป ประกอบด้วย วิสัยทัศน์ พันธกิจ วัตถุประสงค์ โครงการ ครอบคลุมทุกพันธกิจของสถาบัน มีการกำหนดตัวบ่งชี้ ความสำเร็จของแต่ละกลยุทธ์ และค่าเป้าหมายของตัวบ่งชี้ เพื่อวัดความสำเร็จของการดำเนินการตามกลยุทธ์
                      แผนปฏิบัติงานประจำปี หมายถึง แผนระยะสั้นที่มีระยะเวลาดำเนินการภายใน 1 ปี เป็นแผนที่ถ่ายทอด แผนกลยุทธ์/ยุทธศาสตร์ ลงสู่การปฏิบัติ เพื่อให้เกิดการดำเนินงานจริง ประกอบด้วย โครงการหรือกิจกรรมต่าง ๆ ที่ จะต้องดำเนินการในปีนั้น ๆ เพื่อให้บรรลุเป้าหมายตัวบ่งชี้ความสำเร็จของแผนกลยุทธ์/ ยุทธศาสตร์ และกำหนดค่า เป้าหมายของโครงการที่สอดคล้องกับตัวบ่งชี้ รวมทั้งระบุผู้รับผิดชอบโครงการ/กิจกรรม งบประมาณ ทรัพยากรที่ ต้องใช้ในการดำเนินการ และเมื่อดำเนินงานแล้ว มีผลการดำเนินงานตามแผนปฏิบัติปฏิบัติการ 
                       แผนการจัดสรรงบประมาณ หมายถึง แผนการจัดสรรงบประมาณทุกประเภทเป็นรายปีที่สอดคล้องกับ วิสัยทัศน์ และกลยุทธ์/ ยุทธศาสตร์ มีการวิเคราะห์ การประเมินการใช้งบประมาณตามพันธกิจ เมื่อดำเนินการแล้วมี การประเมินแผนการจัดการสรรงบประมาณ 
                       การถ่ายทอดกลยุทธ์/ ยุทธศาสตร์ หมายถึง กระบวนการนำข้อมูลเกี่ยวกับ กลยุทธ์/ ยุทธศาสตร์ ให้ บุคลากรรับรู้ เช่น การใช้ช่องทางออนไลน์ การประชุมชี้แจงแลกเปลี่ยน การติดประกาศ เป็นต้น เมื่อครบวงรอบการ ดำเนินงานมีการประเมินความพึงพอใจของช่องทางที่ใช้ในการถ่ายทอด/สื่อสาร กลยุทธ์/ยุทธศาสตร์ และการ ประเมินผลการรับรู้ของบุคลากรต่อกลยุทธ์/ยุทธศาสตร์ ที่ได้รับการถ่ายทอด ',
                'condition' => 'ไม่มีหลักฐานการดำเนินการทั้ง 4 ข้อ (0)  
                    มีการดำเนินงานข้อ 1 (2)  
                    มีการดำเนินงานข้อ 1 และ 2 (5)  
                    มีการดำเนินงานข้อ 1 ถึง 3 (10)  
                    มีครบทุกข้อ (15)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินยุทธศาสตร์ของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น แผนกลยุทธ์/ยุทธศาสตร์ แผนปฏิบัติงานประจำปี แผนการจัดสรรงบประมาณ และการถ่ายทอดกลยุทธ์/ยุทธศาสตร์',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-18
                'name' => 'ตัวบ่งชี้ที่ 3 การประพฤติตามกฎหมายและจริยธรรม ',
                'categorie_id' => 8,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-3',
                'description' => 'การประพฤติตามกฎหมายและจริยธรรม หมายถึง กระบวนการที่สถาบันดำเนินการตามมาตรฐาน ข้อกำหนด กฏหมาย ระเบียบ ข้อบังคับ และหลักธรรมาภิบาลของการบริหารกิจการบ้านเมืองที่ดีหรือการ ดำเนินการตามหลักคุณธรรมและความโปร่งใสของการดำเนินงาน และการจัดการข้อร้องเรียน อุทธรณ์ ร้องทุกข์ 
                 หลักธรรมาภิบาล หมายถึง การปกครอง การบริหาร การจัดการ การควบคุม ดูแลกิจการต่าง ๆ ให้ เป็นไปในครรลองธรรม โดยยึดตามหลักธรรมาภิบาลของการบริหารกิจการบ้านเมืองที่ดี (Good Governance) 10 ประการ ที่เหมาะสมจะนำมาปรับใช้ในหน่วยงานมี 10 ประการ ดังนี้
                  1. หลักประสิทธิผล (Effectiveness) คือ ผลการปฏิบัติราชการที่บรรลุวัตถุประสงค์และเป้าหมายของ แผนการปฏิบัติราชการตามที่ได้รับงบประมาณมาดำเนินการ รวมถึงสามารถ เทียบเคียงกับส่วนราชการหรือ หน่วยงานที่มีภารกิจคล้ายคลึงกันและมีผลการปฏิบัติงานใน ระดับชั้นนำของประเทศเพื่อให้เกิดประโยชน์สุขต่อ ประชาชนโดยการปฏิบัติราชการ จะต้องมีทิศทางยุทธศาสตร์และเป้าประสงค์ที่ชัดเจนมีกระบวนการปฏิบัติงานและ ระบบงานที่เป็นมาตรฐานรวมถึงมีการติดตามประเมินผลและพัฒนาปรับปรุงอย่างต่อเนื่อง และเป็นระบบ 
                   2. หลักประสิทธิภาพ (Efficiency) คือ การบริหารราชการตามแนวทางการกำกับดูแลที่ดีที่ มีการออกแบบกระบวนการปฏิบัติงานโดยใช้เทคนิคและเครื่องมือการบริหารจัดการที่ เหมาะสมให้องค์การสามารถ ใช้ทรัพยากรทั้งด้านต้นทุน แรงงานและระยะเวลาให้เกิดประโยชน์สูงสุดต่อการพัฒนาขีดความสามารถในการปฏิบัติ ราชการตามภารกิจเพื่อตอบสนองความต้องการของประชาชนและผู้มีส่วนได้ส่วนเสียทุกกลุ่ม 
                   3. หลักการตอบสนอง (Responsiveness) คือ การให้บริการที่สามารถดำเนินการได้ภายในระยะเวลา ที่กำหนด และสร้างความเชื่อมั่น ความไว้วางใจ รวมถึงตอบสนองความคาดหวัง หรือความต้องการของประชาชน ผู้รับบริการ และผู้มีส่วนได้ส่วนเสียที่มีความหลากหลาย และมีความแตกต่าง 
                   4. หลักภาระรับผิดชอบ (Accountability) คือ การแสดงความรับผิดชอบในการปฏิบัติหน้าที่และผลงาน ต่อเป้าหมายที่กำหนดไว้ โดยความรับผิดชอบนั้นควรอยู่ในระดับที่สนองต่อความคาดหวังของสาธารณะ รวมทั้งการ แสดงถึงความสำนึกในการรับผิดชอบต่อปัญหาสาธารณะ 
                   5. หลักความโปร่งใส (Transparency) คือ กระบวนการเปิดเผยอย่างตรงไปตรงมาชี้แจงได้เมื่อมี ข้อสงสัยและสามารถเข้าถึงข้อมูลข่าวสารอันไม่ต้องห้ามตามกฎหมายได้อย่างเสรีโดยประชาชนสามารถรู้ทุกขั้นตอน ในการดำเนินกิจกรรมหรือกระบวนการต่างๆ และ สามารถตรวจสอบได้ 
                   6. หลักการมีส่วนร่วม (Participation) คือ กระบวนการที่ข้าราชการ ประชาชน และผู้มีส่วนได้เสีย ทุกกลุ่มมีโอกาสได้เข้าร่วมในการรับรู้เรียนรู้ ทำความเข้าใจ ร่วมแสดงทัศนะ ร่วมเสนอปัญหาหรือ ประเด็นที่สำคัญ ที่เกี่ยวข้อง ร่วมคิดแนวทาง ร่วมการแก้ไขปัญหา ร่วมในกระบวนการตัดสินใจ และร่วมกระบวนการพัฒนาในฐานะ หุ้นส่วนการพัฒนา 
                   7. หลักการกระจายอำนาจ (Decentralization) คือ การถ่ายโอนอำนาจการตัดสินใจ ทรัพยากร และ ภารกิจจากส่วนราชการส่วนกลางให้แก่หน่วยการปกครองอื่นๆ (ราชการ บริหารส่วนท้องถิ่น) และภาคประชาชน ดำเนินการแทนโดยมีอิสระตามสมควรรวมถึงการ มอบอำนาจและความรับผิดชอบในการตัดสินใจและการดำเนินการให้แก่บุคลากร โดย มุ่งเน้นการสร้างความพึงพอใจในการให้บริการต่อผู้รับบริการและผู้มีส่วนได้เสียการ ปรับปรุงกระบวนการ และเพิ่มผลิตภาพเพื่อผลการดำเนินงานที่ดีของส่วนราชการ 
                  8. หลักนิติธรรม (Rule of Law) คือ การใช้อำนาจของกฎหมาย กฎระเบียบข้อบังคับในการบริหาร ราชการด้วยความเป็นธรรม ไม่เลือกปฏิบัติและคำนึงถึงสิทธิเสรีภาพของผู้มีส่วนได้เสีย 
                  9. หลักความเสมอภาค (Equity) คือ การได้รับการปฏิบัติและได้รับบริการอย่างเท่าเทียมกัน โดยไม่มี การแบ่งแยกด้านชายหรือหญิง ถิ่นกำเนิด เชื้อชาติ ภาษา เพศ อายุ ความพิการ สภาพทางกายหรือสุขภาพ สถานะ ของบุคคล ฐานะทางเศรษฐกิจและสังคม ความเชื่อทางศาสนา การศึกษา การฝึกอบรม และอื่นๆ 
                   10. หลักมุ่งเน้นฉันทามติ (Consensus Oriented) คือ การหาข้อตกลงทั่วไปภายในกลุ่มผู้มีส่วนได้เสีย ที่เกี่ยวข้อง ซึ่งเป็นข้อตกลงที่เกิดจากการใช้กระบวนการเพื่อหาข้อคิดเห็น จากกลุ่มบุคคลที่ได้รับประโยชน์และเสีย ประโยชน์ โดยเฉพาะกลุ่มที่ได้รับผลกระทบโดยตรงซึ่งต้องไม่มีข้อคัดค้านที่ยุติไม่ได้ในประเด็นที่สำคัญ โดยฉันทามติ ไม่จำเป็นต้องหมายความว่าเป็นความเห็นพ้องโดยเอกฉันท์ 
                   การประเมินคุณธรรมและความโปร่งใสในการดำเนินงานของหน่วยงานภาครัฐ (Integrity and Transparency Assessment : ITA) เป็นเครื่องมือการประเมินเชิงบวกเพื่อเป็นมาตรการป้องกันการทุจริต และ เป็นกลไกในการสร้างความตระหนักให้หน่วยงานภาครัฐมีการดำเนินงานอย่างโปร่งใสและมีคุณธรรม ซึ่ง ประกอบด้วย 10 ตัวชี้วัด ดังนี้
                   ตัวชี้วัดที่ 1 การปฏิบัติหน้าที่ 
                   ตัวชี้วัดที่ 2 การใช้งบประมาณ 
                   ตัวชี้วัดที่ 3 การใช้อำนาจ 
                   ตัวชี้วัดที่ 4 การใช้ทรัพย์สินของทางราชการ 
                   ตัวชี้วัดที่ 5 การแก้ไขปัญหาการทุจริต 
                   ตัวชี้วัดที่ 6 คุณภาพการดำเนินงาน 
                   ตัวชี้วัดที่ 7 ประสิทธิภาพการสื่อสาร 
                   ตัวชี้วัดที่ 8 การปรับปรุงระบบการทำงาน 
                   ตัวชี้วัดที่ 9 การเปิดเผยข้อมูล 
                   ตัวชี้วัดที่ 10 การป้องกันการทุจริต ',
                'condition' => 'ไม่มีหลักฐานการดำเนินการทั้ง 4 ข้อ (0)  
                    มีการดำเนินงานข้อ 1 (3)  
                    มีการดำเนินงานข้อ 1 และ 2 (5)  
                    มีการดำเนินงานข้อ 1 ถึง 3 (7)  
                    มีครบทุกข้อ (10) ',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการใช้ข้อมูลเพื่อการตัดสินใจของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น ระบบสารสนเทศเพื่อการบริหารและการตัดสินใจ การจัดการข้อมูลด้านการเรียนการสอน การวิจัย การบริการวิชาการ และการทำนุบำรุงศิลปะและวัฒนธรรม',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-19
                'name' => 'ตัวบ่งชี้ที่ 4 การใช้ข้อมูลเพื่อการตัดสินใจ  ',
                'categorie_id' => 8,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-4',
                'description' => ' ระบบสารสนเทศเพื่อการบริหารและการตัดสินใจ หมายถึง ระบบการจัดเก็บ ประมวลผล วิเคราะห์ข้อมูล และนำ สารสนเทศไปใช้เพื่อการตัดสินใจ ครอบคลุมทุกพันธกิจที่สถาบันกำหนด โดยแสดงผลข้อมูลที่เป็นปัจจุบัน ถูกต้อง พร้อมใช้ และเข้าถึงได้ ทำให้ผู้บริหารนำไปใช้ในการบริหารงานและตัดสินใจ ครอบคลุมทุกพันธกิจที่สถาบันกำหนด ดังนี้ 
                     1) ด้านการบริหาร หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารสามารถนำมาพิจารณาในการ ตัดสินใจได้ ประกอบด้วย 
                                1.1) ด้านการเงิน การงบประมาณ แสดงถึงการนำข้อมูลมาวิเคราะห์ด้วยค่าสถิติเชิงพรรณนา เช่น ร้อยละ ค่าเฉลี่ย ของเงินงบประมาณที่ได้รับและรายจ่ายในแต่ละปีงบประมาณแต่ละไตรมาส เพื่อพิจารณาบริหาร จัดการให้ทันเวลา การเสนอรายงานสารสนเทศอาจเป็นการบรรยาย ตาราง แผนภูมิ แผนภาพที่สื่อต่อความเข้าใจได้ ง่าย เป็นต้น 
                                1.2) ด้านการบริหารงานบุคคล แสดงถึงจำนวนร้อยละของบุคลากรที่หน่วยงานมีอยู่ จำแนกตามวุฒิ การศึกษา อายุ เพศ ระดับตำแหน่ง ตำแหน่งทางวิชาการ การลาศึกษาต่อ การลาฝึกอบรม ภาระงานของอาจารย์ และบุคลากร ประวัติของบุคลากรที่จำเป็นต่อการบริหารงานและการตัดสินใจของผู้บริหาร เป็นต้น 
                                1.3) ด้านครุภัณฑ์แสดงถึงจำนวนครุภัณฑ์ที่จำเป็นในการจัดการเรียนการสอน ที่หน่วยงานมีอยู่ เช่น การเปรียบเทียบการเพิ่มขึ้น - ลดลงในแต่ละปี รายละเอียดที่สามารถทราบถึงวันเวลา การซื้อ การซ่อม การจำหน่าย การยืม การคืน เพื่อการตัดสินใจในการจัดหาครุภัณฑ์ที่จำเป็น เป็นต้น 
                     2) ด้านการเรียนการสอน หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศผู้บริหารนำมาใช้ในการตัดสินใจ ด้านการเรียนการสอนของหน่วยงาน เช่น การแสดงตารางสอน ในแต่ละชั้นปีการเปรียบเทียบจำนวนนิสิต/นักศึกษาแรกเข้าในแต่ละปี การเปรียบเทียบจำนวนผู้สำเร็จการศึกษาและนิสิต/นักศึกษาแรกเข้าในแต่ละรุ่น แต่ละปี หลักสูตรที่เปิดสอน จำนวนรายวิชาที่สอนในแต่ละปีการศึกษา ภาระงานของอาจารย์ผู้สอนในแต่ละภาคการศึกษา เป็นต้น 
                     3) ด้านการวิจัย หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศผู้บริหารนำมาใช้ในการตัดสินใจด้านการ วิจัยของหน่วยงาน เช่น จำนวน/ร้อยละของงานวิจัย เปรียบเทียบจำนวนงานวิจัยของอาจารย์ในแต่ละปี จำนวนทุน ที่ได้รับการสนับสนุนจากภายใน/ภายนอกหน่วยงานเรื่องที่ทำการวิจัยในแต่ละสาขาวิชา จำนวน/ร้อยละของ งานวิจัยที่ตีพิมพ์ในแต่ละปี บทคัดย่อที่ผู้สนใจสามารถเข้าถึงได้ เป็นต้น 
                      4) ด้านการบริการวิชาการ หมายถึง การจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหารนำมาใช้ในการ ตัดสินใจด้านการบริการวิชาการของหน่วยงาน เช่น จำนวน/ร้อยละ การเปรียบเทียบงานบริการวิชาการของอาจารย์ ในแต่ละปี จำนวนงบประมาณที่ได้รับการสนับสนุนจากภายใน/ภายนอกหน่วยงาน จำนวนอาจารย์ที่ให้บริการ วิชาการแก่สังคม หลักสูตร/โครงการ/กิจกรรมที่ให้บริการในแต่ละปี เป็นต้น 
                      5) ด้านการทำนุบำรุงศิลปะและวัฒนธรรม หมายถึง มีการจัดการข้อมูลเพื่อให้เป็นสารสนเทศที่ผู้บริหาร สามารถนำมาพิจารณาในการตัดสินใจด้านการทำนุบำรุงศิลปะและวัฒนธรรม เช่น จำนวน/ร้อยละ การเปรียบเทียบ งาน/กิจกรรมทำนุบำรุงศิลปะและวัฒนธรรมในแต่ละปี จำนวนงบประมาณที่ได้รับการสนับสนุนจากภายใน/ ภายนอกหน่วยงาน จำนวนอาจารย์ที่งาน/กิจกรรมทำนุบำรุงศิลปะและวัฒนธรรม หลักสูตร/โครงการ/กิจกรรมที่ ให้บริการในแต่ละปี เป็นต้น ',
                'condition' => 'ไม่มีหลักฐานการดำเนินการทั้ง 4 ข้อ (0)  
                    มีการดำเนินงานข้อ 1 (3)  
                    มีการดำเนินงานข้อ 1 และ 2 (5)  
                    มีการดำเนินงานข้อ 1 ถึง 3 (7)  
                    มีครบทุกข้อ (10)  ',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการประพฤติตามกฎหมายและจริยธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การประพฤติตามกฎหมายและจริยธรรม หลักธรรมาภิบาล และการประเมินคุณธรรมและความโปร่งใสในการดำเนินงาน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-20
                'name' => 'ตัวบ่งชี้ที่ 5 การบริหารความเสี่ยง',
                'categorie_id' => 8,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-5',
                'description' => 'การบริหารความเสี่ยง หมายถึง กระบวนการวิเคราะห์ความเสี่ยง การจัดลำดับความสำคัญ การจัดทำ แผนบริหารความเสี่ยง การควบคุมภายใน/การจัดการ เพื่อป้องกันปัญหาที่เกิดจากความเสี่ยงต่าง ๆ รวมถึง แผน เตรียมความพร้อมต่อภาวะฉุกเฉิน แผนความต่อเนื่องทางธุรกิจ และมีการติดตาม ประเมินผลการดำเนินการ 
                     แผนบริหารความเสี่ยง หมายถึง แผนการจัดการเพื่อป้องกันความเสี่ยงต่าง ๆ ที่เกี่ยวกับการจัดการศึกษา และการบริหารที่อาจเกิดขึ้น ซึ่งเกิดจากการวิเคราะห์ความเสี่ยงอย่างรอบด้าน สอดคล้องกับกลยุทธ์ของสถาบัน เช่น ความเสี่ยงด้านกลยุทธ์หรือยุทธศาสตร์ของสถาบัน ความเสี่ยงด้านนโยบาย กฎหมาย ระเบียบ ข้อบังคับ และความ เสี่ยงด้านการปฏิบัติงาน ความเสี่ยงด้านบุคลากร การเงิน งบประมาณ ระบบเทคโนโลยีสารสนเทศ อาคารสถานที่ เป็นต้น 
                      แผนเตรียมความพร้อมต่อภาวะฉุกเฉิน หมายถึง แผนสำหรับผู้บริหาร บุคลากร นักศึกษาของสถาบันเพื่อ เตรียมความพร้อมต่อภาวะฉุกเฉินที่สถาบันระบุไว้ เช่น การเกิดไฟไหม้ น้ำท่วม เป็นต้น แผนความต่อเนื่องทางธุรกิจ (Business Continuity Plan: BCP) หมายถึง แผนสำหรับผู้บริหาร เพื่อใช้ ในการประคองการดำเนินงานของสถาบันในสถานการณ์ภัยพิบัติและเหตุฉุกเฉินที่อาจเกิดขึ้น โดยเริ่มจากวิเคราะห์ สถานการณ์ที่อาจทำให้การดำเนินงานของสถาบันไม่ต่อเนื่อง กำหนดแผน และมีการซ้อมแผนความต่อเนื่องทาง ธุรกิจอย่างน้อยปีละ 1 ครั้ง',
                'condition' => 'ไม่มีหลักฐานการดำเนินการ (0)  
                    มีการดำเนินงานข้อ 1 (3)  
                    มีการดำเนินงานข้อ 1 และ 2 (5)  
                    มีการดำเนินงานข้อ 1 ถึง 3 (7)  
                    มีครบทุกข้อ (10) ',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบริหารความเสี่ยงของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การบริหารความเสี่ยง แผนบริหารความเสี่ยง แผนเตรียมความพร้อมต่อภาวะฉุกเฉิน และแผนความต่อเนื่องทางธุรกิจ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-21
                'name' => 'ตัวบ่งชี้ที่ 6 การสร้างความร่วมมือ',
                'categorie_id' => 8,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-6',
                'description' => 'การสร้างความร่วมมือ หมายถึง กระบวนการดำเนินงานตามพันธกิจที่สำคัญของสถาบันการศึกษาร่วมกับสถาบันอื่น ๆ ในประเทศ หรือ ต่างประเทศ เพื่อสนับสนุนให้สถาบันบรรลุวิสัยทัศน์ และการดำเนินงานตามพันธกิจเป็นไปตามเป้าหมาย เช่น การพัฒนาการเรียนการสอน การวิจัย การบริการวิชาการ การทำนุบำรุงศิลปวัฒนธรรม การพัฒนาคุณภาพการพยาบาลในแหล่งฝึกปฏิบัติทางการพยาบาล เป็นต้น',
                'condition' => 'ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 (3)
                    มีการดำเนินงานข้อ 1 และ 2 (5)
                    มีการดำเนินงานข้อ 1 2 และ3 (8)
                    มีการดำเนินงานครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการสร้างความร่วมมือของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การสร้างความร่วมมือกับสถาบันอื่น ๆ ในประเทศหรือต่างประเทศ การพัฒนาการเรียนการสอน การวิจัย การบริการวิชาการ และการทำนุบำรุงศิลปวัฒนธรรม',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-22
                'name' => 'ตัวบ่งชี้ที่ 7 ขีดความสามารถ และอัตรากำลัง',
                'categorie_id' => 9,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-7',
                'description' => 'ขีดความสามารถ หมายถึง สมรรถนะหรือความสามารถของบุคลากรทั้งสายวิชาการและสายสนับสนุนที่สถาบันพึงมี ซึ่งมีความจำเป็นต่อการตอบสนองพันธกิจและอาจช่วยเสริมสมรรถนะหลักของสถาบัน สร้างความได้เปรียบในการแข่งขัน
                       การกำหนดขีดความสามารถของบุคลากร หมายถึง กระบวนการกำหนดสมรรถนะหรือความสามารถของบุคลากรทั้งสายวิชาการ และสายสนับสนุนเพื่อให้บรรลุวิสัยทัศน์ ยุทธศาสตร์ของสถาบัน ครอบคลุมพันธกิจที่สำคัญที่สถาบันกำหนด
                        การวางแผนด้านอัตรากำลัง หมายถึง กระบวนการวิเคราะห์อัตรากำลังของบุคลากรทั้งสายวิชาการและสายสนับสนุนที่ต้องการอย่างเพียงพอที่จะดำเนินการตามกระบวนการทำงานตามพันธกิจสำคัญที่สถาบันกำหนดให้สำเร็จ รวมทั้งคำนึงถึงการตอบสนองความต้องการกำลังคนตามความต้องการที่มีการเปลี่ยนแปลงในสถานการณ์ปกติและสถานการณ์ที่ไม่คาดหมาย
                        การสรรหาบุคลากร หมายถึง กระบวนการจัดการเพื่อให้สถาบันมีบุคลากรใหม่ทั้งสายวิชาการและสายสนับสนุนที่มีคุณสมบัติและสมรรถนะเพียงพอในการตอบสนองความสำเร็จของสถาบันในการดำเนินการพันธกิจที่สำคัญ ครอบคลุมถึงกระบวนการกำหนดคุณสมบัติที่สอดคล้องกับแผนกลยุทธ์/ยุทธศาสตร์ กระบวนการคัดเลือกบุคลากร กระบวนการว่าจ้างและบรรจุ รวมถึงระบบการดูแลบุคลากรใหม่
                        การเปลี่ยนแปลงในสถานการณ์ปกติและสถานการณ์ที่ไม่คาดหมาย หมายถึง เหตุการณ์การเปลี่ยนแปลงต่างๆที่สถาบันควรนำมาพิจารณาทั้งในเรื่องขีดความสามารถและอัตรากำลังให้มีความเพียงพอต่อการตอบสนองพันธกิจและสามารถดำเนินการได้อย่างต่อเนื่อง เช่น การเกษียณอายุราชการ การลาออก การเจ็บป่วย การเสียชีวิตของบุคลากร การเปิดหลักสูตรและบริการใหม่ ๆ การเปลี่ยนแปลงด้านโครงสร้าง ระบบงานที่ออกแบบใหม่ การใช้เทคโนโลยีทดแทนคน การจัดการภาวะหมดไฟของบุคลากร การเปลี่ยนแปลงด้านความต้องการของนักศึกษา และผู้รับบริการอื่น การพลิกโฉมองค์กร เป็นต้น',
                'condition' => 'ไม่มีหลักฐานการดำเนินการ (0)
                        มีการดำเนินงานข้อ 1 (2)
                        มีการดำเนินงานข้อ 1 และ 2 (4)
                        มีการดำเนินงานข้อ 1 ถึง 3 (6)
                        มีการดำเนินงานข้อ 1 ถึง 4 (8)
                        มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินขีดความสามารถและอัตรากำลังของบุคลากรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การกำหนดขีดความสามารถของบุคลากร การวางแผนด้านอัตรากำลัง การสรรหาบุคลากร และการเปลี่ยนแปลงในสถานการณ์ปกติและสถานการณ์ที่ไม่คาดหมาย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-23
                'name' => 'ตัวบ่งชี้ที่ 8 การบริหารงานบุคคล(HRM)',
                'categorie_id' => 9,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-8',
                'description' => 'การบริหารงานบุคคล หมายถึง กระบวนการจัดระบบการทำงานและบริหารบุคลากรเพื่อให้สามารถใช้ประโยชน์อย่างเต็มที่จากอัตรากำลังและขีดความสามารถของบุคลากรทั้งสายวิชาการและสายสนับสนุนที่มีอยู่ เพื่อตอบสนองการดำเนินงานตามพันธกิจ ตอบสนองความต้องการและความคาดหวังของนักศึกษาและผู้รับบริการอื่น ทำให้เกิดการทำงานที่มีความคล่องตัว รวมถึงการมอบหมายงาน การกำกับติดตาม การจัดการผลการปฏิบัติงาน การบริหารค่าตอบแทน การให้รางวัล ยกย่อง ชมเชย การบริหารการคงอยู่ของบุคลากรเพื่อทำให้สถาบันบรรลุผลสำเร็จของแผนปฏิบัติการได้และสนับสนุนให้เกิดผลการปฏิบัติงานที่โดดเด่น',
                'condition' => 'ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 และ 2 (2)
                    มีการดำเนินงานข้อ 1 ถึง 3 (5)
                    มีการดำเนินงานข้อ 1 ถึง 4 (10)
                    มีครบทุกข้อ (15)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบริหารงานบุคคลของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การจัดระบบการทำงาน การบริหารบุคลากร การมอบหมายงาน การกำกับติดตาม และการบริหารค่าตอบแทน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-24
                'name' => 'ตัวบ่งชี้ที่ 9 การพัฒนาบุคลากร(HRD)',
                'categorie_id' => 9,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-9',
                'description' => ' การพัฒนาบุคลากร หมายถึง ระบบการเรียนรู้และพัฒนาที่สนับสนุนความก้าวหน้าในอาชีพการงานซึ่งสอดคล้องกับความต้องการของตนเองและความจำเป็นด้านขีดความสามารถหรือสมรรถนะที่สถาบันต้องการ โดยสถาบันอาจกำหนดขอบเขตของโอกาสในการพัฒนาบุคลากรอย่างเป็นระบบโดยมุ่งหวังให้บุคลากรสามารถนำ ความรู้และทักษะมาใช้ในการปรับปรุงการปฏิบัติงาน เสริมสร้างทักษะใหม่ในการปฏิบัติงาน และสอนงานกับบุคลากรที่เกี่ยวข้องได้
              การพัฒนาผู้บริหาร หมายถึง กระบวนการเตรียมผู้บริหาร ผู้นำและตำแหน่งสำคัญอื่นๆของสถาบันในอนาคต หรือการพัฒนาความสามารถในการบริหารจัดการองค์กรของผู้บริหาร ผู้นำและตำแหน่งสำคัญอื่นๆของสถาบันในปัจจุบัน',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 (2)
                    มีการดำเนินงานข้อ 1 และ 2 (5)
                    มีการดำเนินงานข้อ 1 ถึง 3 (10)
                    มีการดำเนินงานข้อ 1 ถึง 4 (12)
                    มีครบทุกข้อ (15',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการพัฒนาบุคลากรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การพัฒนาบุคลากร การพัฒนาผู้บริหาร และการพัฒนาความสามารถในการบริหารจัดการองค์กร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-25
                'name' => 'ตัวบ่งชี้ที่ 10 การสร้างความผูกพัน',
                'categorie_id' => 9,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-10',
                'description' => ' การสร้างความผูกพัน หมายถึง กระบวนการสร้างให้บุคลากรสายวิชาการและสายสนับสนุนมีความรู้สึกเป็นส่วนหนึ่งขององค์กร ยึดในอุดมการณ์และมีเป้าหมายร่วมกัน ภาคภูมิใจในงานที่ได้รับมอบหมาย โดยครอบคลุมตั้งแต่การกำหนดปัจจัยขับเคลื่อนความผูกพันของบุคลากร การสร้างสภาพแวดล้อม การสร้างวัฒนธรรมการสื่อสารที่เปิดกว้างและการสร้างบรรยากาศที่เอื้อต่อการปฏิบัติงานที่ทำให้บุคลากรเกิดแรงจูงใจที่จะปฏิบัติงานอย่างเต็มที่เพื่อประโยชน์ของผู้เรียนและผู้รับบริการ รวมทั้งความสำเร็จขององค์กร
                      ปัจจัยขับเคลื่อนความผูกพัน หมายถึง สิ่งที่ทำให้บุคลากรเกิดแรงจูงใจในการปฏิบัติงานอย่างเต็มที่ให้แก่องค์กรและพร้อมที่จะเสียสละ ทุ่มเท สนับสนุนเพื่อให้องค์กรประสบความสำเร็จ สามารถค้นหาจากการสำรวจ การทำวิจัย การสนทนากลุ่ม เป็นต้น
                      นโยบายด้านสวัสดิการ สิทธิประโยชน์ หมายถึง กระบวนการกำหนดระเบียบ แนวทางในการให้ค่าตอบแทนพิเศษ หรือการจัดสรรสวัสดิการ และสิทธิประโยชน์ที่ตอบสนองต่อความต้องการที่หลากหลายและระดับการจ้างงานที่มีความแตกต่างกัน คำนึงถึงการมีส่วนร่วมและเกิดความเท่าเทียม ซึ่งความเหมาะสมอาจขึ้นอยู่กับประสบการณ์และผลการปฏิบัติงานตามข้อกำหนดงานของแต่ละบุคคล โดยคำนึงถึงความสำเร็จขององค์กร
                       สภาพแวดล้อมการทำงาน หมายถึง สิ่งแวดล้อมด้านกายภาพ เครื่องมือเครื่องใช้ อุปกรณ์ที่เอื้อต่อความสำเร็จของงาน สภาวะแวดล้อมที่มีความปลอดภัย การมีสารสนเทศที่สนับสนุนการปฏิบัติงาน เป็นต้น รวมถึงความสะดวกในการเข้าถึงสถานที่ทำงาน สุขภาวะในสถานที่ทำงาน',
                'condition' => 'ไม่มีหลักฐานการดำเนินการ (0)
                        มีการดำเนินงานข้อ 1 และ 2 (3)
                        มีการดำเนินงานข้อ 1 ถึง 3 (5)
                        มีการดำเนินงานข้อ 1 ถึง 4 (7)
                        มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการพัฒนาบุคลากรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การพัฒนาบุคลากร การพัฒนาผู้บริหาร และการพัฒนาความสามารถในการบริหารจัดการองค์กร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-26
                'name' => 'ตัวบ่งชี้ที่ 11 การบริหารหลักสูตร',
                'categorie_id' => 10,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-11',
                'description' => 'การออกแบบหลักสูตร หมายถึง การออกแบบหลักสูตรของสถาบันที่ตอบสนองความต้องการของผู้มีส่วนได้เสียทุกกลุ่ม และนำมากำหนดผลลัพธ์การเรียนรู้ของบัณฑิต (Outcome Based Education: OBE) สอดคล้องกับมาตรฐานหลักสูตรการศึกษาระดับอุดมศึกษา รวมทั้งมาตรฐานคุณวุฒิสาขา หรือสาขาวิชา หรือมาตรฐานระดับนานาชาติ
                      การปรับปรุงหลักสูตร หมายถึง การนำข้อมูลการประเมินผลการจัดการศึกษาและความต้องการของผู้มีส่วนได้เสีย มาใช้ทบทวน ปรับปรุงและพัฒนาคุณภาพของหลักสูตร เพื่อให้ผู้เรียนบรรลุมาตรฐานผลลัพธ์การเรียนรู้ที่กำหนดและผู้ใช้บัณฑิตมั่นใจว่าจะได้บัณฑิตพยาบาลที่มีสมรรถนะตรงตามความต้องการ โดยเป็นการปรับปรุงพัฒนาหลักสูตรเป็นระยะ อย่างน้อยตามรอบระยะเวลาของหลักสูตร หรืออย่างน้อยทุก 5 ปี
                      การประกันคุณภาพหลักสูตร หมายถึง กระบวนการออกแบบ การพัฒนาระบบและกลไก หรือวิธีการเพื่อให้มั่นใจว่าจะได้บัณฑิตที่มีผลลัพธ์การเรียนรู้ที่กำหนดไว้ในหลักสูตร โดยมีหลักฐานเชิงประจักษ์ที่แสดงคุณภาพ มาตรฐานการจัดการศึกษาของหลักสูตรตามที่สถาบันกำหนด',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                     มีการดำเนินงานข้อ 1 และ 2 (10)
                     มีการดำเนินงานข้อ 1 ถึง 3 (15)
                     มีการดำเนินงานข้อ 1 ถึง 4 (20)
                     มีครบทุกข้อ (25)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบริหารหลักสูตรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การออกแบบหลักสูตร การปรับปรุงหลักสูตร และการประกันคุณภาพหลักสูตร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 25.00,
            ],
            [
                // id-27
                'name' => 'ตัวบ่งชี้ที่ 12 การจัดกระบวนการเรียนรู้และการประเมินผล',
                'categorie_id' => 10,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-12',
                'description' => 'การจัดกระบวนการเรียนรู้ หมายถึง การออกแบบกระบวนการเรียนการสอนที่สอดคล้องกับผลลัพธ์การเรียนรู้ของผู้เรียนทั้งระดับหลักสูตร ระดับชั้นปี และระดับรายวิชา ทั้งภาคทฤษฎีและภาคปฏิบัติ ที่เน้นผู้เรียนเป็นศูนย์กลาง ปลูกฝังทักษะการเรียนรู้ตลอดชีวิต เพื่อให้ผู้เรียนบรรลุผลลัพธ์การเรียนรู้ตามที่หลักสูตรและรายวิชาคาดหวัง เกิดชุดความคิดแบบเติบโต (Growth Mindset) สามารถนำสิ่งที่เรียนรู้ไปใช้ในการทำงานได้จริง
                      การประเมินผล หมายถึง กระบวนการวัดและประเมินผลลัพธ์การเรียนรู้ระดับหลักสูตร ระดับชั้นปี และระดับรายวิชา โดยใช้วิธีการ เครื่องมือ และเกณฑ์การตัดสินผลที่เหมาะสม มีความตรง ความเที่ยง และยุติธรรม และมีการทบทวน ตรวจสอบ กำกับ การให้ข้อมูลป้อนกลับ นำไปสู่การปรับปรุง/พัฒนาคุณภาพการเรียนการสอนของผู้สอนและผู้เรียน เพื่อให้มั่นใจว่าผู้เรียนบรรลุผลลัพธ์การเรียนรู้ที่คาดหวัง
                       นวัตกรรมการเรียนการสอน หมายถึง กระบวนการหรือสิ่งประดิษฐ์ใหม่ ที่พัฒนาขึ้นโดยอาจารย์ในสถาบันเพื่อให้การจัดการเรียนการสอนและการประเมินผลบรรลุผลลัพธ์การเรียนรู้ระดับรายวิชา หรือระดับชั้นปี หรือระดับหลักสูตร หรือตามความต้องการของผู้เรียน อาจารย์ หรือ ผู้ใช้บัณฑิต',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                     มีการดำเนินงานข้อ 1 และ 2 (10)
                     มีการดำเนินงานข้อ 1 ถึง 3 (15)
                     มีการดำเนินงานข้อ 1 ถึง 4 (20)
                     มีครบทุกข้อ (25)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการจัดกระบวนการเรียนรู้และการประเมินผลของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การจัดกระบวนการเรียนรู้ การประเมินผล และนวัตกรรมการเรียนการสอน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 25.00,
            ],
            [
                // id-28
                'name' => 'ตัวบ่งชี้ที่ 13 กระบวนการรับนักศึกษา',
                'categorie_id' => 10,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-13',
                'description' => 'การรับนักศึกษา หมายถึง กระบวนการคัดเลือกบุคคลที่มีคุณสมบัติตรงตามที่หลักสูตรกำหนด การกำหนดเกณฑ์ที่ใช้ในการคัดเลือกต้องมีความโปร่งใส ชัดเจน และสอดคล้องกับคุณสมบัติของนักศึกษาที่กำหนดในหลักสูตร มีเครื่องมือที่ใช้ในการคัดเลือก หรือวิธีการคัดเลือกให้ได้นักศึกษาที่มีความพร้อมทางปัญญา สุขภาพกายและจิต มีความมุ่งมั่นที่จะเรียนและมีเวลาเรียนเพียงพอ เพื่อให้สามารถสำเร็จการศึกษาได้ตามที่หลักสูตรกำหนด',
                'condition' => ' ไม่มีหลักฐานการดำเนินงาน (0)
                    มีการดำเนินงานข้อ 1 (2)
                    มีการดำเนินงานข้อ 1 และ 2 (5)
                    มีการดำเนินงานข้อ 1 2 และ 3 (8)
                    มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการรับนักศึกษาของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การคัดเลือกบุคคลที่มีคุณสมบัติตรงตามที่หลักสูตรกำหนด การกำหนดเกณฑ์ที่ใช้ในการคัดเลือก และเครื่องมือที่ใช้ในการคัดเลือก',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-29
                'name' => 'ตัวบ่งชี้ที่ 14 กระบวนการจัดการสิ่งสนับสนุนการเรียนรู้',
                'categorie_id' => 10,
                'year' => 2026,
                'type' => 'ปริมาณ/คุณภาพ',
                'code' => 'NCP-13',
                'description' => 'กระบวนการจัดการสิ่งสนับสนุนการเรียนรู้ หมายถึง การดำเนินการให้เกิดความพร้อมด้านกายภาพ อุปกรณ์ เทคโนโลยี การให้บริการด้านต่างๆ เพื่อสนับสนุนให้นักศึกษาสามารถเรียนรู้ได้อย่างมีประสิทธิภาพและประสิทธิผลของสถาบัน',
                'condition' => '  ไม่มีหลักฐานการดำเนินงาน (0)
                    มีการดำเนินงานข้อ 1 (3)
                    มีการดำเนินงานข้อ 1 และ 2 (7)
                    มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการจัดการสิ่งสนับสนุนการเรียนรู้ของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การดำเนินการให้เกิดความพร้อมด้านกายภาพ อุปกรณ์ เทคโนโลยี และการให้บริการด้านต่าง ๆ เพื่อสนับสนุนให้นักศึกษาสามารถเรียนรู้ได้อย่างมีประสิทธิภาพและประสิทธิผลของสถาบัน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-30
                'name' => 'ตัวบ่งชี้ที่ 15 กระบวนการจัดการสิ่งสนับสนุนการเรียนรู้',
                'categorie_id' => 11,
                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCP-15',
                'description' => ' การพัฒนางานวิจัย นวัตกรรม หมายถึง ระบบและกลไกสนับสนุนให้เกิดงานวิจัย/นวัตกรรมของสถาบัน ครอบคลุมอย่างน้อย การพัฒนาบุคลากรให้มีศักยภาพในการสร้างงานวิจัย/นวัตกรรม การส่งเสริมจริยธรรมและจรรยาบรรณนักวิจัย/นักวิชาการ การจัดสรรภารกิจและเวลา การสนับสนุนงบประมาณ การจัดบุคลากรช่วยสนับสนุนการวิจัยหรือการจัดที่ปรึกษา
                        ความเชี่ยวชาญของสถาบัน หมายถึง ความเข้มแข็งทางวิชาการซึ่งสอดคล้องกับความต้องการของผู้มีส่วนได้เสียหรือชุมชน สังคม ตามที่สถาบันกำหนด
                        การนำงานวิจัย/นวัตกรรม ไปใช้ประโยชน์ หมายถึง ระบบและกลไกที่สนับสนุนให้เกิดการนำวิจัย/นวัตกรรมไปใช้ประโยชน์ การนำไปใช้ประโยชน์มี ดังนี้
                      1. เชิงวิชาการ คือ งานวิจัย/นวัตกรรมของสถาบันที่ได้รับการอ้างอิง
                      2. เชิงนโยบาย คือ งานวิจัย/นวัตกรรมที่มีการนำไปใช้ประกอบการตัดสินใจในการบริหารหรือกำหนดนโยบาย
                      3. เชิงชุมชนหรือสังคม คือ งานวิจัย/นวัตกรรมที่ชุมชนหรือท้องถิ่นนำไปใช้ประโยชน์ หรือนำไปพัฒนาคุณภาพการปฏิบัติการพยาบาล',
                'condition' => '  ไม่มีหลักฐานการดำเนินงาน (0)
                    มีการดำเนินงานข้อ 1 (3)
                    มีการดำเนินงานข้อ 1 และ 2 (6)
                    มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการพัฒนางานวิจัยและนวัตกรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การพัฒนางานวิจัย นวัตกรรม ความเชี่ยวชาญของสถาบัน และการนำงานวิจัย/นวัตกรรมไปใช้ประโยชน์',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-31
                'name' => 'ตัวบ่งชี้ที่ 16 กระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญา',
                'categorie_id' => 11,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCP-16',
                'description' => 'กระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญา หมายถึง กระบวนการนำผลงานวิจัยไปเผยแพร่และ/หรือจดทรัพย์สินทางปัญญาของสถาบัน อย่างมีจริยธรรมและความซื่อสัตย์ทางวิชาการ ครอบคลุมอย่างน้อย การจัดทำต้นฉบับงานวิจัยที่มีคุณภาพ การคัดเลือกวารสาร การจัดสรรงบประมาณสนับสนุนการเผยแพร่ และหรือการสนับสนุนการจดทะเบียนทรัพย์สินทางปัญญา',
                'condition' => '  ไม่มีหลักฐานการดำเนินงาน (0)
                    มีการดำเนินงานข้อ 1 (3)
                    มีการดำเนินงานข้อ 1 และ 2 (6)
                    มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญาของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำผลงานวิจัยไปเผยแพร่ การจดทรัพย์สินทางปัญญา และการจัดทำต้นฉบับงานวิจัยที่มีคุณภาพ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-32
                'name' => 'ตัวบ่งชี้ที่ 17 การบริการวิชาการเพื่อชุมชน/สังคม',
                'categorie_id' => 12,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCP-17',
                'description' => '  การบริการวิชาการเพื่อชุมชน/สังคม หมายถึง กระบวนการในการให้บริการวิชาการแก่ชุมชน/สังคมของสถาบันที่สอดคล้องกับวิสัยทัศน์และความเชี่ยวชาญของสถาบัน โดยมีโครงการ/กิจกรรมที่ก่อให้เกิดประโยชน์แก่ชุมชน/สังคม',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 และ ข้อ 2 (5)
                    มีการดำเนินงานข้อ 1, 2 และ 3 (10)
                    มีครบทุกข้อ (15)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญาของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำผลงานวิจัยไปเผยแพร่ การจดทรัพย์สินทางปัญญา และการจัดทำต้นฉบับงานวิจัยที่มีคุณภาพ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-33
                'name' => 'ตัวบ่งชี้ที่ 18 การปฏิบัติการพยาบาลของอาจารย์ (faculty pracitce)',
                'categorie_id' => 12,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCP-18',
                'description' => ' การปฏิบัติการพยาบาลของอาจารย์ (faculty practice) หมายถึง การนำความชำนาญหรือความเชี่ยวชาญของอาจารย์พยาบาล ไปให้บริการโดยตรงแก่ผู้รับบริการ เป็นรายบุคคล ครอบครัว กลุ่ม หรือชุมชน แสดงให้เห็นถึงความชำนาญ/เชี่ยวชาญทางคลินิก (clinical area) ของอาจารย์พยาบาลในสาขานั้น ๆ นำไปสู่การพัฒนาคุณภาพการพยาบาล
                    วิชาชีพการพยาบาลเป็นวิชาชีพการปฏิบัติ (practice profession) อาจารย์พยาบาลต้องมีความชำนาญในการพยาบาลผู้รับบริการแต่ละสาขา เฉพาะกลุ่ม/เฉพาะโรค ซึ่งเป็นสมรรถนะมาตรฐาน',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 (5)
                    มีการดำเนินงานข้อ 1 และ 2 (10)
                    มีครบทุกข้อ (15)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญาของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำผลงานวิจัยไปเผยแพร่ การจดทรัพย์สินทางปัญญา และการจัดทำต้นฉบับงานวิจัยที่มีคุณภาพ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-34
                'name' => 'ตัวบ่งชี้ที่ 19 การบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรม กับ การเรียนการสอน/บริการวิชาการ/วิจัย',
                'categorie_id' => 13,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCP-19',
                'description' => ' การบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรม กับ การเรียนการสอน/บริการวิชาการ/วิจัย หมายถึง การนำศิลปะและวัฒนธรรม/ภูมิปัญญาของท้องถิ่นหรือไทย บูรณาการเข้ากับศาสตร์ทางวิทยาศาสตร์สุขภาพ เกิดการ พัฒนาองค์ความรู้ที่มีรากฐานความเป็นไทย และนำไปสู่การพัฒนาการเรียนการสอน/บริการวิชาการ/วิจัย',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 (3)
                    มีการดำเนินงานข้อ 1 และ 2 (7)
                    มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '1',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำศิลปะและวัฒนธรรม/ภูมิปัญญาของท้องถิ่นหรือไทย บูรณาการเข้ากับศาสตร์ทางวิทยาศาสตร์สุขภาพ และการพัฒนาองค์ความรู้ที่มีรากฐานความเป็นไทย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-35
                'name' => 'ตัวบ่งชี้ที่ 20 การพัฒนานักศึกษา',
                'categorie_id' => 14,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCP-20',
                'description' => ' การพัฒนานักศึกษา หมายถึง กระบวนการเสริมหลักสูตรที่พัฒนาให้นักศึกษามีคุณลักษณะที่สอคล้องกับอัตลักษณ์บัณฑิต/ค่านิยมของสถาบัน กระบวนการช่วยเหลือนักศึกษา และการจัดการข้อร้องเรียน รวมถึงกระบวนการสนับสนุนให้นักศึกษาประพฤติตามกฎระเบียบและหลักจริยธรรม',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 และ ข้อ 2 (10)
                    มีการดำเนินงานข้อ 1 , 2 และ 3 (15)
                    มีครบทุกข้อ (20)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำศิลปะและวัฒนธรรม/ภูมิปัญญาของท้องถิ่นหรือไทย บูรณาการเข้ากับศาสตร์ทางวิทยาศาสตร์สุขภาพ และการพัฒนาองค์ความรู้ที่มีรากฐานความเป็นไทย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 20.00,
            ],
            [
                // id-36
                'name' => 'ตัวบ่งชี้ที่ 21 ความผูกพันของนักศึกษาและศิษย์เก่า',
                'categorie_id' => 14,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCP-21',
                'description' => ' ความผูกพัน หมายถึง กระบวนการจัดการความสัมพันธ์ระยะยาวของนักศึกษาและศิษย์เก่ากับสถาบัน ที่ทำให้นักศึกษาและศิษย์เก่าเกิดความรู้สึกภาคภูมิใจในสถาบัน และมีส่วนสนับสนุนความเจริญก้าวหน้าและชื่อเสียงของสถาบัน',
                'condition' => ' ไม่มีหลักฐานการดำเนินการ (0)
                    มีการดำเนินงานข้อ 1 และ ข้อ 2 (10)
                    มีการดำเนินงานข้อ 1 , 2 และ 3 (15)
                    มีครบทุกข้อ (20)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำศิลปะและวัฒนธรรม/ภูมิปัญญาของท้องถิ่นหรือไทย บูรณาการเข้ากับศาสตร์ทางวิทยาศาสตร์สุขภาพ และการพัฒนาองค์ความรู้ที่มีรากฐานความเป็นไทย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 20.00,
            ],
            //ผลลัพธ์
            [
                // id-37
                'name' => 'ตัวบ่งชี้ที่ 1 ผลการประเมินการบริหารงานของคณะผู้บริหารด้วยหลักธรรมาภิบาล หรือ การดำเนินการตามหลักคุณธรรมและความโปร่งใสของการดำเนินงาน',
                'categorie_id' => 15,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-1',
                'description' => '',
                'condition' => 'ใช้คะแนนเฉลี่ยของการประเมินคณะผู้บริหาร (คะแนนเต็ม 5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลการประเมินการบริหารงานของคณะผู้บริหารด้วยหลักธรรมาภิบาล หรือ การดำเนินการตามหลักคุณธรรมและความโปร่งใสของการดำเนินงาน โดยใช้คะแนนเฉลี่ยของการประเมินคณะผู้บริหาร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-38
                'name' => 'ตัวบ่งชี้ที่ 2 ผลลัพธ์ของความสำเร็จของความร่วมมือกับสถาบันอื่น ',
                'categorie_id' => 15,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-2',
                'description' => ' ความสำเร็จของความร่วมมือ หมายถึง ผลลัพธ์ที่เกิดจากความร่วมมือตามเป้าหมาย/วัตถุประสงค์ที่ทำให้บรรลุวิสัยทัศน์ และพันธกิจของสถาบัน',
                'condition' => 'ไม่มีหลักฐานแสดงผลลัพธ์การดำเนินการ (0)
                    มีผลลัพธ์ของความสำเร็จของความร่วมมือฯระดับชาติหรือนานาชาติ (6)
                    มีผลลัพธ์ของความสำเร็จของความร่วมมือฯระดับชาติและนานาชาติ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลลัพธ์ของความสำเร็จของความร่วมมือกับสถาบันอื่น โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การมีผลลัพธ์ของความสำเร็จของความร่วมมือระดับชาติหรือนานาชาติ และการมีผลลัพธ์ของความสำเร็จของความร่วมมือระดับชาติและนานาชาติ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-39
                'name' => 'ตัวบ่งชี้ที่ 3 ร้อยละของการดำเนินการที่บรรลุเป้าหมายตามแผนกลยุทธ์/ยุทธ์ศาสตร์ ',
                'categorie_id' => 15,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-3',
                'description' => ' บรรลุเป้าหมาย หมายถึง ผลของการดำเนินการตามโครงการ/กิจกรรมเป็นไปตามเป้าหมายที่กำหนดไว้ในแผนกลยุทธ์/ยุทธศาสตร์',
                'condition' => ' ต่ำกว่า ร้อยละ 61 (0)
                        ร้อยละ 61 – 70 (1)
                        ร้อยละ 71 – 80 (2)
                        ร้อยละ 81 – 90 (3)
                        ร้อยละ 91 – 100 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินร้อยละของการดำเนินการที่บรรลุเป้าหมายตามแผนกลยุทธ์/ยุทธ์ศาสตร์ของสถาบันการศึกษา โดยพิจารณาจากจำนวนโครงการหรือกิจกรรมที่มีผลการดำเนินงานเป็นไปตามเป้าหมายที่กำหนดไว้ในแผนกลยุทธ์หรือยุทธศาสตร์',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-40
                'name' => 'ตัวบ่งชี้ที่ 4 ร้อยละของการใช้จ่ายตามแผนการจัดสรรงบประมาณ  ',
                'categorie_id' => 15,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-4',
                'description' => '',
                'condition' => 'ต่ำกว่า ร้อยละ 61 (0)
                    ร้อยละ 61 – 70 (1)
                    ร้อยละ 71 – 80 (2)
                    ร้อยละ 81 – 90 (3)
                    ร้อยละ 91 – 100 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการประพฤติตามกฎหมายและจริยธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การประพฤติตามกฎหมายและจริยธรรม หลักธรรมาภิบาล และการประเมินคุณธรรมและความโปร่งใสในการดำเนินงาน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-41
                'name' => 'ตัวบ่งชี้ที่ 5 อัตราคงอยู่ของอาจารย์',
                'categorie_id' => 16,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-5',
                'description' => 'อัตราการคงอยู่ หมายถึง จำนวนอาจารย์ที่ปฏิบัติงานในสถาบันการศึกษาอย่างต่อเนื่องในแต่ละปีการศึกษา โดยนับตั้งแต่วันเริ่มต้นของแต่ละปีการศึกษาถึงวันสุดท้ายของปีการศึกษา',
                'condition' => 'น้อยกว่าร้อยละ 95 (0)
                        ร้อยละ 95 – 96.9 (3)
                        เท่ากับหรือมากกว่ารัอยละ 97 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินอัตราคงอยู่ของอาจารย์ในสถาบันการศึกษา โดยพิจารณาจากจำนวนอาจารย์ที่ปฏิบัติงานในสถาบันการศึกษาอย่างต่อเนื่องในแต่ละปีการศึกษา เช่น อัตราคงอยู่ของอาจารย์ที่มีคุณสมบัติและความสามารถในการสอน และการพัฒนาคุณภาพการสอน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-42
                'name' => 'ตัวบ่งชี้ที่ 6 อัตราการคงอยู่ของบุคลากรสายสนับสนุน',
                'categorie_id' => 16,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-6',
                'description' => 'การสร้างความร่วมมือ หมายถึง กระบวนการดำเนินงานตามพันธกิจที่สำคัญของสถาบันการศึกษาร่วมกับสถาบันอื่น ๆ ในประเทศ หรือ ต่างประเทศ เพื่อสนับสนุนให้สถาบันบรรลุวิสัยทัศน์ และการดำเนินงานตามพันธกิจเป็นไปตามเป้าหมาย เช่น การพัฒนาการเรียนการสอน การวิจัย การบริการวิชาการ การทำนุบำรุงศิลปวัฒนธรรม การพัฒนาคุณภาพการพยาบาลในแหล่งฝึกปฏิบัติทางการพยาบาล เป็นต้น',
                'condition' => ' น้อยกว่าร้อยละ 85 (0)
                        ร้อยละ 85 – 89.9 (3)
                        เท่ากับหรือมากกว่ารัอยละ 90 (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินอัตราการคงอยู่ของบุคลากรสายสนับสนุนในสถาบันการศึกษา โดยพิจารณาจากจำนวนบุคลากรสายสนับสนุนที่ปฏิบัติงานในสถาบันการศึกษาอย่างต่อเนื่องในแต่ละปีการศึกษา เช่น อัตราคงอยู่ของบุคลากรสายสนับสนุนที่มีคุณสมบัติและความสามารถในการให้บริการ และการพัฒนาคุณภาพการให้บริการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-43
                'name' => 'ตัวบ่งชี้ที่ 7 ผลลัพธ์การพัฒนาคุณภาพการจัดการเรียนการสอนของอาจารย์',
                'categorie_id' => 16,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-7',
                'description' => 'ผลลัพธ์การพัฒนาคุณภาพการจัดการเรียนการสอนของอาจารย์ ได้แก่ ผลสำเร็จของการส่งเสริมส่งเสริมสมรรถนะและประสิทธิภาพการจัดการเรียนการสอนที่ครอบคลุม 3 องค์ประกอบ ได้แก่
                    งค์ประกอบที่ 1 องค์ความรู้(Knowledge) ประกอบด้วย 2 มิติ คือ
                           1.1 ความรู้ในศาสตร์สาขาวิชา
                           1.2 ความรู้ในศาสตร์การสอนและการเรียนรู้
                    องค์ประกอบที่ 2 สมรรถนะ (Competencies) ประกอบด้วย 4 มิติ คือ
                           2.1 ออกแบบและวางแผนการจัดกิจกรรมการเรียนรู้ของผู้เรียนอย่างมีประสิทธิภาพ
                           2.2 ดำเนินกิจกรรมการเรียนรู้ได้อย่างมีประสิทธิภาพ
                           2.3 เสริมสร้างบรรยากาศการเรียนรู้และสนับสนุนการเรียนรู้ของผู้เรียน
                           2.4 วัดและประเมินผลการเรียนรู้ของผู้เรียน พร้อมทั้งสามารถให้ข้อมูลป้อนกลับอย่างสร้างสรรค์
                     องค์ประกอบที่3 ค่านิยม (Values) ประกอบด้วย 2 มิติ คือ
                            3.1 คุณค่าในการพัฒนาวิชาชีพอาจารย์และการพัฒนาตนเองอย่างต่อเนื่อง
                            3.2 ธำรงไว้ซึ่งจรรยาบรรณแห่งวิชาชีพอาจารย์',
                'condition' => 'การประเมินปีการศึกษา 2568 - 2570
                               อาจารย์อย่างน้อยร้อยละ 70 มีคุณภาพการจัดการเรียนการสอน ระดับที่ 1 (10)
                               มีข้อ 1 และ มีอาจารย์ที่มีคุณภาพการจัดการเรียนการสอน ระดับที่ 2 อย่างน้อยร้อยละ 50 (20)
                               การประเมินปีการศึกษา 2571 เป็นต้นไป
                        อาจารย์ร้อยละ 100 มีคุณภาพการจัดการเรียนการสอน ระดับที่ 1 (7)
                        มีอาจารย์ที่มีคุณภาพการจัดการเรียนการสอน ระดับที่ 2 อย่างน้อยร้อยละ 80 (14)
                        มีอาจารย์ที่มีคุณภาพการจัดการเรียนการสอน ระดับที่ 3 อย่างน้อยร้อยละ 20 (20)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินขีดความสามารถและอัตรากำลังของบุคลากรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การกำหนดขีดความสามารถของบุคลากร การวางแผนด้านอัตรากำลัง การสรรหาบุคลากร และการเปลี่ยนแปลงในสถานการณ์ปกติและสถานการณ์ที่ไม่คาดหมาย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 20.00,
            ],
            [
                // id-44
                'name' => 'ตัวบ่งชี้ที่ 8 ผลการประเมินผลลัพธ์การเรียนรู้ ',
                'categorie_id' => 17,
                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-8',
                'description' => 'การประเมินผลลัพธ์การเรียนรู้ หมายถึง การวัดและประเมินผลลัพธ์การเรียนรู้อย่างเป็นรูปธรรม โดยมีความเชื่อมโยงและสัมพันธ์กัน (Aligned) ในทุกระดับตั้งแต่บทเรียน รายวิชา หลักสูตร',
                'condition' => ' ผ่านน้อยกว่าร้อยละ 95 (0)
                        ผ่านร้อยละ 95 - 99 (5)
                        ผ่านร้อยละ 100 (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบริหารงานบุคคลของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การจัดระบบการทำงาน การบริหารบุคลากร การมอบหมายงาน การกำกับติดตาม และการบริหารค่าตอบแทน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-45
                'name' => 'ตัวบ่งชี้ที่ 9 ร้อยละของผู้สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลผ่านในครั้งแรก',
                'categorie_id' => 17,

                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-9',
                'description' => 'ผู้สอบผ่านในครั้งแรก หมายถึง ผู้สำเร็จการศึกษาที่สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ผ่านในครั้งแรกตามรอบการจัดสอบของสภาการพยาบาลหลังสำเร็จการศึกษา
              การนับจำนวนผู้สำเร็จการศึกษาที่เข้าสอบครั้งแรกในปีการศึกษานั้น ให้ยกเว้นกรณี 
               (1) บัณฑิตไม่ประสงค์จะขอรับใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ของประเทศไทย 
               (2) ขาดสอบด้วยเหตุสุดวิสัย ให้แสดงหลักฐานเป็นลายลักษณ์อักษรจากสถาบันการศึกษา',
                'condition' => ' ใช้บัญญัติไตรยางศ์เทียบ โดยกำหนดผู้สอบผ่านครั้งแรก ย้อนหลัง 3 ปี
                        ต่ำกว่า 60 % (0)
                        ร้อยละ 60 ขึ้นไป (10)
                        ร้อยละ 70 ขึ้นไป (20)
                        ร้อยละ 80 ขึ้นไป (30)
                        ร้อยละ 90 ขึ้นไป (40)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลลัพธ์การเรียนรู้ของผู้สำเร็จการศึกษา โดยพิจารณาจากร้อยละของผู้สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลผ่านในครั้งแรก ซึ่งเป็นการวัดความสำเร็จในการเตรียมความพร้อมของผู้สำเร็จการศึกษาในการเข้าสู่วิชาชีพ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 40.00,
            ],
            [
                // id-46
                'name' => 'ตัวบ่งชี้ที่ 10 ร้อยละของผู้สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลผ่านในปีแรก ',
                'categorie_id' => 17,

                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-10',
                'description' => ' ผู้สอบผ่านในปีแรก หมายถึง ผู้สำเร็จการศึกษาที่สอบความรู้ขอขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ผ่านภายในปีแรกที่สำเร็จการศึกษา
              การนับจำนวนผู้สำเร็จการศึกษาทั้งหมดในปีแรก ให้ยกเว้นกรณีบัณฑิตไม่ประสงค์จะขอรับใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์ของประเทศไทย โดยแสดงหลักฐานเป็นลายลักษณ์อักษรจากสถาบันการศึกษา',
                'condition' => 'โดยกำหนดผู้สอบผ่านในปีแรก ย้อนหลัง 3 ปี
                        น้อยกว่าร้อยละ 80 (0)
                        ร้อยละ 80 ขึ้นไป (2)
                        ร้อยละ 85 ขึ้นไป (4)
                        ร้อยละ 90 ขึ้นไป (6)
                        ร้อยละ 95 ขึ้นไป (8)
                        ร้อยละ 100 (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการพัฒนาบุคลากรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การพัฒนาบุคลากร การพัฒนาผู้บริหาร และการพัฒนาความสามารถในการบริหารจัดการองค์กร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-47
                'name' =>
                'ตัวบ่งชี้ที่ 11 หลักสูตรได้รับการรับรองคุณภาพหลักสูตรตามมาตรฐานระดับสากล',
                'categorie_id' => 17,

                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-11',
                'description' => 'หลักสูตรได้รับการรับรองคุณภาพหลักสูตรตามมาตรฐานระดับสากล หมายถึง หลักสูตรที่ได้รับการประเมินคุณภาพตามมาตรฐานระดับสากล เช่น AUNQA , The Accreditation Commission for Education in Nursing (ACEN) เป็นต้น',
                'condition' => '  ไม่มีการดำเนินงาน (0 คะแนน)
                        มีการดำเนินการประกันคุณภาพการศึกษาภายในระดับหลักสูตรตามที่สภาสถาบันอุดมศึกษากำหนด (5 คะแนน)
                        มีการประกันคุณภาพการศึกษาภายในระดับหลักสูตรตามเกณฑ์มาตรฐานระดับสากลที่สภาสถาบันอุดมศึกษากำหนดโดยผู้ประเมินภายนอกมหาวิทยาลัยร่วมด้วยและได้ผลการประเมินระดับดีขึ้นไป (10 คะแนน)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการรับรองคุณภาพหลักสูตรของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การรับรองคุณภาพหลักสูตรตามมาตรฐานระดับสากล การประกันคุณภาพการศึกษาภายในระดับหลักสูตร และการประเมินผลการดำเนินงานของหลักสูตร',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-48
                'name' => 'ตัวบ่งชี้ที่ 12 ผลการประเมินสถานที่และการใช้สิ่งสนับสนุนการเรียนรู้',
                'categorie_id' => 17,

                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-12',
                'description' => '',
                'condition' => ' ไม่พบหลักฐาน (0)
                        มี 1 ข้อ (1)
                        มี 2 ข้อ (2)
                        มี 3 ข้อ (3)
                        มี 4 ข้อ (4)
                        ครบทุกข้อ (5)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการจัดกระบวนการเรียนรู้และการประเมินผลของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การจัดกระบวนการเรียนรู้ การประเมินผล และนวัตกรรมการเรียนการสอน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 5.00,
            ],
            [
                // id-49
                'name' => 'ตัวบ่งชี้ที่ 13  ผลงานวิจัยและผลงานวิชาการที่ตีพิมพ์เผยแพร่ต่ออาจารย์ประจำทั้งหมด',
                'categorie_id' => 18,

                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-13',
                'description' => 'อาจารย์ประจำทั้งหมด หมายถึง อาจารย์พยาบาลประจำทั้งหมดของสถาบันการศึกษา',
                'condition' => 'ใช้บัญญัติไตรยางศ์เทียบโดยกำหนดผลงานวิจัยและผลงานวิชาการที่ตีพิมพ์เผยแพร่ที่คำนวณจากระดับคุณภาพงานวิจัย ร้อยละ 70 เท่ากับ 25 คะแนน
                คะแนนืั้ได้ = ร้อยละของผลงานทางวิชาการ/70*25',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลงานวิจัยและผลงานวิชาการที่ตีพิมพ์เผยแพร่ของอาจารย์ประจำทั้งหมดของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การตีพิมพ์ผลงานวิจัยและผลงานวิชาการในวารสารวิชาการที่มีคุณภาพ และการเผยแพร่ผลงานวิจัยและผลงานวิชาการในงานประชุมวิชาการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 25.00,
            ],
            [
                // id-50
                'name' => 'ตัวบ่งชี้ที่ 14 ผลลัพธ์การผลิตตำรา/หนังสือ',
                'categorie_id' => 18,

                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-13',
                'description' => 'ตำรา หมายถึง ผลงานวิชาการที่ใช้สำหรับการเรียนการสอนทั้งวิชา หรือเป็นส่วนหนึ่งของวิชา ซึ่งเกิดจากการนำข้อค้นพบจากทฤษฎีจากงานวิจัยของตนเอง หรือความรู้ที่ได้จากการค้นคว้าศึกษา มาวิเคราะห์ สังเคราะห์รวบรวมและเรียบเรียง โดยมีมโนทัศน์ที่ผู้เขียนกำหนดให้เป็นแกนกลาง ซึ่งสัมพันธ์กับมโนทัศน์ย่อยอื่นอย่างเป็นระบบ มีเอกภาพ สัมพันธภาพ และสารัตถภาพตามหลักการเขียนที่ดี ใช้ภาษาที่เป็นมาตรฐานทางวิชาการ และให้ความรู้ใหม่ อันเป็นความรู้สำคัญที่มีผลให้เกิดความเปลี่ยนแปลงต่อวงการวิชาการนั้น ๆ เนื้อหาสาระของตำราต้องมีความทันสมัย เป็นรูปเล่มที่ประกอบด้วย คำนำ สารบัญ เนื้อเรื่อง การอธิบายหรือการวิเคราะห์ การสรุป การอ้างอิง บรรณานุกรม และดัชนีค้นคำ ทั้งนี้ควรมีการอ้างอิงแหล่งข้อมูลที่ทันสมัยและ ครบถ้วนสมบูรณ์ การอธิบายสาระสำคัญมีความชัดเจน โดยอาจใช้ข้อมูล แผนภาพ ตัวอย่าง หรือกรณีศึกษาประกอบจนผู้อ่านสามารถทำความเข้าใจในสาระสำคัญนั้นได้โดยเบ็ดเสร็จ
                      หนังสือ หมายถึง ผลงานวิชาการที่เกิดจากการค้นคว้าศึกษาความรู้ในเรื่องใดเรื่องหนึ่งอย่างรอบด้านและลึกซึ้ง มีการวิเคราะห์ สังเคราะห์และเรียบเรียงอย่างเป็นระบบ ประกอบด้วยมโนทัศน์หลัก ที่เป็นแกนกลางและมโนทัศน์ย่อยที่สัมพันธ์กัน มีความละเอียดลึกซึ้ง ใช้ภาษาที่เป็นมาตรฐานทางวิชาการ ให้ทัศนะของผู้เขียนที่สร้างเสริมปัญญาความคิดและสร้างความแข็งแกร่งทางวิชาการให้แก่สาขาวิชานั้น ๆ หรือสาขาวิชาที่เกี่ยวข้อง เนื้อหาของหนังสือไม่จำเป็นต้องสอดคล้องหรือเป็นไปตามข้อกำหนดของหลักสูตรหรือของวิชาใดวิชาหนึ่ง ในหลักสูตรและ ไม่จำเป็นต้องนำไปใช้ประกอบการเรียนการสอนในวิชาใดวิชาหนึ่ง เนื้อหาสาระของหนังสือต้องมีความทันสมัย เป็นรูปเล่มที่ประกอบด้วย คำนำ สารบัญ เนื้อเรื่อง การวิเคราะห์ การสรุป การอ้างอิง บรรณานุกรม และดัชนีค้นคำ ที่ทันสมัยและครบถ้วนสมบูรณ์ โดยอาจมีข้อมูล แผนภาพ ตัวอย่าง หรือกรณีศึกษาประกอบด้วยก็ได้ ตามรูปแบบอย่างใดอย่างหนึ่งต่อไปนี้ ๑. เป็นงานที่นักวิชาการเขียนทั้งเล่ม (authored book) คือเอกสารที่ผู้เขียนเรียบเรียง ขึ้นทั้งเล่มอย่างมีเอกภาพ มีรากฐานทางวิชาการที่มั่นคง และให้ทัศนะของผู้เขียนที่สร้าง เสริมปัญญา ความคิด และสร้างความแข็งแกร่งทางวิชาการ ๒. เป็นงานวิชาการบางบทหรือส่วนหนึ่งในหนังสือที่มีผู้เขียนหลายคน (book chapter) โดยจะต้องมีความเป็นเอกภาพของเนื้อหาวิชาการ ซึ่งผู้อ่านสามารถทำความเข้าใจ ในสาระสำคัญนั้นได้โดยเบ็ดเสร็จในแต่ละบท และเป็นงานศึกษาค้นคว้าอย่างมีระบบ มีการวิเคราะห์และสังเคราะห์ข้อมูลด้วยวิธีวิทยาอันเป็นที่ยอมรับจนได้ข้อสรุปที่ทำให้เกิด ความก้าวหน้าทางวิชาการ หรือนำไปประยุกต์ใช้ได้ กรณีที่ในแต่ละบทมีผู้เขียนหลายคน จะต้องระบุบทบาทหน้าที่ของแต่ละคนอย่างชัดเจน จำนวนบทที่จะนำมาแทนหนังสือ ๑ เล่ม ต้องมีจำนวนอย่างน้อย ๕ บท และมีจำนวนหน้ารวมกันแล้วไม่น้อยกว่า ๘๐ หน้า โดยเนื้อหาสาระของบทในหนังสือทั้ง ๕ บท จะต้องไม่ซ้ำซ้อนกัน
                      ผู้ทรงคุณวุฒิที่ทำหน้าที่ประเมินผลงานทางวิชาการและจริยธรรมและจรรยาบรรณทางวิชาการ ในสาขาวิชานั้น ๆ ซึ่งมีองค์ประกอบ ดังนี้ (๑) ประธานกรรมการ (๒) กรรมการผู้ทรงคุณวุฒิ จำนวนสามถึงห้าคน การแต่งตั้งกรรมการผู้ทรงคุณวุฒิเพื่อทำหน้าที่ประเมินผลงานทางวิชาการ และจริยธรรมและจรรยาบรรณทางวิชาการ ต้องคัดสรรจากบัญชีรายชื่อผู้ทรงคุณวุฒิที่ ก.พ.อ. กาหนด สำหรับสาขาวิชาที่เสนอขอ หรือมีความรู้ความเชี่ยวชาญเกี่ยวข้องกับสาขาวิชาและผลงานที่เสนอขอ โดยต้องไม่ใช่บุคลากรและไม่เคยเป็นบุคลากรในสังกัดสถาบันอุดมศึกษานั้น ๆ รวมทั้งมีตำแหน่งทางวิชาการไม่ต่ำกว่าตำแหน่งที่เสนอขอ',
                'condition' => '1 สาขาหลักทางการพยาบาล (2)
                        2 สาขาหลักทางการพยาบาล (4)
                        3 สาขาหลักทางการพยาบาล (6)
                        4 สาขาหลักทางการพยาบาล (8)
                        5 สาขาหลักทางการพยาบาล (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลการผลิตตำรา/หนังสือของสถาบันการศึกษา โดยพิจารณาจากจำนวนสาขาหลักทางการพยาบาลที่มีการผลิตตำรา/หนังสือ และคุณภาพของผลงานที่ตีพิมพ์เผยแพร่ เช่น การตีพิมพ์ในวารสารวิชาการที่มีคุณภาพ และการเผยแพร่ผลงานวิจัยและผลงานวิชาการในงานประชุมวิชาการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-51
                'name' => 'ตัวบ่งชี้ที่ 15 จำนวนทรัพย์สินทางปัญญา (สิทธิบัตรและอนุสิทธิบัตร)',
                'categorie_id' => 18,

                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-15',
                'description' => '',
                'condition' => ' ไม่มีชิ้นงาน (0)
                        มีผลงานที่มีสิขสิทธิ์ (5)
                        มีผลงานที่มีอนุสิทธิบัตร (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินจำนวนทรัพย์สินทางปัญญา (สิทธิบัตรและอนุสิทธิบัตร) ของสถาบันการศึกษา โดยพิจารณาจากจำนวนผลงานที่มีสิทธิ์ได้รับการคุ้มครองตามกฎหมายทรัพย์สินทางปัญญา เช่น สิทธิบัตรและอนุสิทธิบัตรที่ได้รับการจดทะเบียน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-52
                'name' => 'ตัวบ่งชี้ที่ 16 ผลลัพธ์ของโครงการบริการวิชาการที่เป็นประโยชน์ต่อสังคมและประเทศ',
                'categorie_id' => 19,

                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-16',
                'description' => '',
                'condition' => ' ไม่มีหลักฐานฐานการดำเนินงาน (0)
                         ผลลัพธ์บรรลุวัตถุประสงค์และเป้าหมายของโครงการ (10)
                         ผลลัพธ์ตอบสนองความต้องการของชุมชนและส่งผลให้ชุมชนเข้มแข็ง (20)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินผลลัพธ์ของโครงการบริการวิชาการที่เป็นประโยชน์ต่อสังคมและประเทศ โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การดำเนินงานโครงการบริการวิชาการที่ตอบสนองความต้องการของชุมชน การสร้างความเข้มแข็งให้กับชุมชน และการส่งเสริมการพัฒนาที่ยั่งยืน',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 20.00,
            ],
            [
                // id-53
                'name' => 'ตัวบ่งชี้ที่ 17 ร้อยละของอาจารย์พยาบาลประจำที่ปฏิบัติการพยาบาลในสาขาวิชาที่รับผิดชอบ',
                'categorie_id' => 19,

                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-17',
                'description' => 'อาจารย์พยาบาลประจำที่ปฏิบัติการพยาบาล หมายถึง อาจารย์พยาบาลของสถาบันการศึกษาที่รับผิดชอบ ในการสอนรายวิชาการพยาบาลและวิชาการรักษาโรคเบื้องต้น ทั้งนี้ไม่นับรวมอาจารย์ประจำที่มีตำแหน่งเป็นผู้บริหารตามที่สภามหาวิทยาลัยกำหนด',
                'condition' => 'น้อยกว่าร้อยละ 60 (0)
                        ร้อยละ 60 - 69 (5)
                        ร้อยละ 70 - 79 (10)
                        ร้อยละ 80 - 89 (15)
                        ร้อยละ 90 ขึ้นไป (20)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินกระบวนการเผยแพร่งานวิจัยและ/หรือทรัพย์สินทางปัญญาของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำผลงานวิจัยไปเผยแพร่ การจดทรัพย์สินทางปัญญา และการจัดทำต้นฉบับงานวิจัยที่มีคุณภาพ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 20.00,
            ],
            [
                // id-54
                'name' => 'ตัวบ่งชี้ที่ 18 การปฏิบัติการพยาบาลของอาจารย์ (faculty pracitce)',
                'categorie_id' => 20,

                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-18',
                'description' => ' การปฏิบัติการพยาบาลของอาจารย์ (faculty practice) หมายถึง การนำความชำนาญหรือความเชี่ยวชาญของอาจารย์พยาบาล ไปให้บริการโดยตรงแก่ผู้รับบริการ เป็นรายบุคคล ครอบครัว กลุ่ม หรือชุมชน แสดงให้เห็นถึงความชำนาญ/เชี่ยวชาญทางคลินิก (clinical area) ของอาจารย์พยาบาลในสาขานั้น ๆ นำไปสู่การพัฒนาคุณภาพการพยาบาล
                    วิชาชีพการพยาบาลเป็นวิชาชีพการปฏิบัติ (practice profession) อาจารย์พยาบาลต้องมีความชำนาญในการพยาบาลผู้รับบริการแต่ละสาขา เฉพาะกลุ่ม/เฉพาะโรค ซึ่งเป็นสมรรถนะมาตรฐาน',
                'condition' => ' ไม่พบหลักฐานการบูรณาการ (0)
                    การบูรณาการกับการเรียนการสอนในรายวิชาที่เกี่ยวข้อง (5)
                    การบูรณาการกับการเรียนการสอนในรายวิชาที่เกี่ยวข้องและการวิจัยหรือการบริการวิชาการ (10)
                    การบูรณาการกับการเรียนการสอนในรายวิชาที่เกี่ยวข้องและการวิจัยและการบริการวิชาการ (15)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการปฏิบัติการพยาบาลของอาจารย์ โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำความชำนาญหรือความเชี่ยวชาญของอาจารย์พยาบาลไปให้บริการโดยตรงแก่ผู้รับบริการ การบูรณาการการปฏิบัติการพยาบาลเข้ากับการเรียนการสอน และการวิจัยหรือบริการวิชาการ',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 15.00,
            ],
            [
                // id-55
                'name' => 'ตัวบ่งชี้ที่ 19 ร้อยละของบัณฑิตที่มีอัตลักษณ์/คุณลักษณะพิเศษตามที่สถาบันกำหนด ',
                'categorie_id' => 21,

                'year' => 2026,
                'type' => 'ปริมาณ',
                'code' => 'NCO-19',
                'description' => '',
                'condition' => 'ใช้บัญญัติไตรยางค์เทียบโดยกำหนดร้อยละของบัณฑิตที่มีอัตลักษณ์/คุณลักษณะพิเศษตามที่สถาบันกำหนดต่อจำนวนบัณฑิตทั้งหมด ที่มีค่าคะแนนเฉลี่ยตั้งแต่ 3.51 ขึ้นไปในระบบ 5 คะแนน ร้อยละ100 เท่ากับ 10 คะแนน',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการบูรณาการการทำนุบำรุงศิลปะและวัฒนธรรมของสถาบันการศึกษา โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การนำศิลปะและวัฒนธรรม/ภูมิปัญญาของท้องถิ่นหรือไทย บูรณาการเข้ากับศาสตร์ทางวิทยาศาสตร์สุขภาพ และการพัฒนาองค์ความรู้ที่มีรากฐานความเป็นไทย',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],
            [
                // id-56
                'name' => 'ตัวบ่งชี้ที่ 20 การทำคุณประโยชน์ต่อสถาบันของศิษย์เก่า',
                'categorie_id' => 21,

                'year' => 2026,
                'type' => 'คุณภาพ',
                'code' => 'NCO-20',
                'description' => 'การทำคุณประโยชน์ต่อสถาบันของศิษย์เก่า หมายถึง การช่วยเหลือสถาบันการศึกษาของศิษย์เก่าในลักษณะที่เป็นประโยชน์ เพื่อให้บรรลุพันธกิจของสถาบัน',
                'condition' => 'ไม่มีการดำเนินการ (0)
                        มี ข้อ 1 (3)
                        มีข้อ 1 และ 2 (6)
                        มีครบทุกข้อ (10)',
                'annotation' => '',
                'deadline' => '2025-10-01',
                'created_at' => now(),
                'updated_at' => now(),
                'status' => '2',
                'comment' => 'ตัวบ่งชี้นี้จะประเมินการทำคุณประโยชน์ต่อสถาบันของศิษย์เก่า โดยพิจารณาจากจำนวนข้อที่มีอยู่ในแต่ละด้าน เช่น การช่วยเหลือสถาบันการศึกษาในลักษณะที่เป็นประโยชน์ การสนับสนุนกิจกรรมต่าง ๆ ของสถาบัน และการสร้างเครือข่ายความร่วมมือกับศิษย์เก่า',
                // 'score_acc' => '', // คะแนนที่ได้รับ
                'max_score' => 10.00,
            ],

        ]);
    }
}
